[
  {
    "title": "Google DeepMind’s new AI agent uses large language models to crack real-world problems",
    "url": "https://www.technologyreview.com/2025/05/14/1116438/google-deepminds-new-ai-uses-large-language-models-to-crack-real-world-problems/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Wed, 14 May 2025 15:00:08 +0000",
    "published_datetime": "2025-05-14T16:00:08",
    "summary": "Google DeepMind has once again used large language models to discover new solutions to long-standing problems in math and computer science. This time the firm has shown that its approach can not only tackle unsolved theoretical puzzles, but improve a range of important real-world processes as well.\nGoogle DeepMind’s new tool, called AlphaEvolve, uses the Gemini 2.0 family of large language models (LLMs) to produce code for a wide range of different tasks. LLMs are known to be hit and miss at coding. The twist here is that AlphaEvolve scores each of Gemini’s suggestions, throwing out the bad and tweaking the good, in an iterative process, until it has produced the best algorithm it can. In many cases, the results are more efficient or more accurate than the best existing (human-written) solutions.\n“You can see it as a sort of super coding agent,” says Pushmeet Kohli, a vice president at Google DeepMind who leads its AI for Science teams. “It doesn’t just propose a piece of code or an edit, it actually produces a result that maybe nobody was aware of.”\nIn particular, AlphaEvolve came up with a way to improve the software Google uses to allocate jobs to its many millions of servers around the world. Google DeepMind claims the company has been using this new software across all of its data centers for more than a year, freeing up 0.7% of Google’s total computing resources. That might not sound like much, but at Google’s scale it’s huge.\nJakob Moosbauer, a mathematician at the University of Warwick in the UK, is impressed. He says the way AlphaEvolve searches for algorithms that produce specific solutions—rather than searching for the solutions themselves—makes it especially powerful. “It makes the approach applicable to such a wide range of problems,” he says. “AI is becoming a tool that will be essential in mathematics and computer science.”\nAlphaEvolve continues a line of work that Google DeepMind has been pursuing for years. Its vision is that AI can help to advance human knowledge across math and science. In 2022, it developed AlphaTensor, a model that found a faster way to solve matrix multiplications—a fundamental problem in computer science—beating a record that had stood for more than 50 years. In 2023, it revealed AlphaDev, which discovered faster ways to perform a number of basic calculations performed by computers trillions of times a day. AlphaTensor and AlphaDev both turn math problems into a kind of game, then search for a winning series of moves.\nFunSearch, which arrived in late 2023, swapped out game-playing AI and replaced it with LLMs that can generate code. Because LLMs can carry out a range of tasks, FunSearch can take on a wider variety of problems than its predecessors, which were trained to play just one type of game. The tool was used to crack a famous unsolved problem in pure mathematics.\nAlphaEvolve is the next generation of FunSearch. Instead of coming up with short snippets of code to solve a specific problem, as FunSearch did, it can produce programs that are hundreds of lines long. This makes it applicable to a much wider variety of problems.    \nIn theory, AlphaEvolve could be applied to any problem that can be described in code and that has solutions that can be evaluated by a computer. “Algorithms run the world around us, so the impact of that is huge,” says Matej Balog, a researcher at Google DeepMind who leads the algorithm discovery team.\nSurvival of the fittest\nHere’s how it works: AlphaEvolve can be prompted like any LLM. Give it a description of the problem and any extra hints you want, such as previous solutions, and AlphaEvolve will get Gemini 2.0 Flash (the smallest, fastest version of Google DeepMind’s flagship LLM) to generate multiple blocks of code to solve the problem.\nIt then takes these candidate solutions, runs them to see how accurate or efficient they are, and scores them according to a range of relevant metrics. Does this code produce the correct result? Does it run faster than previous solutions? And so on.\nAlphaEvolve then takes the best of the current batch of solutions and asks Gemini to improve them. Sometimes AlphaEvolve will throw a previous solution back into the mix to prevent Gemini from hitting a dead end.\nWhen it gets stuck, AlphaEvolve can also call on Gemini 2.0 Pro, the most powerful of Google DeepMind’s LLMs. The idea is to generate many solutions with the faster Flash but add solutions from the slower Pro when needed.\nThese rounds of generation, scoring, and regeneration continue until Gemini fails to come up with anything better than what it already has.\nNumber games\nThe team tested AlphaEvolve on a range of different problems. For example, they looked at matrix multiplication again to see how a general-purpose tool like AlphaEvolve compared to the specialized AlphaTensor. Matrices are grids of numbers. Matrix multiplication is a basic computation that underpins many applications, from AI to computer graphics, yet nobody knows the fastest way to do it. “It’s kind of unbelievable that it’s still an open question,” says Balog.\nThe team gave AlphaEvolve a description of the problem and an example of a standard algorithm for solving it. The tool not only produced new algorithms that could calculate 14 different sizes of matrix faster than any existing approach, it also improved on AlphaTensor’s record-beating result for multipying two four-by-four matrices. \nAlphaEvolve scored 16,000 candidates suggested by Gemini to find the winning solution, but that’s still more efficient than AlphaTensor, says Balog. AlphaTensor’s solution also only worked when a matrix was filled with 0s and 1s. AlphaEvolve solves the problem with other numbers too.\n“The result on matrix multiplication is very impressive,” says Moosbauer. “This new algorithm has the potential to speed up computations in practice.”\nManuel Kauers, a mathematician at Johannes Kepler University in Linz, Austria, agrees: “The improvement for matrices is likely to have practical relevance.”\nBy coincidence, Kauers and a colleague have just used a different computational technique to find some of the speedups AlphaEvolve came up with. The pair posted a paper online reporting their results last week.\n“It is great to see that we are moving forward with the understanding of matrix multiplication,” says Kauers. “Every technique that helps is a welcome contribution to this effort.”\nReal-world problems\nMatrix multiplication was just one breakthrough. In total, Google DeepMind tested AlphaEvolve on more than 50 different types of well-known math puzzles, including problems in Fourier analysis (the math behind data compression, essential to applications such as video streaming), the minimum overlap problem (an open problem in number theory proposed by mathematician Paul Erdős in 1955), and kissing numbers (a problem introduced by Isaac Newton that has applications in materials science, chemistry, and cryptography). AlphaEvolve matched the best existing solutions in 75% of cases and found better solutions in 20% of cases.  \nGoogle DeepMind then applied AlphaEvolve to a handful of real-world problems. As well as coming up with a more efficient algorithm for managing computational resources across data centers, the tool found a way to reduce the power consumption of Google’s specialized tensor processing unit chips.\nAlphaEvolve even found a way to speed up the training of Gemini itself, by producing a more efficient algorithm for managing a certain type of computation used in the training process.\nGoogle DeepMind plans to continue exploring potential applications of its tool. One limitation is that AlphaEvolve can’t be used for problems with solutions that need to be scored by a person, such as lab experiments that are subject to interpretation.   \nMoosbauer also points out that while AlphaEvolve may produce impressive new results across a wide range of problems, it gives little theoretical insight into how it arrived at those solutions. That’s a drawback when it comes to advancing human understanding.  \nEven so, tools like AlphaEvolve are set to change the way researchers work. “I don’t think we are finished,” says Kohli. “There is much further that we can go in terms of how powerful this type of approach is.”",
    "content": "Google DeepMind has once again used large language models to discover new solutions to long-standing problems in math and computer science. This time the firm has shown that its approach can not only tackle unsolved theoretical puzzles, but improve a range of important real-world processes as well.\nGoogle DeepMind’s new tool, called AlphaEvolve, uses the Gemini 2.0 family of large language models (LLMs) to produce code for a wide range of different tasks. LLMs are known to be hit and miss at coding. The twist here is that AlphaEvolve scores each of Gemini’s suggestions, throwing out the bad and tweaking the good, in an iterative process, until it has produced the best algorithm it can. In many cases, the results are more efficient or more accurate than the best existing (human-written) solutions.\n“You can see it as a sort of super coding agent,” says Pushmeet Kohli, a vice president at Google DeepMind who leads its AI for Science teams. “It doesn’t just propose a piece of code or an edit, it actually produces a result that maybe nobody was aware of.”\nIn particular, AlphaEvolve came up with a way to improve the software Google uses to allocate jobs to its many millions of servers around the world. Google DeepMind claims the company has been using this new software across all of its data centers for more than a year, freeing up 0.7% of Google’s total computing resources. That might not sound like much, but at Google’s scale it’s huge.\nJakob Moosbauer, a mathematician at the University of Warwick in the UK, is impressed. He says the way AlphaEvolve searches for algorithms that produce specific solutions—rather than searching for the solutions themselves—makes it especially powerful. “It makes the approach applicable to such a wide range of problems,” he says. “AI is becoming a tool that will be essential in mathematics and computer science.”\nAlphaEvolve continues a line of work that Google DeepMind has been pursuing for years. Its vision is that AI can help to advance human knowledge across math and science. In 2022, it developed AlphaTensor, a model that found a faster way to solve matrix multiplications—a fundamental problem in computer science—beating a record that had stood for more than 50 years. In 2023, it revealed AlphaDev, which discovered faster ways to perform a number of basic calculations performed by computers trillions of times a day. AlphaTensor and AlphaDev both turn math problems into a kind of game, then search for a winning series of moves.\nFunSearch, which arrived in late 2023, swapped out game-playing AI and replaced it with LLMs that can generate code. Because LLMs can carry out a range of tasks, FunSearch can take on a wider variety of problems than its predecessors, which were trained to play just one type of game. The tool was used to crack a famous unsolved problem in pure mathematics.\nAlphaEvolve is the next generation of FunSearch. Instead of coming up with short snippets of code to solve a specific problem, as FunSearch did, it can produce programs that are hundreds of lines long. This makes it applicable to a much wider variety of problems.    \nIn theory, AlphaEvolve could be applied to any problem that can be described in code and that has solutions that can be evaluated by a computer. “Algorithms run the world around us, so the impact of that is huge,” says Matej Balog, a researcher at Google DeepMind who leads the algorithm discovery team.\nSurvival of the fittest\nHere’s how it works: AlphaEvolve can be prompted like any LLM. Give it a description of the problem and any extra hints you want, such as previous solutions, and AlphaEvolve will get Gemini 2.0 Flash (the smallest, fastest version of Google DeepMind’s flagship LLM) to generate multiple blocks of code to solve the problem.\nIt then takes these candidate solutions, runs them to see how accurate or efficient they are, and scores them according to a range of relevant metrics. Does this code produce the correct result? Does it run faster than previous solutions? And so on.\nAlphaEvolve then takes the best of the current batch of solutions and asks Gemini to improve them. Sometimes AlphaEvolve will throw a previous solution back into the mix to prevent Gemini from hitting a dead end.\nWhen it gets stuck, AlphaEvolve can also call on Gemini 2.0 Pro, the most powerful of Google DeepMind’s LLMs. The idea is to generate many solutions with the faster Flash but add solutions from the slower Pro when needed.\nThese rounds of generation, scoring, and regeneration continue until Gemini fails to come up with anything better than what it already has.\nNumber games\nThe team tested AlphaEvolve on a range of different problems. For example, they looked at matrix multiplication again to see how a general-purpose tool like AlphaEvolve compared to the specialized AlphaTensor. Matrices are grids of numbers. Matrix multiplication is a basic computation that underpins many applications, from AI to computer graphics, yet nobody knows the fastest way to do it. “It’s kind of unbelievable that it’s still an open question,” says Balog.\nThe team gave AlphaEvolve a description of the problem and an example of a standard algorithm for solving it. The tool not only produced new algorithms that could calculate 14 different sizes of matrix faster than any existing approach, it also improved on AlphaTensor’s record-beating result for multipying two four-by-four matrices. \nAlphaEvolve scored 16,000 candidates suggested by Gemini to find the winning solution, but that’s still more efficient than AlphaTensor, says Balog. AlphaTensor’s solution also only worked when a matrix was filled with 0s and 1s. AlphaEvolve solves the problem with other numbers too.\n“The result on matrix multiplication is very impressive,” says Moosbauer. “This new algorithm has the potential to speed up computations in practice.”\nManuel Kauers, a mathematician at Johannes Kepler University in Linz, Austria, agrees: “The improvement for matrices is likely to have practical relevance.”\nBy coincidence, Kauers and a colleague have just used a different computational technique to find some of the speedups AlphaEvolve came up with. The pair posted a paper online reporting their results last week.\n“It is great to see that we are moving forward with the understanding of matrix multiplication,” says Kauers. “Every technique that helps is a welcome contribution to this effort.”\nReal-world problems\nMatrix multiplication was just one breakthrough. In total, Google DeepMind tested AlphaEvolve on more than 50 different types of well-known math puzzles, including problems in Fourier analysis (the math behind data compression, essential to applications such as video streaming), the minimum overlap problem (an open problem in number theory proposed by mathematician Paul Erdős in 1955), and kissing numbers (a problem introduced by Isaac Newton that has applications in materials science, chemistry, and cryptography). AlphaEvolve matched the best existing solutions in 75% of cases and found better solutions in 20% of cases.  \nGoogle DeepMind then applied AlphaEvolve to a handful of real-world problems. As well as coming up with a more efficient algorithm for managing computational resources across data centers, the tool found a way to reduce the power consumption of Google’s specialized tensor processing unit chips.\nAlphaEvolve even found a way to speed up the training of Gemini itself, by producing a more efficient algorithm for managing a certain type of computation used in the training process.\nGoogle DeepMind plans to continue exploring potential applications of its tool. One limitation is that AlphaEvolve can’t be used for problems with solutions that need to be scored by a person, such as lab experiments that are subject to interpretation.   \nMoosbauer also points out that while AlphaEvolve may produce impressive new results across a wide range of problems, it gives little theoretical insight into how it arrived at those solutions. That’s a drawback when it comes to advancing human understanding.  \nEven so, tools like AlphaEvolve are set to change the way researchers work. “I don’t think we are finished,” says Kohli. “There is much further that we can go in terms of how powerful this type of approach is.”"
  },
  {
    "title": "The first US hub for experimental medical treatments is coming",
    "url": "https://www.technologyreview.com/2025/05/14/1116428/first-us-hub-for-experimental-medical-treatments/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Wed, 14 May 2025 12:30:00 +0000",
    "published_datetime": "2025-05-14T13:30:00",
    "summary": "A bill that allows medical clinics to sell unproven treatments has been passed in Montana. \nUnder the legislation, doctors can apply for a license to open an experimental treatment clinic and recommend and sell therapies not approved by the Food and Drug Administration (FDA) to their patients. Once it’s signed by the governor, the law will be the most expansive in the country in allowing access to drugs that have not been fully tested. \nThe bill allows for any drug produced in the state to be sold in it, providing it has been through phase I clinical trials—the initial, generally small, first-in-human studies that are designed to check that a new treatment is not harmful. These trials do not determine if the drug is effective.\nThe bill, which was passed by the state legislature on April 29 and is expected to be signed by Governor Greg Gianforte, essentially expands on existing Right to Try legislation in the state. But while that law was originally designed to allow terminally ill people to access experimental drugs, the new bill was drafted and lobbied for by people interested in extending human lifespans—a group of longevity enthusiasts that includes scientists, libertarians, and influencers.  \nThese longevity enthusiasts are hoping Montana will serve as a test bed for opening up access to experimental drugs. “I see no reason why it couldn’t be adopted by most of the other states,” said Todd White, speaking to an audience of policymakers and others interested in longevity at an event late last month in Washington, DC. White, who helped develop the bill and directs a research organization focused on aging, added that “there are some things that can be done at the federal level to allow Right to Try laws to proliferate more readily.” \nSupporters of the bill say it gives individuals the freedom to make choices about their own bodies. At the same event, bioethicist Jessica Flanigan of the University of Richmond said she was “optimistic” about the measure, because “it’s great any time anybody is trying to give people back their medical autonomy.” \nUltimately, they hope that the new law will enable people to try unproven drugs that might help them live longer, make it easier for Americans to try experimental treatments without having to travel abroad, and potentially turn Montana into a medical tourism hub.\nBut ethicists and legal scholars aren’t as optimistic. “I hate it,” bioethicist Alison Bateman-House of New York University says of the bill. She and others are worried about the ethics of promoting and selling unproven treatments—and the risks of harm should something go wrong.\nEasy access?\nNo drugs have been approved to treat human aging. Some in the longevity field believe that regulation has held back the development of such drugs. In the US, federal law requires that drugs be shown to be both safe and effective before they can be sold. That requirement was made law in the 1960s following the thalidomide tragedy, in which women who took the drug for morning sickness had babies with sometimes severe disabilities. Since then, the FDA has been responsible for the approval of new drugs.  \nTypically, new drugs are put through a series of human trials. Phase I trials generally involve between 20 and 100 volunteers and are designed to check that the drug is safe for humans. If it is, the drug is then tested in larger groups of hundreds, and then thousands, of volunteers to assess the dose and whether it actually works. Once a drug is approved, people who are prescribed it are monitored for side effects. The entire process is slow, and it can last more than a decade—a particular pain point for people who are acutely aware of their own aging. \nBut some exceptions have been made for people who are terminally ill under Right to Try laws. Those laws allow certain individuals to apply for access to experimental treatments that have been through phase I clinical trials but have not received FDA approval.\nMontana first passed a Right to Try law in 2015 (a federal law was passed around three years later). Then in 2023, the state expanded the law to include all patients there, not just those with terminal illnesses—meaning that any person in Montana could, in theory, take a drug that had been through only a phase I trial.\nAt the time, this was cheered by many longevity enthusiasts—some of whom had helped craft the expanded measure.\nBut practically, the change hasn’t worked out as they envisioned. “There was no licensing, no processing, no registration” for clinics that might want to offer those drugs, says White. “There needed to be another bill that provided regulatory clarity for service providers.” \nSo the new legislation addresses “how clinics can set up shop in Montana,” says Dylan Livingston, founder and CEO of the Alliance for Longevity Initiatives, which hosted the DC event. Livingston built A4LI, as it’s known, a few years ago, as a lobbying group for the science of human aging and longevity.\nLivingston, who is exploring multiple approaches to improve both funding for scientific research and to change drug regulation, helped develop and push the 2023 bill in Montana with the support of State Senator Kenneth Bogner, he says. “I gave [Bogner] a menu of things that could be done at the state level … and he loved the idea” of turning Montana into a medical tourism hub, he says. \nAfter all, as things stand, plenty of Americans travel abroad to receive experimental treatments that cannot legally be sold in the US, including expensive, unproven stem cell and gene therapies, says Livingston. \n“If you’re going to go and get an experimental gene therapy, you might as well keep it in the country,” he says. Livingston has suggested that others might be interested in trying a novel drug designed to clear aged “senescent” cells from the body, which is currently entering phase II trials for an eye condition caused by diabetes. “One: let’s keep the money in the country, and two: if I was a millionaire getting an experimental gene therapy, I’d rather be in Montana than Honduras.”\n“Los Alamos for longevity”\nHonduras, in particular, has become something of a home base for longevity experiments. The island of Roatán is home to the Global Alliance for Regenerative Medicine clinic, which, along with various stem cell products, sells a controversial unproven “anti-aging” gene therapy for around $20,000 to customers including wealthy longevity influencer Bryan Johnson. \nTech entrepreneur and longevity enthusiast Niklas Anzinger has also founded the city of Infinita in the region’s special economic zone of Próspera, a private city where residents are able to make their own suggestions for medical regulations. It’s the second time he’s built a community there as part of his effort to build a “Los Alamos for longevity” on the island, a place where biotech companies can develop therapies that slow or reverse human aging “at warp speed,” and where individuals are free to take those experimental treatments. (The first community, Vitalia, featured a biohacking lab, but came to an end following a disagreement between the two founders.) \nAnzinger collaborated with White, the longevity enthusiast who spoke at the A4LI event (and is an advisor to Infinita VC, Anzinger’s investment company), to help put together the new Montana bill. “He asked if I would help him try to advance the new bill, so that’s what we did for the last few months,” says White, who trained as an electrical engineer but left his career in telecommunications to work with an organization that uses blockchain to fund research into extending human lifespans. \n“Right to Try has always been this thing [for people] who are terminal[ly ill] and trying a Hail Mary approach to solving these things; now Right to Try laws are being used to allow you to access treatments earlier,” White told the audience at the A4LI event. “Making it so that people can use longevity medicines earlier is, I think, a very important thing.”\nThe new bill largely sets out the “infrastructure” for clinics that want to sell experimental treatments, says White. It states that clinics will need to have a license, for example, and that this must be renewed on an annual basis. \n“Now somebody who actually wants to deliver drugs under the Right to Try law will be able to do so,” he says. The new legislation also protects prescribing doctors from disciplinary action.\nAnd it sets out requirements for informed consent that go further than those of existing Right to Try laws. Before a person takes an experimental drug under the new law, they will be required to provide a written consent that includes a list of approved alternative drugs and a description of the worst potential outcome.\nOn the safe side\n“In the Montana law, we explicitly enhanced the requirements for informed consent,” Anzinger told an audience at the same A4LI event. This, along with the fact that the treatments will have been through phase I clinical trials, will help to keep people safe, he argued. “We have to treat this with a very large degree of responsibility,” he added.\n“We obviously don’t want to be killing people,” says Livingston. \nBut he also adds that he, personally, won’t be signing up for any experimental treatments. “I want to be the 10 millionth, or even the 50 millionth, person to get the gene therapy,” he says. “I’m not that adventurous … I’ll let other people go first.”\nOthers are indeed concerned that, for the “adventurous” people, these experimental treatments won’t necessarily be safe. Phase I trials are typically tiny, and they often involve less than 50 people, all of whom are typically in good health. A trial like that won’t tell you much about side effects that only show up in 5% of people, for example, or about interactions the drug might have with other medicines.\nAround 90% of drug candidates in clinical trials fail. And around 17% of drugs fail late-stage clinical trials because of safety concerns. Even those that make it all the way through clinical trials and get approved by the FDA can still end up being withdrawn from the market when rare but serious side effects show up. Between 1992 and 2023, 23 drugs that were given accelerated approval for cancer indications were later withdrawn from the market. And between 1950 and 2013, the reason for the withdrawal of 95 drugs was “death.”\n“It’s disturbing that they want to make drugs available after phase I testing,” says Sharona Hoffman, professor of law and bioethics at Case Western Reserve University in Cleveland, Ohio. “This could endanger patients.”\n“Famously, the doctor’s first obligation is to first do no harm,” says Bateman-House. “If [a drug] has not been through clinical trials, how do you have any standing on which to think it isn’t going to do any harm?”\nBut supporters of the bill argue that individuals can make their own decisions about risk. When speaking at the A4LI event, Flanigan introduced herself as a bioethicist before adding “but don’t hold it against me; we’re not all so bad.” She argued that current drug regulations impose a “massive amount of restrictions on your bodily rights and your medical freedom.” Why should public officials be the ones making decisions about what’s safe for people? Individuals, she argued, should be empowered to make those judgments themselves.\nOther ethicists counter that this isn’t an issue of people’s rights. There are lots of generally accepted laws about when we can access drugs, says Hoffman; people aren’t allowed to drink and drive because they might kill someone. “So, no, you don’t have a right to ingest everything you want if there are risks associated with it.”\nThe idea that individuals have a right to access experimental treatments has in fact failed in US courts in the past, says Carl Coleman, a bioethicist and legal scholar at Seton Hall in New Jersey. \nHe points to a case from 20 years ago: In the early 2000s, Frank Burroughs founded the Abigail Alliance for Better Access to Developmental Drugs. His daughter, Abigail Burroughs, had head and neck cancer, and she had tried and failed to access experimental drugs. In 2003, about two years after Abigail’s death, the group sued the FDA, arguing that people with terminal cancer have a constitutionally protected right to access experimental, unapproved treatments, once those treatments have been through phase I trials. In 2007, however, a court rejected that argument, determining  that terminally ill individuals do not have a constitutional right to experimental drugs.\nBateman-House also questions a provision in the Montana bill that claims to make treatments more equitable. It states that “experimental treatment centers” should allocate 2% of their net annual profits “to support access to experimental treatments and healthcare for qualifying Montana residents.” Bateman-House says she’s never seen that kind of language in a bill before. It may sound positive, but it could in practice introduce even more risk to the local community. “On the one hand, I like equity,” she says. “On the other hand, I don’t like equity to snake oil.”\nAfter all, the doctors prescribing these drugs won’t know if they will work. It is never ethical to make somebody pay for a treatment when you don’t have any idea whether it will work, Bateman-House adds. “That’s how the US system has been structured: There’s no profit without evidence of safety and efficacy.”\nThe clinics are coming\nAny clinics that offer experimental treatments in Montana will only be allowed to sell drugs that have been made within the state, says Coleman. “Federal law requires any drug that is going to be distributed in interstate commerce to have FDA approval,” he says.\nWhite isn’t too worried about that. Montana already has manufacturing facilities for biotech and pharmaceutical companies, including Pfizer. “That was one of the specific advantages [of focusing] on Montana, because everything can be done in state,” he says. He also believes that the current administration is “predisposed” to change federal laws around interstate drug manufacturing. (FDA commissioner Marty Makary has been a vocal critic of the agency and the pace at which it approves new drugs.)\nAt any rate, the clinics are coming to Montana, says Livingston. “We have half a dozen that are interested, and maybe two or three that are definitively going to set up shop out there.” He won’t name names, but he says some of the interested clinicians already have clinics in the US, while others are abroad. \nMac Davis—founder and CEO of Minicircle, the company that developed the controversial “anti-aging” gene therapy—told MIT Technology Review he was “looking into it.”\n“I think this can be an opportunity for America and Montana to really kind of corner the market when it comes to medical tourism,” says Livingston. “There is no other place in the world with this sort of regulatory environment.”",
    "content": "A bill that allows medical clinics to sell unproven treatments has been passed in Montana. \nUnder the legislation, doctors can apply for a license to open an experimental treatment clinic and recommend and sell therapies not approved by the Food and Drug Administration (FDA) to their patients. Once it’s signed by the governor, the law will be the most expansive in the country in allowing access to drugs that have not been fully tested. \nThe bill allows for any drug produced in the state to be sold in it, providing it has been through phase I clinical trials—the initial, generally small, first-in-human studies that are designed to check that a new treatment is not harmful. These trials do not determine if the drug is effective.\nThe bill, which was passed by the state legislature on April 29 and is expected to be signed by Governor Greg Gianforte, essentially expands on existing Right to Try legislation in the state. But while that law was originally designed to allow terminally ill people to access experimental drugs, the new bill was drafted and lobbied for by people interested in extending human lifespans—a group of longevity enthusiasts that includes scientists, libertarians, and influencers.  \nThese longevity enthusiasts are hoping Montana will serve as a test bed for opening up access to experimental drugs. “I see no reason why it couldn’t be adopted by most of the other states,” said Todd White, speaking to an audience of policymakers and others interested in longevity at an event late last month in Washington, DC. White, who helped develop the bill and directs a research organization focused on aging, added that “there are some things that can be done at the federal level to allow Right to Try laws to proliferate more readily.” \nSupporters of the bill say it gives individuals the freedom to make choices about their own bodies. At the same event, bioethicist Jessica Flanigan of the University of Richmond said she was “optimistic” about the measure, because “it’s great any time anybody is trying to give people back their medical autonomy.” \nUltimately, they hope that the new law will enable people to try unproven drugs that might help them live longer, make it easier for Americans to try experimental treatments without having to travel abroad, and potentially turn Montana into a medical tourism hub.\nBut ethicists and legal scholars aren’t as optimistic. “I hate it,” bioethicist Alison Bateman-House of New York University says of the bill. She and others are worried about the ethics of promoting and selling unproven treatments—and the risks of harm should something go wrong.\nEasy access?\nNo drugs have been approved to treat human aging. Some in the longevity field believe that regulation has held back the development of such drugs. In the US, federal law requires that drugs be shown to be both safe and effective before they can be sold. That requirement was made law in the 1960s following the thalidomide tragedy, in which women who took the drug for morning sickness had babies with sometimes severe disabilities. Since then, the FDA has been responsible for the approval of new drugs.  \nTypically, new drugs are put through a series of human trials. Phase I trials generally involve between 20 and 100 volunteers and are designed to check that the drug is safe for humans. If it is, the drug is then tested in larger groups of hundreds, and then thousands, of volunteers to assess the dose and whether it actually works. Once a drug is approved, people who are prescribed it are monitored for side effects. The entire process is slow, and it can last more than a decade—a particular pain point for people who are acutely aware of their own aging. \nBut some exceptions have been made for people who are terminally ill under Right to Try laws. Those laws allow certain individuals to apply for access to experimental treatments that have been through phase I clinical trials but have not received FDA approval.\nMontana first passed a Right to Try law in 2015 (a federal law was passed around three years later). Then in 2023, the state expanded the law to include all patients there, not just those with terminal illnesses—meaning that any person in Montana could, in theory, take a drug that had been through only a phase I trial.\nAt the time, this was cheered by many longevity enthusiasts—some of whom had helped craft the expanded measure.\nBut practically, the change hasn’t worked out as they envisioned. “There was no licensing, no processing, no registration” for clinics that might want to offer those drugs, says White. “There needed to be another bill that provided regulatory clarity for service providers.” \nSo the new legislation addresses “how clinics can set up shop in Montana,” says Dylan Livingston, founder and CEO of the Alliance for Longevity Initiatives, which hosted the DC event. Livingston built A4LI, as it’s known, a few years ago, as a lobbying group for the science of human aging and longevity.\nLivingston, who is exploring multiple approaches to improve both funding for scientific research and to change drug regulation, helped develop and push the 2023 bill in Montana with the support of State Senator Kenneth Bogner, he says. “I gave [Bogner] a menu of things that could be done at the state level … and he loved the idea” of turning Montana into a medical tourism hub, he says. \nAfter all, as things stand, plenty of Americans travel abroad to receive experimental treatments that cannot legally be sold in the US, including expensive, unproven stem cell and gene therapies, says Livingston. \n“If you’re going to go and get an experimental gene therapy, you might as well keep it in the country,” he says. Livingston has suggested that others might be interested in trying a novel drug designed to clear aged “senescent” cells from the body, which is currently entering phase II trials for an eye condition caused by diabetes. “One: let’s keep the money in the country, and two: if I was a millionaire getting an experimental gene therapy, I’d rather be in Montana than Honduras.”\n“Los Alamos for longevity”\nHonduras, in particular, has become something of a home base for longevity experiments. The island of Roatán is home to the Global Alliance for Regenerative Medicine clinic, which, along with various stem cell products, sells a controversial unproven “anti-aging” gene therapy for around $20,000 to customers including wealthy longevity influencer Bryan Johnson. \nTech entrepreneur and longevity enthusiast Niklas Anzinger has also founded the city of Infinita in the region’s special economic zone of Próspera, a private city where residents are able to make their own suggestions for medical regulations. It’s the second time he’s built a community there as part of his effort to build a “Los Alamos for longevity” on the island, a place where biotech companies can develop therapies that slow or reverse human aging “at warp speed,” and where individuals are free to take those experimental treatments. (The first community, Vitalia, featured a biohacking lab, but came to an end following a disagreement between the two founders.) \nAnzinger collaborated with White, the longevity enthusiast who spoke at the A4LI event (and is an advisor to Infinita VC, Anzinger’s investment company), to help put together the new Montana bill. “He asked if I would help him try to advance the new bill, so that’s what we did for the last few months,” says White, who trained as an electrical engineer but left his career in telecommunications to work with an organization that uses blockchain to fund research into extending human lifespans. \n“Right to Try has always been this thing [for people] who are terminal[ly ill] and trying a Hail Mary approach to solving these things; now Right to Try laws are being used to allow you to access treatments earlier,” White told the audience at the A4LI event. “Making it so that people can use longevity medicines earlier is, I think, a very important thing.”\nThe new bill largely sets out the “infrastructure” for clinics that want to sell experimental treatments, says White. It states that clinics will need to have a license, for example, and that this must be renewed on an annual basis. \n“Now somebody who actually wants to deliver drugs under the Right to Try law will be able to do so,” he says. The new legislation also protects prescribing doctors from disciplinary action.\nAnd it sets out requirements for informed consent that go further than those of existing Right to Try laws. Before a person takes an experimental drug under the new law, they will be required to provide a written consent that includes a list of approved alternative drugs and a description of the worst potential outcome.\nOn the safe side\n“In the Montana law, we explicitly enhanced the requirements for informed consent,” Anzinger told an audience at the same A4LI event. This, along with the fact that the treatments will have been through phase I clinical trials, will help to keep people safe, he argued. “We have to treat this with a very large degree of responsibility,” he added.\n“We obviously don’t want to be killing people,” says Livingston. \nBut he also adds that he, personally, won’t be signing up for any experimental treatments. “I want to be the 10 millionth, or even the 50 millionth, person to get the gene therapy,” he says. “I’m not that adventurous … I’ll let other people go first.”\nOthers are indeed concerned that, for the “adventurous” people, these experimental treatments won’t necessarily be safe. Phase I trials are typically tiny, and they often involve less than 50 people, all of whom are typically in good health. A trial like that won’t tell you much about side effects that only show up in 5% of people, for example, or about interactions the drug might have with other medicines.\nAround 90% of drug candidates in clinical trials fail. And around 17% of drugs fail late-stage clinical trials because of safety concerns. Even those that make it all the way through clinical trials and get approved by the FDA can still end up being withdrawn from the market when rare but serious side effects show up. Between 1992 and 2023, 23 drugs that were given accelerated approval for cancer indications were later withdrawn from the market. And between 1950 and 2013, the reason for the withdrawal of 95 drugs was “death.”\n“It’s disturbing that they want to make drugs available after phase I testing,” says Sharona Hoffman, professor of law and bioethics at Case Western Reserve University in Cleveland, Ohio. “This could endanger patients.”\n“Famously, the doctor’s first obligation is to first do no harm,” says Bateman-House. “If [a drug] has not been through clinical trials, how do you have any standing on which to think it isn’t going to do any harm?”\nBut supporters of the bill argue that individuals can make their own decisions about risk. When speaking at the A4LI event, Flanigan introduced herself as a bioethicist before adding “but don’t hold it against me; we’re not all so bad.” She argued that current drug regulations impose a “massive amount of restrictions on your bodily rights and your medical freedom.” Why should public officials be the ones making decisions about what’s safe for people? Individuals, she argued, should be empowered to make those judgments themselves.\nOther ethicists counter that this isn’t an issue of people’s rights. There are lots of generally accepted laws about when we can access drugs, says Hoffman; people aren’t allowed to drink and drive because they might kill someone. “So, no, you don’t have a right to ingest everything you want if there are risks associated with it.”\nThe idea that individuals have a right to access experimental treatments has in fact failed in US courts in the past, says Carl Coleman, a bioethicist and legal scholar at Seton Hall in New Jersey. \nHe points to a case from 20 years ago: In the early 2000s, Frank Burroughs founded the Abigail Alliance for Better Access to Developmental Drugs. His daughter, Abigail Burroughs, had head and neck cancer, and she had tried and failed to access experimental drugs. In 2003, about two years after Abigail’s death, the group sued the FDA, arguing that people with terminal cancer have a constitutionally protected right to access experimental, unapproved treatments, once those treatments have been through phase I trials. In 2007, however, a court rejected that argument, determining  that terminally ill individuals do not have a constitutional right to experimental drugs.\nBateman-House also questions a provision in the Montana bill that claims to make treatments more equitable. It states that “experimental treatment centers” should allocate 2% of their net annual profits “to support access to experimental treatments and healthcare for qualifying Montana residents.” Bateman-House says she’s never seen that kind of language in a bill before. It may sound positive, but it could in practice introduce even more risk to the local community. “On the one hand, I like equity,” she says. “On the other hand, I don’t like equity to snake oil.”\nAfter all, the doctors prescribing these drugs won’t know if they will work. It is never ethical to make somebody pay for a treatment when you don’t have any idea whether it will work, Bateman-House adds. “That’s how the US system has been structured: There’s no profit without evidence of safety and efficacy.”\nThe clinics are coming\nAny clinics that offer experimental treatments in Montana will only be allowed to sell drugs that have been made within the state, says Coleman. “Federal law requires any drug that is going to be distributed in interstate commerce to have FDA approval,” he says.\nWhite isn’t too worried about that. Montana already has manufacturing facilities for biotech and pharmaceutical companies, including Pfizer. “That was one of the specific advantages [of focusing] on Montana, because everything can be done in state,” he says. He also believes that the current administration is “predisposed” to change federal laws around interstate drug manufacturing. (FDA commissioner Marty Makary has been a vocal critic of the agency and the pace at which it approves new drugs.)\nAt any rate, the clinics are coming to Montana, says Livingston. “We have half a dozen that are interested, and maybe two or three that are definitively going to set up shop out there.” He won’t name names, but he says some of the interested clinicians already have clinics in the US, while others are abroad. \nMac Davis—founder and CEO of Minicircle, the company that developed the controversial “anti-aging” gene therapy—told MIT Technology Review he was “looking into it.”\n“I think this can be an opportunity for America and Montana to really kind of corner the market when it comes to medical tourism,” says Livingston. “There is no other place in the world with this sort of regulatory environment.”"
  },
  {
    "title": "The Download: taking the temperature of snow, and the future of privacy",
    "url": "https://www.technologyreview.com/2025/05/14/1116426/the-download-taking-the-temperature-of-snow-and-the-future-of-privacy/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Wed, 14 May 2025 12:10:00 +0000",
    "published_datetime": "2025-05-14T13:10:00",
    "summary": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nWhy climate researchers are taking the temperature of mountain snow\nThe Sierra’s frozen reservoir provides about a third of California’s water and most of what comes out of the faucets, shower heads, and sprinklers in the towns and cities of northwestern Nevada. As it melts through the spring and summer, dam operators, water agencies, and communities have to manage the flow of billions of gallons of runoff, storing up enough to get through the dry summer months without allowing reservoirs and canals to flood.\nThe need for better snowpack temperature data has become increasingly critical for predicting when the water will flow down the mountains, as climate change fuels hotter weather, melts snow faster, and drives rapid swings between very wet and very dry periods.\nIn the past, it was hard work to gather this data. Now, a new generation of tools, techniques, and models promises to ease that process, improve water forecasts, and help California and other states manage in the face of increasingly severe droughts and flooding. However, observers fear that any such advances could be undercut by the Trump administration’s cutbacks across federal agencies. Read the full story.\n—James Temple\n\nMIT Technology Review Narrated: What’s next for our privacy?\nThe US still has no federal privacy law. But recent enforcement actions against data brokers may offer some new protections for Americans’ personal information.\nThis is our latest story to be turned into a MIT Technology Review Narrated podcast, which we’re publishing each week on Spotify and Apple Podcasts. Just navigate to MIT Technology Review Narrated on either platform, and follow us to get all our new content as it’s released.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 The US is warning other countries not to use Huawei’s chipsIf they do, they may face criminal penalties for breaching US export controls. (FT $)+ The Trump administration has axed the ‘AI Diffusion Rule’ for chips. (WSJ $)+ It may move towards negotiating deals with countries directly. (Bloomberg $)\n2 US tech firms are inking AI deals with the Middle EastAmong the biggest of which is Nvidia. (The Guardian)+ Tech leaders accompanied Trump on his trip. (WP $)\n3 A new treatment for inherited breast cancer was trialed successfullyThe drug olaparib can help to significantly improve survival rates. (BBC)\n4 TikTok workers fear a new messaging feature could be exploitedBut the company is pressing ahead with it anyway. (The Information $)\n5 Apple is working on brain-computer interfaces for its productsPeople with brain implants could one day use them to control their devices. (WSJ $)+ Brain-computer interfaces face a critical test. (MIT Technology Review)\n6 What’s next for NASA?The agency is poised for its most radical shakeup in decades. (Ars Technica)+ NASA has made an air traffic control system for drones. (MIT Technology Review)\n7 Finland is harvesting heat from its data centersWhile no data center is good for the environment, this helps lessen their footprint. (Bloomberg $)+ The next data center hub? India. (FT $)+ These four charts sum up the state of AI and energy. (MIT Technology Review)\n8 Airbnb wants to become the next everything-appIt wants to expand beyond vacations and into a community platform, apparently. (Wired $)+ Hotel-like services, anyone? (NYT $)+ Its host features have been overhauled, too. (The Verge)\n9 The FBI is buying new tech to help it see through wallsThanks to radar. (New Scientist $)\n10 Baidu is planning to launch its robotaxis in Europe In a bid to extend its competitive advantage overseas. (WSJ $)+ How Wayve’s driverless cars will meet one of their biggest challenges yet. (MIT Technology Review)\n\nQuote of the day\n“It’s literally Einstein’s proverbial definition of insanity: doing the same thing over and over again and expecting a different result.”\n—Entrepreneur Arnaud Bertrand reflects on America’s latest attempt to rein in Huawei in a post on X.\n\nOne more thing\n\nHow DeepSeek ripped up the AI playbook—and why everyone’s going to follow its lead\nWhen the Chinese firm DeepSeek dropped a large language model called R1 at the start of this year, it sent shock waves through the US tech industry. Not only did R1 match the best of the homegrown competition, it was built for a fraction of the cost—and given away for free.\nDeepSeek has now suddenly become the company to beat. What exactly did it do to rattle the tech world so fully? Is the hype justified? And what can we learn from the buzz about what’s coming next? Here’s what you need to know.  \n—Will Douglas Heaven\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)+ Happy birthday to the one, the only Stevie Wonder—75 years young this week.+ A scooped bagel? Not on my watch. + A few tips on how to navigate some of life’s trickier conversations with ease.+ Everyone’s got a random junk drawer. Here’s how to get it under control.",
    "content": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nWhy climate researchers are taking the temperature of mountain snow\nThe Sierra’s frozen reservoir provides about a third of California’s water and most of what comes out of the faucets, shower heads, and sprinklers in the towns and cities of northwestern Nevada. As it melts through the spring and summer, dam operators, water agencies, and communities have to manage the flow of billions of gallons of runoff, storing up enough to get through the dry summer months without allowing reservoirs and canals to flood.\nThe need for better snowpack temperature data has become increasingly critical for predicting when the water will flow down the mountains, as climate change fuels hotter weather, melts snow faster, and drives rapid swings between very wet and very dry periods.\nIn the past, it was hard work to gather this data. Now, a new generation of tools, techniques, and models promises to ease that process, improve water forecasts, and help California and other states manage in the face of increasingly severe droughts and flooding. However, observers fear that any such advances could be undercut by the Trump administration’s cutbacks across federal agencies. Read the full story.\n—James Temple\n\nMIT Technology Review Narrated: What’s next for our privacy?\nThe US still has no federal privacy law. But recent enforcement actions against data brokers may offer some new protections for Americans’ personal information.\nThis is our latest story to be turned into a MIT Technology Review Narrated podcast, which we’re publishing each week on Spotify and Apple Podcasts. Just navigate to MIT Technology Review Narrated on either platform, and follow us to get all our new content as it’s released.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 The US is warning other countries not to use Huawei’s chipsIf they do, they may face criminal penalties for breaching US export controls. (FT $)+ The Trump administration has axed the ‘AI Diffusion Rule’ for chips. (WSJ $)+ It may move towards negotiating deals with countries directly. (Bloomberg $)\n2 US tech firms are inking AI deals with the Middle EastAmong the biggest of which is Nvidia. (The Guardian)+ Tech leaders accompanied Trump on his trip. (WP $)\n3 A new treatment for inherited breast cancer was trialed successfullyThe drug olaparib can help to significantly improve survival rates. (BBC)\n4 TikTok workers fear a new messaging feature could be exploitedBut the company is pressing ahead with it anyway. (The Information $)\n5 Apple is working on brain-computer interfaces for its productsPeople with brain implants could one day use them to control their devices. (WSJ $)+ Brain-computer interfaces face a critical test. (MIT Technology Review)\n6 What’s next for NASA?The agency is poised for its most radical shakeup in decades. (Ars Technica)+ NASA has made an air traffic control system for drones. (MIT Technology Review)\n7 Finland is harvesting heat from its data centersWhile no data center is good for the environment, this helps lessen their footprint. (Bloomberg $)+ The next data center hub? India. (FT $)+ These four charts sum up the state of AI and energy. (MIT Technology Review)\n8 Airbnb wants to become the next everything-appIt wants to expand beyond vacations and into a community platform, apparently. (Wired $)+ Hotel-like services, anyone? (NYT $)+ Its host features have been overhauled, too. (The Verge)\n9 The FBI is buying new tech to help it see through wallsThanks to radar. (New Scientist $)\n10 Baidu is planning to launch its robotaxis in Europe In a bid to extend its competitive advantage overseas. (WSJ $)+ How Wayve’s driverless cars will meet one of their biggest challenges yet. (MIT Technology Review)\n\nQuote of the day\n“It’s literally Einstein’s proverbial definition of insanity: doing the same thing over and over again and expecting a different result.”\n—Entrepreneur Arnaud Bertrand reflects on America’s latest attempt to rein in Huawei in a post on X.\n\nOne more thing\n\nHow DeepSeek ripped up the AI playbook—and why everyone’s going to follow its lead\nWhen the Chinese firm DeepSeek dropped a large language model called R1 at the start of this year, it sent shock waves through the US tech industry. Not only did R1 match the best of the homegrown competition, it was built for a fraction of the cost—and given away for free.\nDeepSeek has now suddenly become the company to beat. What exactly did it do to rattle the tech world so fully? Is the hype justified? And what can we learn from the buzz about what’s coming next? Here’s what you need to know.  \n—Will Douglas Heaven\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)+ Happy birthday to the one, the only Stevie Wonder—75 years young this week.+ A scooped bagel? Not on my watch. + A few tips on how to navigate some of life’s trickier conversations with ease.+ Everyone’s got a random junk drawer. Here’s how to get it under control."
  },
  {
    "title": "Why climate researchers are taking the temperature of mountain snow",
    "url": "https://www.technologyreview.com/2025/05/14/1116395/why-climate-researchers-are-taking-the-temperature-of-mountain-snow/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Wed, 14 May 2025 08:00:00 +0000",
    "published_datetime": "2025-05-14T09:00:00",
    "summary": "On a crisp morning in early April, Dan McEvoy and Bjoern Bingham cut clean lines down a wide run at the Heavenly Ski Resort in South Lake Tahoe, then ducked under a rope line cordoning off a patch of untouched snow. \nThey side-stepped up a small incline, poled past a row of Jeffrey pines, then dropped their packs. \nThe pair of climate researchers from the Desert Research Institute (DRI) in Reno, Nevada, skied down to this research plot in the middle of the resort to test out a new way to take the temperature of the Sierra Nevada snowpack. They were equipped with an experimental infrared device that can take readings as it’s lowered down a hole in the snow to the ground.\nThe Sierra’s frozen reservoir provides about a third of California’s water and most of what comes out of the faucets, shower heads, and sprinklers in the towns and cities of northwestern Nevada. As it melts through the spring and summer, dam operators, water agencies, and communities have to manage the flow of billions of gallons of runoff, storing up enough to get through the inevitable dry summer months without allowing reservoirs and canals to flood.\nThe need for better snowpack temperature data has become increasingly critical for predicting when the water will flow down the mountains, as climate change fuels hotter weather, melts snow faster, and drives rapid swings between very wet and very dry periods. \nIn the past, it has been arduous work to gather such snowpack observations. Now, a new generation of tools, techniques, and models promises to ease that process, improve water forecasts, and help California and other states safely manage one of their largest sources of water in the face of increasingly severe droughts and flooding.Observers, however, fear that any such advances could be undercut by the Trump administration’s cutbacks across federal agencies, including the one that oversees federal snowpack monitoring and survey work. That could jeopardize ongoing efforts to produce the water data and forecasts on which Western communities rely.\n“If we don’t have those measurements, it’s like driving your car around without a fuel gauge,” says Larry O’Neill, Oregon’s state climatologist. “We won’t know how much water is up in the mountains, and whether there’s enough to last through the summer.”\nThe birth of snow surveys\nThe snow survey program in the US was born near Lake Tahoe, the largest alpine lake in North America, around the turn of the 20th century. \nWithout any reliable way of knowing how much water would flow down the mountain each spring, lakefront home and business owners, fearing floods, implored dam operators to release water early in the spring. Downstream communities and farmers pushed back, however, demanding that the dam was used to hold onto as much water as possible to avoid shortages later in the year. \nIn 1908, James Church, a classics professor at the University of Nevada, Reno, whose passion for hiking around the mountains sparked an interest in the science of snow, invented a device that helped resolve the so-called Lake Tahoe Water Wars: the Mt. Rose snow sampler, named after the peak of a Sierra spur that juts into Nevada.\n\nJames Church, a professor of classics at the University of Nevada, Reno, became a pioneer in the field of snow surveys.COURTESY OF UNIVERSITY OF NEVADA, RENO\n\n\nIt’s a simple enough device, with sections of tube that screw together, a sharpened end, and measurement ticks along the side. Snow surveyors measure the depth of the snow by plunging the sampler down to the ground. They then weigh the filled tube on a specialized scale to calculate the water content of the snow. \nChurch used the device to take measurements at various points across the range, and calibrated his water forecasts by comparing his readings against the rising and falling levels of Lake Tahoe. \nIt worked so well that the US began a federal snow survey program in the mid-1930s, which evolved into the one carried on today by the Department of Agriculture’s Natural Resources Conservation Service (NRCS). Throughout the winter, hundreds of snow surveyors across the American West head up to established locations on snowshoes, backcountry skis, or snowmobiles to deploy their Mt. Rose samplers, which have barely changed over more than a century. \nIn the 1960s, the US government also began setting up a network of permanent monitoring sites across the mountains, now known as the SNOTEL network. There are more than 900 stations continuously transmitting readings from across Western states and Alaska. They’re equipped with sensors that measure air temperature, snow depth, and soil moisture, and include pressure-sensitive “snow pillows” that weigh the snow to determine the water content. \nThe data from the snow surveys and SNOTEL sites all flows into snow depth and snow water content reports that the NRCS publishes, along with forecasts of the amount of water that will fill the streams and reservoirs through the spring and summer.\nTaking the temperature\nNone of these survey and monitoring programs, however, provide the temperature throughout the snowpack. \nThe Sierra Nevada snowpack can reach more than 6 meters (20 feet), and the temperature within it may vary widely, especially toward the top. Readings taken at increments throughout can determine what’s known as the cold content, or the amount of energy required to shift the snowpack to a uniform temperature of 32˚F. \nKnowing the cold content of the snowpack helps researchers understand the conditions under which it will begin to rapidly melt, particularly as it warms up in the spring or after rain falls on top of the snow.\nIf the temperature of the snow, for example, is close to 32˚F even at several feet deep, a few warm days could easily set it melting. If, on the other hand, the temperature measurements show a colder profile throughout the middle, the snowpack is more stable and will hold up longer as the weather warms.\n\nBjoern Bingham, a research scientist at the Desert Research Institute, digs at snowpit at a research plot within the Heavenly Ski Resort, near South Lake Tahoe, California. JAMES TEMPLE\n\n\nThe problem is that taking the temperature of the entire snowpack has been, until now, tough and time-consuming work. When researchers do it at all, they mainly do so by digging snow pits down to the ground and then taking readings with probe thermometers along an inside wall.There have been a variety of efforts to take continuous remote readings from sensors attached to fences, wires, or towers, which the snowpack eventually buries. But the movement and weight of the dense shifting snow tends to break the devices or snap the structures they’re assembled upon.\n“They rarely last a season,” McAvoy says.\nAnne Heggli, a professor of mountain hydrometeorology at DRI, happened upon the idea of using an infrared device to solve this problem during a tour of the institute’s campus in 2019, when she learned that researchers there were using an infrared meat thermometer to take contactless readings of the snow surface.\nIn 2021, Heggli began collaborating with RPM Systems, a gadget manufacturing company, to design an infrared device optimized for snowpack field conditions. The resulting snow temperature profiler is skinny enough to fit down a hole dug by snow surveyors and dangles on a cord marked off at 10-centimeter (4-inch) increments.\n\nBingham and Daniel McEvoy, an associate research professor at the Desert Research Institute, work together to take temperature readings from inside the snowpit as well as from within the hole left behind by a snow sampler.JAMES TEMPLE\n\n\nAt Heavenly on that April morning, Bingham, a staff scientist at DRI, slowly fed the device down a snow sampler hole, calling out temperature readings at each marking. McEvoy scribbled them down on a worksheet fastened to his clipboard as he used a probe thermometer to take readings of his own from within a snow pit the pair had dug down to the ground.\nThey were comparing the measurements to assess the reliability of the infrared device in the field, but the eventual aim is to eliminate the need to dig snow pits. The hope is that state and federal surveyors could simply carry along a snow temperature profiler and drop it into the snowpack survey holes they’re creating anyway, to gather regular snowpack temperature readings from across the mountains.\nIn 2023, the US Bureau of Reclamation, the federal agency that operates many of the nation’s dams, funded a three-year research project to explore the use of the infrared gadgets in determining snowpack temperatures. Through it, the DRI research team has now handed devices out to 20 snow survey teams across California, Colorado, Idaho, Montana, Nevada, and Utah to test their use in the field and supplement the snowpack data they’re collecting.\nThe Snow Lab\nThe DRI research project is one piece of a wider effort to obtain snowpack temperature data across the mountains of the West.\nBy early May, the snow depth had dropped from an April peak of 114 inches to 24 inches (2.9 meters to 0.6 meters) at the UC Berkeley Central Sierra Snow Lab, an aging wooden structure perched in the high mountains northwest of Lake Tahoe.Megan Mason, a research scientist at the lab, used a backcountry ski shovel to dig out a trio of instruments from what was left of the pitted snowpack behind the building. Each one featured different types of temperature sensors, arrayed along a strong polymer beam meant to hold up under the weight and movement of the Sierra snowpack.  \nShe was pulling up the devices after running the last set of observations for the season, as part of an effort to develop a resilient system that can survive the winter and transmit hourly temperature readings.\nThe lab is working on the project, dubbed the California Cold Content Initiative, in collaboration with the state’s Department of Water Resources. California is the only western state that opted to maintain its own snow survey program and run its own permanent monitoring stations, all of which are managed by the water department. \nThe plan is to determine which instruments held up and functioned best this winter. Then, they can begin testing the most promising approaches at several additional sites next season. Eventually, the goal is to attach the devices at more than 100 of California’s snow monitoring stations, says Andrew Schwartz, the director of the lab.The NRCS is conducting a similar research effort at select SNOTEL sites equipped with a beaded temperature cable. One such cable is visible at the Heavenly SNOTEL station, next to where McEvoy and Bingham dug their snow pit, strung vertically between an arm extended from the main tower and the snow-covered ground. \n\nDRI’s Bjoern Bingham feeds the snow temperature profiler, an infrared device, down a hole in the Sierra snowpack.JAMES TEMPLE\n\n\nSchwartz said that the different research groups are communicating and collaborating openly on the projects, all of which promise to provide complementary information, expanding the database of snowpack temperature readings across the West.\nFor decades, agencies and researchers generally produced water forecasts using relatively simple regression models that translated the amount of water in the snowpack into the amount of water that will flow down the mountain, based largely on the historic relationships between those variables. \nBut these models are becoming less reliable as climate change alters temperatures, snow levels, melt rates, and evaporation, and otherwise drives alpine weather patterns outside of historic patterns.\n“As we have years that scatter further and more frequently from the norm, our models aren’t prepared,” Heggli says.\nPlugging direct temperature observations into more sophisticated models that have emerged in recent years, Schwartz says, promises to significantly improve the accuracy of water forecasts. That, in turn, should help communities manage through droughts and prevent dams from overtopping even as climate change fuels alternately wetter, drier, warmer, and weirder weather.\nAbout a quarter of the world’s population relies on water stored in mountain snow and glaciers, and climate change is disrupting the hydrological cycles that sustain these natural frozen reservoirs in many parts of the world. So any advances in observations and modeling could deliver broader global benefits.\nOminous weather\nThere’s an obvious threat to this progress, though.\nEven if these projects work as well as hoped, it’s not clear how widely these tools and techniques will be deployed at a time when the White House is gutting staff across federal agencies, terminating thousands of scientific grants, and striving to eliminate tens of billions of dollars in funding at research departments. \nThe Trump administration has fired or put on administrative leave nearly 6,000 employees across the USDA, or 6% of the department’s workforce. Those cutbacks have reached regional NRCS offices, according to reporting by local and trade outlets.\nThat includes more than half of the roles at the Portland office, according to O’Neill, the state climatologist. Those reductions prompted a bipartisan group of legislators to call on the Secretary of Agriculture to restore the positions, warning the losses could impair water data and analyses that are crucial for the state’s “agriculture, wildland fire, hydropower, timber, and tourism sectors,” as the Statesman Journal reported.\nThere are more than 80 active SNOTEL stations in Oregon.\nThe fear is there won’t be enough people left to reach all the sites this summer to replace batteries, solar panels, and drifting or broken sensors, which could quickly undermine the reliability of the data or cut off the flow of information. \n“Staff and budget reductions at NRCS will make it impossible to maintain SNOTEL instruments and conduct routine manual observations, leading to inoperability of the network within a year,” the lawmakers warned.\nThe USDA and NRCS didn’t respond to inquiries from MIT Technology Review. \n\nDRI’s Daniel McEvoy scribbles down temperature readings at the Heavenly site.JAMES TEMPLE\n\n\nIf the federal cutbacks deplete the data coming back from SNOTEL stations or federal snow survey work, the DRI infrared method could at least “still offer a simplistic way of measuring the snowpack temperatures” in places where state and regional agencies continue to carry out surveys, McEvoy says.\nBut most researchers stress the field needs more surveys, stations, sensors, and readings to understand how the climate and water cycles are changing from month to month and season to season. Heggli stresses that there should be broad bipartisan support for programs that collect snowpack data and provide the water forecasts that farmers and communities rely on. \n“This is how we account for one of, if not the, most valuable resource we have,” she says. “In the West, we go into a seasonal drought every summer; our snowpack is what trickles down and gets us through that drought. We need to know how much we have.”",
    "content": "On a crisp morning in early April, Dan McEvoy and Bjoern Bingham cut clean lines down a wide run at the Heavenly Ski Resort in South Lake Tahoe, then ducked under a rope line cordoning off a patch of untouched snow. \nThey side-stepped up a small incline, poled past a row of Jeffrey pines, then dropped their packs. \nThe pair of climate researchers from the Desert Research Institute (DRI) in Reno, Nevada, skied down to this research plot in the middle of the resort to test out a new way to take the temperature of the Sierra Nevada snowpack. They were equipped with an experimental infrared device that can take readings as it’s lowered down a hole in the snow to the ground.\nThe Sierra’s frozen reservoir provides about a third of California’s water and most of what comes out of the faucets, shower heads, and sprinklers in the towns and cities of northwestern Nevada. As it melts through the spring and summer, dam operators, water agencies, and communities have to manage the flow of billions of gallons of runoff, storing up enough to get through the inevitable dry summer months without allowing reservoirs and canals to flood.\nThe need for better snowpack temperature data has become increasingly critical for predicting when the water will flow down the mountains, as climate change fuels hotter weather, melts snow faster, and drives rapid swings between very wet and very dry periods. \nIn the past, it has been arduous work to gather such snowpack observations. Now, a new generation of tools, techniques, and models promises to ease that process, improve water forecasts, and help California and other states safely manage one of their largest sources of water in the face of increasingly severe droughts and flooding.Observers, however, fear that any such advances could be undercut by the Trump administration’s cutbacks across federal agencies, including the one that oversees federal snowpack monitoring and survey work. That could jeopardize ongoing efforts to produce the water data and forecasts on which Western communities rely.\n“If we don’t have those measurements, it’s like driving your car around without a fuel gauge,” says Larry O’Neill, Oregon’s state climatologist. “We won’t know how much water is up in the mountains, and whether there’s enough to last through the summer.”\nThe birth of snow surveys\nThe snow survey program in the US was born near Lake Tahoe, the largest alpine lake in North America, around the turn of the 20th century. \nWithout any reliable way of knowing how much water would flow down the mountain each spring, lakefront home and business owners, fearing floods, implored dam operators to release water early in the spring. Downstream communities and farmers pushed back, however, demanding that the dam was used to hold onto as much water as possible to avoid shortages later in the year. \nIn 1908, James Church, a classics professor at the University of Nevada, Reno, whose passion for hiking around the mountains sparked an interest in the science of snow, invented a device that helped resolve the so-called Lake Tahoe Water Wars: the Mt. Rose snow sampler, named after the peak of a Sierra spur that juts into Nevada.\n\nJames Church, a professor of classics at the University of Nevada, Reno, became a pioneer in the field of snow surveys.COURTESY OF UNIVERSITY OF NEVADA, RENO\n\n\nIt’s a simple enough device, with sections of tube that screw together, a sharpened end, and measurement ticks along the side. Snow surveyors measure the depth of the snow by plunging the sampler down to the ground. They then weigh the filled tube on a specialized scale to calculate the water content of the snow. \nChurch used the device to take measurements at various points across the range, and calibrated his water forecasts by comparing his readings against the rising and falling levels of Lake Tahoe. \nIt worked so well that the US began a federal snow survey program in the mid-1930s, which evolved into the one carried on today by the Department of Agriculture’s Natural Resources Conservation Service (NRCS). Throughout the winter, hundreds of snow surveyors across the American West head up to established locations on snowshoes, backcountry skis, or snowmobiles to deploy their Mt. Rose samplers, which have barely changed over more than a century. \nIn the 1960s, the US government also began setting up a network of permanent monitoring sites across the mountains, now known as the SNOTEL network. There are more than 900 stations continuously transmitting readings from across Western states and Alaska. They’re equipped with sensors that measure air temperature, snow depth, and soil moisture, and include pressure-sensitive “snow pillows” that weigh the snow to determine the water content. \nThe data from the snow surveys and SNOTEL sites all flows into snow depth and snow water content reports that the NRCS publishes, along with forecasts of the amount of water that will fill the streams and reservoirs through the spring and summer.\nTaking the temperature\nNone of these survey and monitoring programs, however, provide the temperature throughout the snowpack. \nThe Sierra Nevada snowpack can reach more than 6 meters (20 feet), and the temperature within it may vary widely, especially toward the top. Readings taken at increments throughout can determine what’s known as the cold content, or the amount of energy required to shift the snowpack to a uniform temperature of 32˚F. \nKnowing the cold content of the snowpack helps researchers understand the conditions under which it will begin to rapidly melt, particularly as it warms up in the spring or after rain falls on top of the snow.\nIf the temperature of the snow, for example, is close to 32˚F even at several feet deep, a few warm days could easily set it melting. If, on the other hand, the temperature measurements show a colder profile throughout the middle, the snowpack is more stable and will hold up longer as the weather warms.\n\nBjoern Bingham, a research scientist at the Desert Research Institute, digs at snowpit at a research plot within the Heavenly Ski Resort, near South Lake Tahoe, California. JAMES TEMPLE\n\n\nThe problem is that taking the temperature of the entire snowpack has been, until now, tough and time-consuming work. When researchers do it at all, they mainly do so by digging snow pits down to the ground and then taking readings with probe thermometers along an inside wall.There have been a variety of efforts to take continuous remote readings from sensors attached to fences, wires, or towers, which the snowpack eventually buries. But the movement and weight of the dense shifting snow tends to break the devices or snap the structures they’re assembled upon.\n“They rarely last a season,” McAvoy says.\nAnne Heggli, a professor of mountain hydrometeorology at DRI, happened upon the idea of using an infrared device to solve this problem during a tour of the institute’s campus in 2019, when she learned that researchers there were using an infrared meat thermometer to take contactless readings of the snow surface.\nIn 2021, Heggli began collaborating with RPM Systems, a gadget manufacturing company, to design an infrared device optimized for snowpack field conditions. The resulting snow temperature profiler is skinny enough to fit down a hole dug by snow surveyors and dangles on a cord marked off at 10-centimeter (4-inch) increments.\n\nBingham and Daniel McEvoy, an associate research professor at the Desert Research Institute, work together to take temperature readings from inside the snowpit as well as from within the hole left behind by a snow sampler.JAMES TEMPLE\n\n\nAt Heavenly on that April morning, Bingham, a staff scientist at DRI, slowly fed the device down a snow sampler hole, calling out temperature readings at each marking. McEvoy scribbled them down on a worksheet fastened to his clipboard as he used a probe thermometer to take readings of his own from within a snow pit the pair had dug down to the ground.\nThey were comparing the measurements to assess the reliability of the infrared device in the field, but the eventual aim is to eliminate the need to dig snow pits. The hope is that state and federal surveyors could simply carry along a snow temperature profiler and drop it into the snowpack survey holes they’re creating anyway, to gather regular snowpack temperature readings from across the mountains.\nIn 2023, the US Bureau of Reclamation, the federal agency that operates many of the nation’s dams, funded a three-year research project to explore the use of the infrared gadgets in determining snowpack temperatures. Through it, the DRI research team has now handed devices out to 20 snow survey teams across California, Colorado, Idaho, Montana, Nevada, and Utah to test their use in the field and supplement the snowpack data they’re collecting.\nThe Snow Lab\nThe DRI research project is one piece of a wider effort to obtain snowpack temperature data across the mountains of the West.\nBy early May, the snow depth had dropped from an April peak of 114 inches to 24 inches (2.9 meters to 0.6 meters) at the UC Berkeley Central Sierra Snow Lab, an aging wooden structure perched in the high mountains northwest of Lake Tahoe.Megan Mason, a research scientist at the lab, used a backcountry ski shovel to dig out a trio of instruments from what was left of the pitted snowpack behind the building. Each one featured different types of temperature sensors, arrayed along a strong polymer beam meant to hold up under the weight and movement of the Sierra snowpack.  \nShe was pulling up the devices after running the last set of observations for the season, as part of an effort to develop a resilient system that can survive the winter and transmit hourly temperature readings.\nThe lab is working on the project, dubbed the California Cold Content Initiative, in collaboration with the state’s Department of Water Resources. California is the only western state that opted to maintain its own snow survey program and run its own permanent monitoring stations, all of which are managed by the water department. \nThe plan is to determine which instruments held up and functioned best this winter. Then, they can begin testing the most promising approaches at several additional sites next season. Eventually, the goal is to attach the devices at more than 100 of California’s snow monitoring stations, says Andrew Schwartz, the director of the lab.The NRCS is conducting a similar research effort at select SNOTEL sites equipped with a beaded temperature cable. One such cable is visible at the Heavenly SNOTEL station, next to where McEvoy and Bingham dug their snow pit, strung vertically between an arm extended from the main tower and the snow-covered ground. \n\nDRI’s Bjoern Bingham feeds the snow temperature profiler, an infrared device, down a hole in the Sierra snowpack.JAMES TEMPLE\n\n\nSchwartz said that the different research groups are communicating and collaborating openly on the projects, all of which promise to provide complementary information, expanding the database of snowpack temperature readings across the West.\nFor decades, agencies and researchers generally produced water forecasts using relatively simple regression models that translated the amount of water in the snowpack into the amount of water that will flow down the mountain, based largely on the historic relationships between those variables. \nBut these models are becoming less reliable as climate change alters temperatures, snow levels, melt rates, and evaporation, and otherwise drives alpine weather patterns outside of historic patterns.\n“As we have years that scatter further and more frequently from the norm, our models aren’t prepared,” Heggli says.\nPlugging direct temperature observations into more sophisticated models that have emerged in recent years, Schwartz says, promises to significantly improve the accuracy of water forecasts. That, in turn, should help communities manage through droughts and prevent dams from overtopping even as climate change fuels alternately wetter, drier, warmer, and weirder weather.\nAbout a quarter of the world’s population relies on water stored in mountain snow and glaciers, and climate change is disrupting the hydrological cycles that sustain these natural frozen reservoirs in many parts of the world. So any advances in observations and modeling could deliver broader global benefits.\nOminous weather\nThere’s an obvious threat to this progress, though.\nEven if these projects work as well as hoped, it’s not clear how widely these tools and techniques will be deployed at a time when the White House is gutting staff across federal agencies, terminating thousands of scientific grants, and striving to eliminate tens of billions of dollars in funding at research departments. \nThe Trump administration has fired or put on administrative leave nearly 6,000 employees across the USDA, or 6% of the department’s workforce. Those cutbacks have reached regional NRCS offices, according to reporting by local and trade outlets.\nThat includes more than half of the roles at the Portland office, according to O’Neill, the state climatologist. Those reductions prompted a bipartisan group of legislators to call on the Secretary of Agriculture to restore the positions, warning the losses could impair water data and analyses that are crucial for the state’s “agriculture, wildland fire, hydropower, timber, and tourism sectors,” as the Statesman Journal reported.\nThere are more than 80 active SNOTEL stations in Oregon.\nThe fear is there won’t be enough people left to reach all the sites this summer to replace batteries, solar panels, and drifting or broken sensors, which could quickly undermine the reliability of the data or cut off the flow of information. \n“Staff and budget reductions at NRCS will make it impossible to maintain SNOTEL instruments and conduct routine manual observations, leading to inoperability of the network within a year,” the lawmakers warned.\nThe USDA and NRCS didn’t respond to inquiries from MIT Technology Review. \n\nDRI’s Daniel McEvoy scribbles down temperature readings at the Heavenly site.JAMES TEMPLE\n\n\nIf the federal cutbacks deplete the data coming back from SNOTEL stations or federal snow survey work, the DRI infrared method could at least “still offer a simplistic way of measuring the snowpack temperatures” in places where state and regional agencies continue to carry out surveys, McEvoy says.\nBut most researchers stress the field needs more surveys, stations, sensors, and readings to understand how the climate and water cycles are changing from month to month and season to season. Heggli stresses that there should be broad bipartisan support for programs that collect snowpack data and provide the water forecasts that farmers and communities rely on. \n“This is how we account for one of, if not the, most valuable resource we have,” she says. “In the West, we go into a seasonal drought every summer; our snowpack is what trickles down and gets us through that drought. We need to know how much we have.”"
  },
  {
    "title": "The Download: CRISPR in court, and the police’s ban-skirting AI",
    "url": "https://www.technologyreview.com/2025/05/13/1116357/the-download-crispr-in-court-and-the-polices-ban-skirting-ai/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Tue, 13 May 2025 12:10:00 +0000",
    "published_datetime": "2025-05-13T13:10:00",
    "summary": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nA US court just put ownership of CRISPR back in play\nThe CRISPR patents are back in play.\nYesterday, the US Court of Appeals for the Federal Circuit said scientists Jennifer Doudna and Emmanuelle Charpentier will get another chance to show they ought to own the key patents on what many consider the defining biotechnology invention of the 21st century.\nThe pair shared a 2020 Nobel Prize for developing the gene-editing system, which is already being used to treat various disorders.But when US patent rights were granted in 2014 to Feng Zhang of the Broad Institute of MIT and Harvard, the decision set off a bitter dispute in which hundreds of millions of dollars—as well as scientific bragging rights—are at stake. Read the full story.\n—Antonio Regalado\nTo read more about CRISPR, why not take a look at:+ Charpentier and Doudna announced they wanted to cancel their own CRISPR patents in Europe last year. Read the full story.+ How CRISPR will help the world cope with climate change. Read the full story.\n+ The US has approved CRISPR pigs for food. Pigs whose DNA makes them resistant to a virus could be the first big consumer product using gene editing. Read the full story.+ CRISPR will get easier and easier to administer. What does that mean for the future of our species?\n\nPolice tech can sidestep facial recognition bans now\n—James O’Donnell\nSix months ago I attended the largest gathering of chiefs of police in the US to see how they’re using AI. I found some big developments, like officers getting AI to write their reports. Now, I’ve published a new story that shows just how far AI for police has developed since then.It’s about a new method police are using to track people: an AI tool that uses attributes like body size, gender, hair color and style, clothing, and accessories instead of faces. It offers a way around laws curbing the use of facial recognition, which are on the rise.\nHere’s what this tells us about the development of police tech and what rules, if any, these departments are subject to in the age of AI. Read the full story.\nThis story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first, sign up here.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 Two Trump officials were denied access to the US Copyright Office Their visit came days after the administration fired the office’s head. (Wired $)+ Shira Perlmutter oversaw a report raising concerns about training AI with copyrighted materials. (WP $)\n2 Google knew it couldn’t monitor how Israel might use its cloud technologyBut it went ahead with Project Nimbus anyway. (The Intercept)\n3 Spain still doesn’t know what caused its massive power blackoutInvestigators are examining generators’ cyber defences for weaknesses. (FT $)+ Could solar power be to blame? (MIT Technology Review)\n4 Apple is considering hiking the price of iPhonesThe company doesn’t want to blame tariffs, though. (WSJ $)+ Apple boss Tim Cook had a call with Trump following the tariff rollback news. (CNBC)+ It’s reportedly developing an AI tool to extend phones’ battery life. (Bloomberg $)\n5 Venture capitalists aren’t 100% sure what an AI agent isThat isn’t stopping companies from sinking millions into them. (TechCrunch)+ Google is working on its own agent ahead of its I/O conference. (The Information $)+ What AI assistants can—and can’t—do. (Vox)+ Check out our AI agent explainer. (MIT Technology Review)\n6 Scammers are stealing the identities of death row inmatesAnd prisoners are unlikely to see correspondence alerting them to the fraud. (NBC News)\n7 Weight-loss drugs aren’t always enoughYou need long-term changes in health, not just weight. (The Atlantic $)+ How is Trump planning to lower drug costs, exactly? (NY Mag $)+ Drugs like Ozempic now make up 5% of prescriptions in the US. (MIT Technology Review)\n8 China’s e-commerce giants are racing to deliver goods within an hourAs competition has intensified, companies are fighting to be the quickest. (Reuters)\n9 This spacecraft will police satellites’ orbits And hunt them down where necessary. (IEEE Spectrum)+ The world’s biggest space-based radar will measure Earth’s forests from orbit. (MIT Technology Review)\n10 Is your beard trimmer broken? Simply 3D-print a new part.Philips is experimenting with letting its customers create their own replacements. (The Verge)\n\nQuote of the day\n“We usually set it up so that our team doesn’t get to creep in.”\n—Angie Saltman, founder and president of tech company Saltmedia, explains how her company helps store Indigenous data securely away from the Trump administration, the Verge reports.\n\nOne more thing\n\nMeet the radio-obsessed civilian shaping Ukraine’s drone defenseDrones have come to define the brutal conflict in Ukraine that has now dragged on for more than three years. And most rely on radio communications—a technology that Serhii “Flash” Beskrestnov has obsessed over since childhood.While Flash is now a civilian, the former officer has still taken it upon himself to inform his country’s defense in all matters related to radio. Once a month, he studies the skies for Russian radio transmissions and tries to learn about the problems facing troops in the fields and in the trenches.In this race for survival—as each side constantly tries to best the other, only to start all over again when the other inevitably catches up—Ukrainian soldiers need to develop creative solutions, and fast. As Ukraine’s wartime radio guru, Flash may just be one of their best hopes for doing that. Read the full story.\n—Charlie Metcalfe\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)\n+ Tune in at any time to the Coral City Camera, an underwater camera streaming live from an urban coral reef in Miami + Inhuman Resources, which mixes gaming, reading, and listening, sounds nuts.+ This compilation of 331 film clips to recreate Eminem’s Lose Yourself is spectacular.+ Questions I never thought I’d ask: what if Bigfoot were British?",
    "content": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nA US court just put ownership of CRISPR back in play\nThe CRISPR patents are back in play.\nYesterday, the US Court of Appeals for the Federal Circuit said scientists Jennifer Doudna and Emmanuelle Charpentier will get another chance to show they ought to own the key patents on what many consider the defining biotechnology invention of the 21st century.\nThe pair shared a 2020 Nobel Prize for developing the gene-editing system, which is already being used to treat various disorders.But when US patent rights were granted in 2014 to Feng Zhang of the Broad Institute of MIT and Harvard, the decision set off a bitter dispute in which hundreds of millions of dollars—as well as scientific bragging rights—are at stake. Read the full story.\n—Antonio Regalado\nTo read more about CRISPR, why not take a look at:+ Charpentier and Doudna announced they wanted to cancel their own CRISPR patents in Europe last year. Read the full story.+ How CRISPR will help the world cope with climate change. Read the full story.\n+ The US has approved CRISPR pigs for food. Pigs whose DNA makes them resistant to a virus could be the first big consumer product using gene editing. Read the full story.+ CRISPR will get easier and easier to administer. What does that mean for the future of our species?\n\nPolice tech can sidestep facial recognition bans now\n—James O’Donnell\nSix months ago I attended the largest gathering of chiefs of police in the US to see how they’re using AI. I found some big developments, like officers getting AI to write their reports. Now, I’ve published a new story that shows just how far AI for police has developed since then.It’s about a new method police are using to track people: an AI tool that uses attributes like body size, gender, hair color and style, clothing, and accessories instead of faces. It offers a way around laws curbing the use of facial recognition, which are on the rise.\nHere’s what this tells us about the development of police tech and what rules, if any, these departments are subject to in the age of AI. Read the full story.\nThis story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first, sign up here.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 Two Trump officials were denied access to the US Copyright Office Their visit came days after the administration fired the office’s head. (Wired $)+ Shira Perlmutter oversaw a report raising concerns about training AI with copyrighted materials. (WP $)\n2 Google knew it couldn’t monitor how Israel might use its cloud technologyBut it went ahead with Project Nimbus anyway. (The Intercept)\n3 Spain still doesn’t know what caused its massive power blackoutInvestigators are examining generators’ cyber defences for weaknesses. (FT $)+ Could solar power be to blame? (MIT Technology Review)\n4 Apple is considering hiking the price of iPhonesThe company doesn’t want to blame tariffs, though. (WSJ $)+ Apple boss Tim Cook had a call with Trump following the tariff rollback news. (CNBC)+ It’s reportedly developing an AI tool to extend phones’ battery life. (Bloomberg $)\n5 Venture capitalists aren’t 100% sure what an AI agent isThat isn’t stopping companies from sinking millions into them. (TechCrunch)+ Google is working on its own agent ahead of its I/O conference. (The Information $)+ What AI assistants can—and can’t—do. (Vox)+ Check out our AI agent explainer. (MIT Technology Review)\n6 Scammers are stealing the identities of death row inmatesAnd prisoners are unlikely to see correspondence alerting them to the fraud. (NBC News)\n7 Weight-loss drugs aren’t always enoughYou need long-term changes in health, not just weight. (The Atlantic $)+ How is Trump planning to lower drug costs, exactly? (NY Mag $)+ Drugs like Ozempic now make up 5% of prescriptions in the US. (MIT Technology Review)\n8 China’s e-commerce giants are racing to deliver goods within an hourAs competition has intensified, companies are fighting to be the quickest. (Reuters)\n9 This spacecraft will police satellites’ orbits And hunt them down where necessary. (IEEE Spectrum)+ The world’s biggest space-based radar will measure Earth’s forests from orbit. (MIT Technology Review)\n10 Is your beard trimmer broken? Simply 3D-print a new part.Philips is experimenting with letting its customers create their own replacements. (The Verge)\n\nQuote of the day\n“We usually set it up so that our team doesn’t get to creep in.”\n—Angie Saltman, founder and president of tech company Saltmedia, explains how her company helps store Indigenous data securely away from the Trump administration, the Verge reports.\n\nOne more thing\n\nMeet the radio-obsessed civilian shaping Ukraine’s drone defenseDrones have come to define the brutal conflict in Ukraine that has now dragged on for more than three years. And most rely on radio communications—a technology that Serhii “Flash” Beskrestnov has obsessed over since childhood.While Flash is now a civilian, the former officer has still taken it upon himself to inform his country’s defense in all matters related to radio. Once a month, he studies the skies for Russian radio transmissions and tries to learn about the problems facing troops in the fields and in the trenches.In this race for survival—as each side constantly tries to best the other, only to start all over again when the other inevitably catches up—Ukrainian soldiers need to develop creative solutions, and fast. As Ukraine’s wartime radio guru, Flash may just be one of their best hopes for doing that. Read the full story.\n—Charlie Metcalfe\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)\n+ Tune in at any time to the Coral City Camera, an underwater camera streaming live from an urban coral reef in Miami + Inhuman Resources, which mixes gaming, reading, and listening, sounds nuts.+ This compilation of 331 film clips to recreate Eminem’s Lose Yourself is spectacular.+ Questions I never thought I’d ask: what if Bigfoot were British?"
  },
  {
    "title": "Police tech can sidestep facial recognition bans now",
    "url": "https://www.technologyreview.com/2025/05/13/1116321/police-tech-can-sidestep-facial-recognition-bans-now/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Tue, 13 May 2025 09:00:00 +0000",
    "published_datetime": "2025-05-13T10:00:00",
    "summary": "Six months ago I attended the largest gathering of chiefs of police in the US to see how they’re using AI. I found some big developments, like officers getting AI to write their police reports. Today, I published a new story that shows just how far AI for police has developed since then. \nIt’s about a new method police departments and federal agencies have found to track people: an AI tool that uses attributes like body size, gender, hair color and style, clothing, and accessories instead of faces. It offers a way around laws curbing the use of facial recognition, which are on the rise. \nAdvocates from the ACLU, after learning of the tool through MIT Technology Review, said it was the first instance they’d seen of such a tracking system used at scale in the US, and they say it has a high potential for abuse by federal agencies. They say the prospect that AI will enable more powerful surveillance is especially alarming at a time when the Trump administration is pushing for more monitoring of protesters, immigrants, and students. \nI hope you read the full story for the details, and to watch a demo video of how the system works. But first, let’s talk for a moment about what this tells us about the development of police tech and what rules, if any, these departments are subject to in the age of AI.\nAs I pointed out in my story six months ago, police departments in the US have extraordinary independence. There are more than 18,000 departments in the country, and they generally have lots of discretion over what technology they spend their budgets on. In recent years, that technology has increasingly become AI-centric. \nCompanies like Flock and Axon sell suites of sensors—cameras, license plate readers, gunshot detectors, drones—and then offer AI tools to make sense of that ocean of data (at last year’s conference I saw schmoozing between countless AI-for-police startups and the chiefs they sell to on the expo floor). Departments say these technologies save time, ease officer shortages, and help cut down on response times. \nThose sound like fine goals, but this pace of adoption raises an obvious question: Who makes the rules here? When does the use of AI cross over from efficiency into surveillance, and what type of transparency is owed to the public?\nIn some cases, AI-powered police tech is already driving a wedge between departments and the communities they serve. When the police in Chula Vista, California, were the first in the country to get special waivers from the Federal Aviation Administration to fly their drones farther than normal, they said the drones would be deployed to solve crimes and get people help sooner in emergencies. They’ve had some successes. \nBut the department has also been sued by a local media outlet alleging it has reneged on its promise to make drone footage public, and residents have said the drones buzzing overhead feel like an invasion of privacy. An investigation found that these drones were deployed more often in poor neighborhoods, and for minor issues like loud music. \nJay Stanley, a senior policy analyst at the ACLU, says there’s no overarching federal law that governs how local police departments adopt technologies like the tracking software I wrote about. Departments usually have the leeway to try it first, and see how their communities react after the fact. (Veritone, which makes the tool I wrote about, said they couldn’t name or connect me with departments using it so the details of how it’s being deployed by police are not yet clear). \nSometimes communities take a firm stand; local laws against police use of facial recognition have been passed around the country. But departments—or the police tech companies they buy from—can find workarounds. Stanley says the new tracking software I wrote about poses lots of the same issues as facial recognition while escaping scrutiny because it doesn’t technically use biometric data.\n“The community should be very skeptical of this kind of tech and, at a minimum, ask a lot of questions,” he says. He laid out a road map of what police departments should do before they adopt AI technologies: have hearings with the public, get community permission, and make promises about how the systems will and will not be used. He added that the companies making this tech should also allow it to be tested by independent parties. \n“This is all coming down the pike,” he says—and so quickly that policymakers and the public have little time to keep up. He adds, “Are these powers we want the police—the authorities that serve us—to have, and if so, under what conditions?”\nThis story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first, sign up here.",
    "content": "Six months ago I attended the largest gathering of chiefs of police in the US to see how they’re using AI. I found some big developments, like officers getting AI to write their police reports. Today, I published a new story that shows just how far AI for police has developed since then. \nIt’s about a new method police departments and federal agencies have found to track people: an AI tool that uses attributes like body size, gender, hair color and style, clothing, and accessories instead of faces. It offers a way around laws curbing the use of facial recognition, which are on the rise. \nAdvocates from the ACLU, after learning of the tool through MIT Technology Review, said it was the first instance they’d seen of such a tracking system used at scale in the US, and they say it has a high potential for abuse by federal agencies. They say the prospect that AI will enable more powerful surveillance is especially alarming at a time when the Trump administration is pushing for more monitoring of protesters, immigrants, and students. \nI hope you read the full story for the details, and to watch a demo video of how the system works. But first, let’s talk for a moment about what this tells us about the development of police tech and what rules, if any, these departments are subject to in the age of AI.\nAs I pointed out in my story six months ago, police departments in the US have extraordinary independence. There are more than 18,000 departments in the country, and they generally have lots of discretion over what technology they spend their budgets on. In recent years, that technology has increasingly become AI-centric. \nCompanies like Flock and Axon sell suites of sensors—cameras, license plate readers, gunshot detectors, drones—and then offer AI tools to make sense of that ocean of data (at last year’s conference I saw schmoozing between countless AI-for-police startups and the chiefs they sell to on the expo floor). Departments say these technologies save time, ease officer shortages, and help cut down on response times. \nThose sound like fine goals, but this pace of adoption raises an obvious question: Who makes the rules here? When does the use of AI cross over from efficiency into surveillance, and what type of transparency is owed to the public?\nIn some cases, AI-powered police tech is already driving a wedge between departments and the communities they serve. When the police in Chula Vista, California, were the first in the country to get special waivers from the Federal Aviation Administration to fly their drones farther than normal, they said the drones would be deployed to solve crimes and get people help sooner in emergencies. They’ve had some successes. \nBut the department has also been sued by a local media outlet alleging it has reneged on its promise to make drone footage public, and residents have said the drones buzzing overhead feel like an invasion of privacy. An investigation found that these drones were deployed more often in poor neighborhoods, and for minor issues like loud music. \nJay Stanley, a senior policy analyst at the ACLU, says there’s no overarching federal law that governs how local police departments adopt technologies like the tracking software I wrote about. Departments usually have the leeway to try it first, and see how their communities react after the fact. (Veritone, which makes the tool I wrote about, said they couldn’t name or connect me with departments using it so the details of how it’s being deployed by police are not yet clear). \nSometimes communities take a firm stand; local laws against police use of facial recognition have been passed around the country. But departments—or the police tech companies they buy from—can find workarounds. Stanley says the new tracking software I wrote about poses lots of the same issues as facial recognition while escaping scrutiny because it doesn’t technically use biometric data.\n“The community should be very skeptical of this kind of tech and, at a minimum, ask a lot of questions,” he says. He laid out a road map of what police departments should do before they adopt AI technologies: have hearings with the public, get community permission, and make promises about how the systems will and will not be used. He added that the companies making this tech should also allow it to be tested by independent parties. \n“This is all coming down the pike,” he says—and so quickly that policymakers and the public have little time to keep up. He adds, “Are these powers we want the police—the authorities that serve us—to have, and if so, under what conditions?”\nThis story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first, sign up here."
  },
  {
    "title": "A US court just put ownership of CRISPR back in play",
    "url": "https://www.technologyreview.com/2025/05/13/1116344/a-us-court-just-put-ownership-of-crispr-back-in-play/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Tue, 13 May 2025 08:00:00 +0000",
    "published_datetime": "2025-05-13T09:00:00",
    "summary": "The CRISPR patents are back in play.\nOn Monday, the US Court of Appeals for the Federal Circuit said scientists Jennifer Doudna and Emmanuelle Charpentier will get another chance to show they ought to own the key patents on what many consider the defining biotechnology invention of the 21st century. \nThe pair shared a 2020 Nobel Prize for developing the versatile gene-editing system, which is already being used to treat various genetic disorders, including sickle cell disease. \nBut when key US patent rights were granted in 2014 to researcher Feng Zhang of the Broad Institute of MIT and Harvard, the decision set off a bitter dispute in which hundreds of millions of dollars—as well as scientific bragging rights—are at stake.\nThe new decision is a boost for the Nobelists, who had previously faced a string of demoralizing reversals over the patent rights in both the US and Europe.\n“This goes to who was the first to invent, who has priority, and who is entitled to the broadest patents,” says Jacob Sherkow, a law professor at the University of Illinois. \nHe says there is now at least a chance that Doudna and Charpentier “could walk away as the clear winner.”\nThe CRISPR patent battle is among the most byzantine ever, putting the technology alongside the steam engine, the telephone, the lightbulb, and the laser among the most hotly contested inventions in history.\nIn 2012, Doudna and Charpentier were first to publish a description of a CRISPR gene editor that could be programmed to precisely cut DNA in a test tube. There’s no dispute about that.\nHowever, the patent fight relates to the use of CRISPR to edit inside animal cells—like those of human beings. That’s considered a distinct invention, and one both sides say they were first to come up with that very same year. \nIn patent law, this moment is known as conception—the instant a lightbulb appears over an inventor’s head, revealing a definite and workable plan for how an invention is going to function.\nIn 2022, a specialized body called the Patent Trial and Appeal Board, or PTAB, decided that Doudna and Charpentier hadn’t fully conceived the invention because they initially encountered trouble getting their editor to work in fish and other species. Indeed, they had so much trouble that Zhang scooped them with a 2013 publication demonstrating he could use CRISPR to edit human cells.\nThe Nobelists appealed the finding, and yesterday the appeals court vacated it, saying the patent board applied the wrong standard and needs to reconsider the case. \nAccording to the court, Doudna and Charpentier didn’t have to “know their invention would work” to get credit for conceiving it. What could matter more, the court said, is that it actually did work in the end. \nIn a statement, the University of California, Berkeley, applauded the call for a do-over.  \n“Today’s decision creates an opportunity for the PTAB to reevaluate the evidence under the correct legal standard and confirm what the rest of the world has recognized: that the Doudna and Charpentier team were the first to develop this groundbreaking technology for the world to share,” Jeff Lamken, one of Berkeley’s attorneys, said in the statement.\nThe Broad Institute posted a statement saying it is “confident” the appeals board “will again confirm Broad’s patents, because the underlying facts have not changed.”\nThe decision is likely to reopen the investigation into what was written in 13-year-old lab notebooks and whether Zhang based his research, in part, on what he learned from Doudna and Charpentier’s publications. \nThe case will now return to the patent board for a further look, although Sherkow says the court finding can also be appealed directly to the US Supreme Court. ",
    "content": "The CRISPR patents are back in play.\nOn Monday, the US Court of Appeals for the Federal Circuit said scientists Jennifer Doudna and Emmanuelle Charpentier will get another chance to show they ought to own the key patents on what many consider the defining biotechnology invention of the 21st century. \nThe pair shared a 2020 Nobel Prize for developing the versatile gene-editing system, which is already being used to treat various genetic disorders, including sickle cell disease. \nBut when key US patent rights were granted in 2014 to researcher Feng Zhang of the Broad Institute of MIT and Harvard, the decision set off a bitter dispute in which hundreds of millions of dollars—as well as scientific bragging rights—are at stake.\nThe new decision is a boost for the Nobelists, who had previously faced a string of demoralizing reversals over the patent rights in both the US and Europe.\n“This goes to who was the first to invent, who has priority, and who is entitled to the broadest patents,” says Jacob Sherkow, a law professor at the University of Illinois. \nHe says there is now at least a chance that Doudna and Charpentier “could walk away as the clear winner.”\nThe CRISPR patent battle is among the most byzantine ever, putting the technology alongside the steam engine, the telephone, the lightbulb, and the laser among the most hotly contested inventions in history.\nIn 2012, Doudna and Charpentier were first to publish a description of a CRISPR gene editor that could be programmed to precisely cut DNA in a test tube. There’s no dispute about that.\nHowever, the patent fight relates to the use of CRISPR to edit inside animal cells—like those of human beings. That’s considered a distinct invention, and one both sides say they were first to come up with that very same year. \nIn patent law, this moment is known as conception—the instant a lightbulb appears over an inventor’s head, revealing a definite and workable plan for how an invention is going to function.\nIn 2022, a specialized body called the Patent Trial and Appeal Board, or PTAB, decided that Doudna and Charpentier hadn’t fully conceived the invention because they initially encountered trouble getting their editor to work in fish and other species. Indeed, they had so much trouble that Zhang scooped them with a 2013 publication demonstrating he could use CRISPR to edit human cells.\nThe Nobelists appealed the finding, and yesterday the appeals court vacated it, saying the patent board applied the wrong standard and needs to reconsider the case. \nAccording to the court, Doudna and Charpentier didn’t have to “know their invention would work” to get credit for conceiving it. What could matter more, the court said, is that it actually did work in the end. \nIn a statement, the University of California, Berkeley, applauded the call for a do-over.  \n“Today’s decision creates an opportunity for the PTAB to reevaluate the evidence under the correct legal standard and confirm what the rest of the world has recognized: that the Doudna and Charpentier team were the first to develop this groundbreaking technology for the world to share,” Jeff Lamken, one of Berkeley’s attorneys, said in the statement.\nThe Broad Institute posted a statement saying it is “confident” the appeals board “will again confirm Broad’s patents, because the underlying facts have not changed.”\nThe decision is likely to reopen the investigation into what was written in 13-year-old lab notebooks and whether Zhang based his research, in part, on what he learned from Doudna and Charpentier’s publications. \nThe case will now return to the patent board for a further look, although Sherkow says the court finding can also be appealed directly to the US Supreme Court. "
  },
  {
    "title": "The Download: a new form of AI surveillance, and the US and China’s tariff deal",
    "url": "https://www.technologyreview.com/2025/05/12/1116307/the-download-a-new-form-of-ai-surveillance-and-the-us-and-chinas-tariff-deal/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Mon, 12 May 2025 12:10:00 +0000",
    "published_datetime": "2025-05-12T13:10:00",
    "summary": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nHow a new type of AI is helping police skirt facial recognition bans\nPolice and federal agencies have found a controversial new way to skirt the growing patchwork of laws that curb how they use facial recognition: an AI model that can track people based on attributes like body size, gender, hair color and style, clothing, and accessories.\nThe tool, called Track and built by the video analytics company Veritone, is used by 400 customers, including state and local police departments and universities all over the US. It is also expanding federally.\nThe product has drawn criticism from the American Civil Liberties Union, which—after learning of the tool through MIT Technology Review—said it was the first instance they’d seen of a nonbiometric tracking system used at scale in the US. Read the full story.\n—James O’Donnell\nIf you’re interested in reading more about facial recognition and police tech, check out:\n+ How the largest gathering of US police chiefs is talking about AI. Officers training in virtual reality, cities surveilled by webs of sensors, and AI-generated police reports are all a sign of what’s to come. Read the full story.\n+ Clear, the company that has helped millions of people cut security lines, wants to give you a frictionless future—in exchange for your face. Read the full story.+ The US wants to use facial recognition to identify migrant children as they age.+ Why the movement to limit face recognition tech might finally get a win. Read the full story.+ Uber’s facial recognition is locking Indian drivers out of their accounts— and some people are finding their accounts permanently blocked. Read the full story.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 The US and China have struck a deal to slash tariffs For the next 90 days, at least. (Politico)+ But America’s 30% tariffs are still extremely high. (FT $)+ China has agreed to cut its levies from 125% to 10%. (CNN)\n2 OpenAI is negotiating a future IPO with MicrosoftWhile still preserving Microsoft’s access to the startup’s AI models. (FT $)+ Meanwhile, Microsoft is constantly racing to stay ahead of hackers. (Bloomberg $)\n3 DOGE cuts leave US workers at increasing risk of developing silicosis The lung disease is deadly—and preventable. (The Atlantic $)+ Can AI help DOGE slash government budgets? It’s complex. (MIT Technology Review)\n4 Scammers are posing as lawyers on TikTok to trick undocumented migrantsImmigration scams have skyrocketed since Trump took office. (WP $)+ An extensive sextortion network on TikTok is targeting American kids. (The Guardian)+ AI-powered fraud is everywhere right now. (Wired $)\n5 Weather balloons are being phased out in favor of AI toolsSevere budget cuts mean that fewer balloon flights are being scheduled. (Semafor)+ Trump’s tariffs will deliver a big blow to climate tech. (MIT Technology Review)6 Amazon Web Service depends on this mysterious chip startupAnnapurna, the company behind Amazon’s cloud success, is vital to its future. (WSJ $)\n7 Inside the quest to create the perfect solid-state batteryMassachusetts start-up Factorial wants to overhaul EVs’ image. (NYT $)+ But tariffs are bad news for batteries. (MIT Technology Review)\n8 A colossal data center in North Dakota is sitting emptyIt’s struggling to find a major tech customer to lease it. (The Information $)+ China built hundreds of AI data centers to catch the AI boom. Now many stand unused. (MIT Technology Review)\n9 Housewives make up Vietnam’s latest wave of gig workersThey’re storing goods in their fridges while they’re at home to cut costs. (Rest of World)\n10 Professional writers love Substack They’re using the medium to experiment with exciting new styles. (New Yorker $)+ Niche newsletters are big business these days. (NYT $)\n\nQuote of the day\n“It feels a bit like a prisoner seeing their triple life sentence reduced to a single one.”\n—Katja Bego, a senior research fellow at Chatham House, comments on the agreement between the US and China to cut tariffs from 145% to 30% in a post on Bluesky.\n\nOne more thing\n\nThe $100 billion bet that a postindustrial US city can reinvent itself as a high-tech hubOn a day in late April, a small drilling rig sits at the edge of the scrubby overgrown fields of Syracuse, New York, taking soil samples. It’s the first sign of construction on what could become the largest semiconductor manufacturing facility in the United States.The CHIPS and Science Act was widely viewed by industry leaders and politicians as a way to secure supply chains, and make the United States competitive again in semiconductor chip manufacturing.Now Syracuse is becoming an economic test of whether, over the next several decades, aggressive government policies—and the massive corporate investments they spur—can both boost the country’s manufacturing prowess and revitalize neglected parts of the country. Read the full story.\n—David Rotman\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)\n+ Stuck on which PC game to play? This list of the 100 best is a great place to start.+ Mari Salonen is the undisputed queen of pom poms.+ I like the look of this Swedish princess cake.+ Check out all the filming locations in the new Netflix show The Four Seasons—from Puerto Rico to Mount Peter.",
    "content": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nHow a new type of AI is helping police skirt facial recognition bans\nPolice and federal agencies have found a controversial new way to skirt the growing patchwork of laws that curb how they use facial recognition: an AI model that can track people based on attributes like body size, gender, hair color and style, clothing, and accessories.\nThe tool, called Track and built by the video analytics company Veritone, is used by 400 customers, including state and local police departments and universities all over the US. It is also expanding federally.\nThe product has drawn criticism from the American Civil Liberties Union, which—after learning of the tool through MIT Technology Review—said it was the first instance they’d seen of a nonbiometric tracking system used at scale in the US. Read the full story.\n—James O’Donnell\nIf you’re interested in reading more about facial recognition and police tech, check out:\n+ How the largest gathering of US police chiefs is talking about AI. Officers training in virtual reality, cities surveilled by webs of sensors, and AI-generated police reports are all a sign of what’s to come. Read the full story.\n+ Clear, the company that has helped millions of people cut security lines, wants to give you a frictionless future—in exchange for your face. Read the full story.+ The US wants to use facial recognition to identify migrant children as they age.+ Why the movement to limit face recognition tech might finally get a win. Read the full story.+ Uber’s facial recognition is locking Indian drivers out of their accounts— and some people are finding their accounts permanently blocked. Read the full story.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 The US and China have struck a deal to slash tariffs For the next 90 days, at least. (Politico)+ But America’s 30% tariffs are still extremely high. (FT $)+ China has agreed to cut its levies from 125% to 10%. (CNN)\n2 OpenAI is negotiating a future IPO with MicrosoftWhile still preserving Microsoft’s access to the startup’s AI models. (FT $)+ Meanwhile, Microsoft is constantly racing to stay ahead of hackers. (Bloomberg $)\n3 DOGE cuts leave US workers at increasing risk of developing silicosis The lung disease is deadly—and preventable. (The Atlantic $)+ Can AI help DOGE slash government budgets? It’s complex. (MIT Technology Review)\n4 Scammers are posing as lawyers on TikTok to trick undocumented migrantsImmigration scams have skyrocketed since Trump took office. (WP $)+ An extensive sextortion network on TikTok is targeting American kids. (The Guardian)+ AI-powered fraud is everywhere right now. (Wired $)\n5 Weather balloons are being phased out in favor of AI toolsSevere budget cuts mean that fewer balloon flights are being scheduled. (Semafor)+ Trump’s tariffs will deliver a big blow to climate tech. (MIT Technology Review)6 Amazon Web Service depends on this mysterious chip startupAnnapurna, the company behind Amazon’s cloud success, is vital to its future. (WSJ $)\n7 Inside the quest to create the perfect solid-state batteryMassachusetts start-up Factorial wants to overhaul EVs’ image. (NYT $)+ But tariffs are bad news for batteries. (MIT Technology Review)\n8 A colossal data center in North Dakota is sitting emptyIt’s struggling to find a major tech customer to lease it. (The Information $)+ China built hundreds of AI data centers to catch the AI boom. Now many stand unused. (MIT Technology Review)\n9 Housewives make up Vietnam’s latest wave of gig workersThey’re storing goods in their fridges while they’re at home to cut costs. (Rest of World)\n10 Professional writers love Substack They’re using the medium to experiment with exciting new styles. (New Yorker $)+ Niche newsletters are big business these days. (NYT $)\n\nQuote of the day\n“It feels a bit like a prisoner seeing their triple life sentence reduced to a single one.”\n—Katja Bego, a senior research fellow at Chatham House, comments on the agreement between the US and China to cut tariffs from 145% to 30% in a post on Bluesky.\n\nOne more thing\n\nThe $100 billion bet that a postindustrial US city can reinvent itself as a high-tech hubOn a day in late April, a small drilling rig sits at the edge of the scrubby overgrown fields of Syracuse, New York, taking soil samples. It’s the first sign of construction on what could become the largest semiconductor manufacturing facility in the United States.The CHIPS and Science Act was widely viewed by industry leaders and politicians as a way to secure supply chains, and make the United States competitive again in semiconductor chip manufacturing.Now Syracuse is becoming an economic test of whether, over the next several decades, aggressive government policies—and the massive corporate investments they spur—can both boost the country’s manufacturing prowess and revitalize neglected parts of the country. Read the full story.\n—David Rotman\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)\n+ Stuck on which PC game to play? This list of the 100 best is a great place to start.+ Mari Salonen is the undisputed queen of pom poms.+ I like the look of this Swedish princess cake.+ Check out all the filming locations in the new Netflix show The Four Seasons—from Puerto Rico to Mount Peter."
  },
  {
    "title": "How a new type of AI is helping police skirt facial recognition bans",
    "url": "https://www.technologyreview.com/2025/05/12/1116295/how-a-new-type-of-ai-is-helping-police-skirt-facial-recognition-bans/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Mon, 12 May 2025 09:00:00 +0000",
    "published_datetime": "2025-05-12T10:00:00",
    "summary": "Police and federal agencies have found a controversial new way to skirt the growing patchwork of laws that curb how they use facial recognition: an AI model that can track people using attributes like body size, gender, hair color and style, clothing, and accessories. \nThe tool, called Track and built by the video analytics company Veritone, is used by 400 customers, including state and local police departments and universities all over the US. It is also expanding federally: US attorneys at the Department of Justice began using Track for criminal investigations last August. Veritone’s broader suite of AI tools, which includes bona fide facial recognition, is also used by the Department of Homeland Security—which houses immigration agencies—and the Department of Defense, according to the company. \n“The whole vision behind Track in the first place,” says Veritone CEO Ryan Steelberg, was “if we’re not allowed to track people’s faces, how do we assist in trying to potentially identify criminals or malicious behavior or activity?” In addition to tracking individuals where facial recognition isn’t legally allowed, Steelberg says, it allows for tracking when faces are obscured or not visible. \nThe product has drawn criticism from the American Civil Liberties Union, which—after learning of the tool through MIT Technology Review—said it was the first instance they’d seen of a nonbiometric tracking system used at scale in the US. They warned that it raises many of the same privacy concerns as facial recognition but also introduces new ones at a time when the Trump administration is pushing federal agencies to ramp up monitoring of protesters, immigrants, and students.\nVeritone gave us a demonstration of Track in which it analyzed people in footage from different environments, ranging from the January 6 riots to subway stations. You can use it to find people by specifying body size, gender, hair color and style, shoes, clothing, and various accessories. The tool can then assemble timelines, tracking a person across different locations and video feeds. It can be accessed through Amazon and Microsoft cloud platforms.\nVERITONE; MIT TECHNOLOGY REVIEW (CAPTIONS)\n\nIn an interview, Steelberg said that the number of attributes Track uses to identify people will continue to grow. When asked if Track differentiates on the basis of skin tone, a company spokesperson said it’s one of the attributes the algorithm uses to tell people apart but that the software does not currently allow users to search for people by skin color. Track currently operates only on recorded video, but Steelberg claims the company is less than a year from being able to run it on live video feeds.\nAgencies using Track can add footage from police body cameras, drones, public videos on YouTube, or so-called citizen upload footage (from Ring cameras or cell phones, for example) in response to police requests. \n“We like to call this our Jason Bourne app,” Steelberg says. He expects the technology to come under scrutiny in court cases but says, “I hope we’re exonerating people as much as we’re helping police find the bad guys.” The public sector currently accounts for only 6% of Veritone’s business (most of its clients are media and entertainment companies), but the company says that’s its fastest-growing market, with clients in places including California, Washington, Colorado, New Jersey, and Illinois. \nThat rapid expansion has started to cause alarm in certain quarters. Jay Stanley, a senior policy analyst at the ACLU, wrote in 2019 that artificial intelligence would someday expedite the tedious task of combing through surveillance footage, enabling automated analysis regardless of whether a crime has occurred. Since then, lots of police-tech companies have been building video analytics systems that can, for example, detect when a person enters a certain area. However, Stanley says, Track is the first product he’s seen make broad tracking of particular people technologically feasible at scale.\n“This is a potentially authoritarian technology,” he says. “One that gives great powers to the police and the government that will make it easier for them, no doubt, to solve certain crimes, but will also make it easier for them to overuse this technology, and to potentially abuse it.”\nChances of such abusive surveillance, Stanley says, are particularly high right now in the federal agencies where Veritone has customers. The Department of Homeland Security said last month that it will monitor the social media activities of immigrants and use evidence it finds there to deny visas and green cards, and Immigrations and Customs Enforcement has detained activists following pro-Palestinian statements or appearances at protests. \nIn an interview, Jon Gacek, general manager of Veritone’s public-sector business, said that Track is a “culling tool” meant to speed up the task of identifying important parts of videos, not a general surveillance tool. Veritone did not specify which groups within the Department of Homeland Security or other federal agencies use Track. The Departments of Defense, Justice, and Homeland Security did not respond to requests for comment. \nFor police departments, the tool dramatically expands the amount of video that can be used in investigations. Whereas facial recognition requires footage in which faces are clearly visible, Track doesn’t have that limitation. Nathan Wessler, an attorney for the ACLU, says this means police might comb through videos they had no interest in before. \n“It creates a categorically new scale and nature of privacy invasion and potential for abuse that was literally not possible any time before in human history,” Wessler says. “You’re now talking about not speeding up what a cop could do, but creating a capability that no cop ever had before.”\nTrack’s expansion comes as laws limiting the use of facial recognition have spread, sparked by wrongful arrests in which officers have been overly confident in the judgments of algorithms.  Numerous studies have shown that such algorithms are less accurate with nonwhite faces. Laws in Montana and Maine sharply limit when police can use it—it’s not allowed in real time with live video—while San Francisco and Oakland, California have near-complete bans on facial recognition. Track provides an alternative. \nThough such laws often reference “biometric data,” Wessler says this phrase is far from clearly defined. It generally refers to immutable characteristics like faces, gait and fingerprints rather than things that change, like clothing. But certain attributes, such as body size, blur this distinction. \nConsider also, Wessler says, someone in winter who frequently wears the same boots, coat, and backpack. “Their profile is going to be the same day after day,” Wessler says. “The potential to track somebody over time based on how they’re moving across a whole bunch of different saved video feeds is pretty equivalent to face recognition.”\nIn other words, Track might provide a way of following someone that raises many of the same concerns as facial recognition, but isn’t subject to laws restricting use of facial recognition because it does not technically involve biometric data. Steelberg said there are several ongoing cases that include video evidence from Track, but that he couldn’t name the cases or comment further. So for now, it’s unclear whether it’s being adopted in jurisdictions where facial recognition is banned. ",
    "content": "Police and federal agencies have found a controversial new way to skirt the growing patchwork of laws that curb how they use facial recognition: an AI model that can track people using attributes like body size, gender, hair color and style, clothing, and accessories. \nThe tool, called Track and built by the video analytics company Veritone, is used by 400 customers, including state and local police departments and universities all over the US. It is also expanding federally: US attorneys at the Department of Justice began using Track for criminal investigations last August. Veritone’s broader suite of AI tools, which includes bona fide facial recognition, is also used by the Department of Homeland Security—which houses immigration agencies—and the Department of Defense, according to the company. \n“The whole vision behind Track in the first place,” says Veritone CEO Ryan Steelberg, was “if we’re not allowed to track people’s faces, how do we assist in trying to potentially identify criminals or malicious behavior or activity?” In addition to tracking individuals where facial recognition isn’t legally allowed, Steelberg says, it allows for tracking when faces are obscured or not visible. \nThe product has drawn criticism from the American Civil Liberties Union, which—after learning of the tool through MIT Technology Review—said it was the first instance they’d seen of a nonbiometric tracking system used at scale in the US. They warned that it raises many of the same privacy concerns as facial recognition but also introduces new ones at a time when the Trump administration is pushing federal agencies to ramp up monitoring of protesters, immigrants, and students.\nVeritone gave us a demonstration of Track in which it analyzed people in footage from different environments, ranging from the January 6 riots to subway stations. You can use it to find people by specifying body size, gender, hair color and style, shoes, clothing, and various accessories. The tool can then assemble timelines, tracking a person across different locations and video feeds. It can be accessed through Amazon and Microsoft cloud platforms.\nVERITONE; MIT TECHNOLOGY REVIEW (CAPTIONS)\n\nIn an interview, Steelberg said that the number of attributes Track uses to identify people will continue to grow. When asked if Track differentiates on the basis of skin tone, a company spokesperson said it’s one of the attributes the algorithm uses to tell people apart but that the software does not currently allow users to search for people by skin color. Track currently operates only on recorded video, but Steelberg claims the company is less than a year from being able to run it on live video feeds.\nAgencies using Track can add footage from police body cameras, drones, public videos on YouTube, or so-called citizen upload footage (from Ring cameras or cell phones, for example) in response to police requests. \n“We like to call this our Jason Bourne app,” Steelberg says. He expects the technology to come under scrutiny in court cases but says, “I hope we’re exonerating people as much as we’re helping police find the bad guys.” The public sector currently accounts for only 6% of Veritone’s business (most of its clients are media and entertainment companies), but the company says that’s its fastest-growing market, with clients in places including California, Washington, Colorado, New Jersey, and Illinois. \nThat rapid expansion has started to cause alarm in certain quarters. Jay Stanley, a senior policy analyst at the ACLU, wrote in 2019 that artificial intelligence would someday expedite the tedious task of combing through surveillance footage, enabling automated analysis regardless of whether a crime has occurred. Since then, lots of police-tech companies have been building video analytics systems that can, for example, detect when a person enters a certain area. However, Stanley says, Track is the first product he’s seen make broad tracking of particular people technologically feasible at scale.\n“This is a potentially authoritarian technology,” he says. “One that gives great powers to the police and the government that will make it easier for them, no doubt, to solve certain crimes, but will also make it easier for them to overuse this technology, and to potentially abuse it.”\nChances of such abusive surveillance, Stanley says, are particularly high right now in the federal agencies where Veritone has customers. The Department of Homeland Security said last month that it will monitor the social media activities of immigrants and use evidence it finds there to deny visas and green cards, and Immigrations and Customs Enforcement has detained activists following pro-Palestinian statements or appearances at protests. \nIn an interview, Jon Gacek, general manager of Veritone’s public-sector business, said that Track is a “culling tool” meant to speed up the task of identifying important parts of videos, not a general surveillance tool. Veritone did not specify which groups within the Department of Homeland Security or other federal agencies use Track. The Departments of Defense, Justice, and Homeland Security did not respond to requests for comment. \nFor police departments, the tool dramatically expands the amount of video that can be used in investigations. Whereas facial recognition requires footage in which faces are clearly visible, Track doesn’t have that limitation. Nathan Wessler, an attorney for the ACLU, says this means police might comb through videos they had no interest in before. \n“It creates a categorically new scale and nature of privacy invasion and potential for abuse that was literally not possible any time before in human history,” Wessler says. “You’re now talking about not speeding up what a cop could do, but creating a capability that no cop ever had before.”\nTrack’s expansion comes as laws limiting the use of facial recognition have spread, sparked by wrongful arrests in which officers have been overly confident in the judgments of algorithms.  Numerous studies have shown that such algorithms are less accurate with nonwhite faces. Laws in Montana and Maine sharply limit when police can use it—it’s not allowed in real time with live video—while San Francisco and Oakland, California have near-complete bans on facial recognition. Track provides an alternative. \nThough such laws often reference “biometric data,” Wessler says this phrase is far from clearly defined. It generally refers to immutable characteristics like faces, gait and fingerprints rather than things that change, like clothing. But certain attributes, such as body size, blur this distinction. \nConsider also, Wessler says, someone in winter who frequently wears the same boots, coat, and backpack. “Their profile is going to be the same day after day,” Wessler says. “The potential to track somebody over time based on how they’re moving across a whole bunch of different saved video feeds is pretty equivalent to face recognition.”\nIn other words, Track might provide a way of following someone that raises many of the same concerns as facial recognition, but isn’t subject to laws restricting use of facial recognition because it does not technically involve biometric data. Steelberg said there are several ongoing cases that include video evidence from Track, but that he couldn’t name the cases or comment further. So for now, it’s unclear whether it’s being adopted in jurisdictions where facial recognition is banned. "
  },
  {
    "title": "The Download: AI headphone translation, and the link between microbes and our behavior",
    "url": "https://www.technologyreview.com/2025/05/09/1116247/the-download-ai-headphone-translation-and-the-link-between-microbes-and-our-behavior/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Fri, 09 May 2025 12:10:00 +0000",
    "published_datetime": "2025-05-09T13:10:00",
    "summary": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nA new AI translation system for headphones clones multiple voices simultaneously\nWhat’s new: Imagine going for dinner with a group of friends who switch in and out of different languages you don’t speak, but still being able to understand what they’re saying. This scenario is the inspiration for a new AI headphone system that translates the speech of multiple speakers simultaneously, in real time.\nHow it works: The system tracks the direction and vocal characteristics of each speaker, helping the person wearing the headphones to identify who is saying what in a group setting. Read the full story.\n—Rhiannon Williams\n\nYour gut microbes might encourage criminal behavior\nA few years ago, a Belgian man in his 30s drove into a lamppost. Twice. Local authorities found that his blood alcohol level was four times the legal limit. Over the space of a few years, the man was apprehended for drunk driving three times. And on all three occasions, he insisted he hadn’t been drinking.\nHe was telling the truth. A doctor later diagnosed auto-brewery syndrome—a rare condition in which the body makes its own alcohol. Microbes living inside the man’s body were fermenting the carbohydrates in his diet to create ethanol. Last year, he was acquitted of drunk driving.His case, along with several other scientific studies, raises a fascinating question for microbiology, neuroscience, and the law: How much of our behavior can we blame on our microbes? Read the full story.\n—Jessica Hamzelou\nThis article first appeared in The Checkup, MIT Technology Review’s weekly biotech newsletter. To receive it in your inbox every Thursday, and read articles like this first, sign up here.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 How the Gates Foundation will endBill Gates will wind it down in 2045, after distributing most of his remaining fortune. (NYT $)+ He estimates he’ll give away $200 billion in the next 20 years. (Semafor)+ The foundation is shuttering several decades earlier than he expected. (BBC)\n2 US Customs and Border Protection will no longer protect pregnant womenIt’s rolled back policies designed to protect vulnerable people, including infants. (Wired $)+ The US wants to use facial recognition to identify migrant children as they age. (MIT Technology Review)\n3 DOGE is readying software to turbo-charge mass layoffsAfter some 260,000 government workers have already been let go. (Reuters)+ DOGE’s math doesn’t add up. (The Atlantic $)+ One of its biggest inspirations is no fan of the program. (WP $)+ Can AI help DOGE slash government budgets? It’s complex. (MIT Technology Review)\n4 Scientists are using AI to predict cancer survival outcomesIn some cases, it’s outperforming clinicians’ forecasts. (FT $)+ Why it’s so hard to use AI to diagnose cancer. (MIT Technology Review)\n5 Apple is reportedly working on new chips for its smart glassesBut we’ll have to wait a few more years. (Bloomberg $)+ What’s next for smart glasses. (MIT Technology Review)\n6 Silicon Valley has a vision for the future of warfareMilitary technologies are no longer solely the preserve of governments. (Bloomberg $)+ Palmer Luckey on the Pentagon’s future of mixed reality. (MIT Technology Review)\n7 AI companies don’t want regulation any moreJust a few short years after they claimed regulation was the best way of making AI safe. (WP $)\n8 Forget SEO, GEO is where it’s at these daysMarketers are scrambling to adopt best Generative Engine Optimization practices now that AI is upending how we search the web. (WSJ $)+ Your most important customer may be AI. (MIT Technology Review)\n9 AI-generated recruiters are making job hunting even worseAvatars can glitch out and stumble over their words. (404 Media)\n10 A Soviet-era spacecraft is reentering Earth’s atmosphereMore than 50 years after it misfired on a journey to Venus. (Ars Technica)+ The world’s next big environmental problem could come from space. (MIT Technology Review)\n\nQuote of the day\n“The picture of the world’s richest man killing the world’s poorest children is not a pretty one.”\n—Bill Gates lashes out at Elon Musk’s cuts to USAID in an interview with the Financial Times.\n\nOne more thing\n\nThe great commercial takeover of low Earth orbit\nNASA designed the International Space Station to fly for 20 years. It has lasted six years longer than that, though it is showing its age, and NASA is currently studying how to safely destroy the space laboratory by around 2030.The ISS never really became what some had hoped: a launching point for an expanding human presence in the solar system. But it did enable fundamental research on materials and medicine, and it helped us start to understand how space affects the human body.To build on that work, NASA has partnered with private companies to develop new, commercial space stations for research, manufacturing, and tourism. If they are successful, these companies will bring about a new era of space exploration: private rockets flying to private destinations. They’re already planning to do it around the moon. One day, Mars could follow. Read the full story.\n—David W. Brown\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)\n+ It’s almost pasta salad time!+ Who is the better fictional archaeologist: Indiana Jones or Lara Croft?+ How a good night’s sleep could help to give you a long-lasting memory boost. + How millennials became deeply uncool (allegedly)",
    "content": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nA new AI translation system for headphones clones multiple voices simultaneously\nWhat’s new: Imagine going for dinner with a group of friends who switch in and out of different languages you don’t speak, but still being able to understand what they’re saying. This scenario is the inspiration for a new AI headphone system that translates the speech of multiple speakers simultaneously, in real time.\nHow it works: The system tracks the direction and vocal characteristics of each speaker, helping the person wearing the headphones to identify who is saying what in a group setting. Read the full story.\n—Rhiannon Williams\n\nYour gut microbes might encourage criminal behavior\nA few years ago, a Belgian man in his 30s drove into a lamppost. Twice. Local authorities found that his blood alcohol level was four times the legal limit. Over the space of a few years, the man was apprehended for drunk driving three times. And on all three occasions, he insisted he hadn’t been drinking.\nHe was telling the truth. A doctor later diagnosed auto-brewery syndrome—a rare condition in which the body makes its own alcohol. Microbes living inside the man’s body were fermenting the carbohydrates in his diet to create ethanol. Last year, he was acquitted of drunk driving.His case, along with several other scientific studies, raises a fascinating question for microbiology, neuroscience, and the law: How much of our behavior can we blame on our microbes? Read the full story.\n—Jessica Hamzelou\nThis article first appeared in The Checkup, MIT Technology Review’s weekly biotech newsletter. To receive it in your inbox every Thursday, and read articles like this first, sign up here.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 How the Gates Foundation will endBill Gates will wind it down in 2045, after distributing most of his remaining fortune. (NYT $)+ He estimates he’ll give away $200 billion in the next 20 years. (Semafor)+ The foundation is shuttering several decades earlier than he expected. (BBC)\n2 US Customs and Border Protection will no longer protect pregnant womenIt’s rolled back policies designed to protect vulnerable people, including infants. (Wired $)+ The US wants to use facial recognition to identify migrant children as they age. (MIT Technology Review)\n3 DOGE is readying software to turbo-charge mass layoffsAfter some 260,000 government workers have already been let go. (Reuters)+ DOGE’s math doesn’t add up. (The Atlantic $)+ One of its biggest inspirations is no fan of the program. (WP $)+ Can AI help DOGE slash government budgets? It’s complex. (MIT Technology Review)\n4 Scientists are using AI to predict cancer survival outcomesIn some cases, it’s outperforming clinicians’ forecasts. (FT $)+ Why it’s so hard to use AI to diagnose cancer. (MIT Technology Review)\n5 Apple is reportedly working on new chips for its smart glassesBut we’ll have to wait a few more years. (Bloomberg $)+ What’s next for smart glasses. (MIT Technology Review)\n6 Silicon Valley has a vision for the future of warfareMilitary technologies are no longer solely the preserve of governments. (Bloomberg $)+ Palmer Luckey on the Pentagon’s future of mixed reality. (MIT Technology Review)\n7 AI companies don’t want regulation any moreJust a few short years after they claimed regulation was the best way of making AI safe. (WP $)\n8 Forget SEO, GEO is where it’s at these daysMarketers are scrambling to adopt best Generative Engine Optimization practices now that AI is upending how we search the web. (WSJ $)+ Your most important customer may be AI. (MIT Technology Review)\n9 AI-generated recruiters are making job hunting even worseAvatars can glitch out and stumble over their words. (404 Media)\n10 A Soviet-era spacecraft is reentering Earth’s atmosphereMore than 50 years after it misfired on a journey to Venus. (Ars Technica)+ The world’s next big environmental problem could come from space. (MIT Technology Review)\n\nQuote of the day\n“The picture of the world’s richest man killing the world’s poorest children is not a pretty one.”\n—Bill Gates lashes out at Elon Musk’s cuts to USAID in an interview with the Financial Times.\n\nOne more thing\n\nThe great commercial takeover of low Earth orbit\nNASA designed the International Space Station to fly for 20 years. It has lasted six years longer than that, though it is showing its age, and NASA is currently studying how to safely destroy the space laboratory by around 2030.The ISS never really became what some had hoped: a launching point for an expanding human presence in the solar system. But it did enable fundamental research on materials and medicine, and it helped us start to understand how space affects the human body.To build on that work, NASA has partnered with private companies to develop new, commercial space stations for research, manufacturing, and tourism. If they are successful, these companies will bring about a new era of space exploration: private rockets flying to private destinations. They’re already planning to do it around the moon. One day, Mars could follow. Read the full story.\n—David W. Brown\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)\n+ It’s almost pasta salad time!+ Who is the better fictional archaeologist: Indiana Jones or Lara Croft?+ How a good night’s sleep could help to give you a long-lasting memory boost. + How millennials became deeply uncool (allegedly)"
  }
]