[
  {
    "title": "Your AI and Data Future is Sovereign",
    "url": "https://www.technologyreview.com/2025/06/10/1118376/your-ai-and-data-future-is-sovereign/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Tue, 10 Jun 2025 12:14:14 +0000",
    "published_datetime": "2025-06-10T13:14:14",
    "summary": "\n\n\n\n\n",
    "content": "\n\n\n\n\n"
  },
  {
    "title": "The Download: IBM’s quantum computer, and cuts to military AI testing",
    "url": "https://www.technologyreview.com/2025/06/10/1118372/the-download-ibms-quantum-computer-and-cuts-to-military-ai-testing/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Tue, 10 Jun 2025 12:10:00 +0000",
    "published_datetime": "2025-06-10T13:10:00",
    "summary": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nIBM aims to build the world’s first large-scale, error-corrected quantum computer by 2028\nThe news: IBM announced detailed plans today to build an error-corrected quantum computer with significantly more computational capability than existing machines by 2028. It hopes to make the computer available to users via the cloud by 2029. What is it? The proposed machine, named Starling, will consist of a network of modules, each of which contains a set of chips, housed within a new data center in Poughkeepsie, New York.Why it matters: IBM claims Starling will be a leap forward in quantum computing. In particular, the company aims for it to be the first large-scale machine to implement error correction. If Starling achieves this, IBM will have solved arguably the biggest technical hurdle facing the industry today. Read the full story.\n—Sophia Chen\n\nThe Pentagon is gutting the team that tests AI and weapons systems\nThe Trump administration’s chainsaw approach to federal spending lives on, even as Elon Musk turns on the president. \nAs part of a string of moves, Secretary of Defense Pete Hegseth has cut the size of the Office of the Director of Operational Test and Evaluation in half. The group was established in the 1980s after criticisms that the Pentagon was fielding weapons and systems that didn’t perform as safely or effectively as advertised. Hegseth is reducing the agency’s staff to about 45, down from 94, and firing and replacing its director. \nIt is a significant overhaul of a department that in 40 years has never before been placed so squarely on the chopping block. Here’s how defense tech companies stand to gain (and the rest of us may stand to lose).\n—James O’Donnell\nThis story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first, sign up here.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 Conspiracy theories are spreading about the LA protestsMisleading photos and videos are circulating on social media. (NYT $)+ Donald Trump has vowed to send 700 Marines to the city. (The Guardian)+ Waymo has paused its service in downtown LA after its vehicles were set alight. (LA Times $)\n2 RFK Jr has fired an entire CDC panel of vaccine expertsThe anti-vaccine advocate accused them of conflicts of interest. (Ars Technica)+ He claims that their replacements will “exercise independent judgment.” (WSJ $)+ RFK Jr is interested in using a toxic bleach solution to treat ailments. (Wired $)+ How measuring vaccine hesitancy could help health professionals tackle it. (MIT Technology Review)\n3 A new covid variant is spreading across Europe and the USWhile it’s considered low risk, ‘Nimbus’ appears to be more infectious. (Wired $)\n4 White House security cautioned against installing Starlink internetBut Elon Musk’s team ignored them and fitted the service in the complex anyway. (WP $)+ Trump isn’t planning on getting rid of it, though. (Bloomberg $)\n5 Developers are underwhelmed by Apple’s AI effortsIts WWDC announcements haven’t been met with much enthusiasm. (WSJ $)+ The company is opening up its AI models to developers for the first time. (FT $)+ Where’s the overhauled, AI-powered Siri we were promised? (TechCrunch)\n6 Meta is assembling a new AI research labResearchers will be tasked with beating its rivals to achieve superintelligence. (Bloomberg $)+ There’s no doubt that Meta is feeling the heat right now. (The Information $)\n7 Vulnerable minors are increasingly becoming radicalized onlineThe sad case of Rhianan Rudd illustrates the ease of access to extremist material. (FT $)\n8 Our nerves may play a central role in how cancer spreadsResearchers believe they may help tumors to grow. (New Scientist $)+ Why it’s so hard to use AI to diagnose cancer. (MIT Technology Review)\n9 An end is in sight for the video game actors’ strikeMajor labels have reached a tentative deal with the SAG-AFTRA. (Variety $)+ How Meta and AI companies recruited striking actors to train AI. (MIT Technology Review)\n10 The UK is planning a robotaxi trial next nextMany years behind other countries. (FT $)\n\nQuote of the day\n“At the end of the day, what they need to do is deliver on what they presented a year ago.”\n—Bob O’Donnell, chief analyst at Technalysis Research, tells Reuters where Apple went wrong with its lacklustre WWDC announcements.\n\nOne more thing\n\nThe great AI consciousness conundrumAI consciousness isn’t just a devilishly tricky intellectual puzzle; it’s a morally weighty problem with potentially dire consequences that philosophers, cognitive scientists, and engineers alike are currently grappling with.Fail to identify a conscious AI, and you might unintentionally subjugate a being whose interests ought to matter. Mistake an unconscious AI for a conscious one, and you risk compromising human safety and happiness for the sake of an unthinking, unfeeling hunk of silicon and code.Over the past few decades, a small research community has doggedly attacked the question of what consciousness is and how it works. The effort has yielded real progress. And now, with the rapid advance of AI technology, these insights could offer our only guide to the untested, morally fraught waters of artificial consciousness. Read the full story.\n—Grace Huckins\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)\n+ Rest in power Sly Stone, truly one of the funky greats.+ Did you know there’s an Olympics for scaffolding? Well, you do now.+ Just one man is responsible for some of the greatest film artwork of all time—Drew Struzan.+ That’s one dramatic pizza maker.",
    "content": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nIBM aims to build the world’s first large-scale, error-corrected quantum computer by 2028\nThe news: IBM announced detailed plans today to build an error-corrected quantum computer with significantly more computational capability than existing machines by 2028. It hopes to make the computer available to users via the cloud by 2029. What is it? The proposed machine, named Starling, will consist of a network of modules, each of which contains a set of chips, housed within a new data center in Poughkeepsie, New York.Why it matters: IBM claims Starling will be a leap forward in quantum computing. In particular, the company aims for it to be the first large-scale machine to implement error correction. If Starling achieves this, IBM will have solved arguably the biggest technical hurdle facing the industry today. Read the full story.\n—Sophia Chen\n\nThe Pentagon is gutting the team that tests AI and weapons systems\nThe Trump administration’s chainsaw approach to federal spending lives on, even as Elon Musk turns on the president. \nAs part of a string of moves, Secretary of Defense Pete Hegseth has cut the size of the Office of the Director of Operational Test and Evaluation in half. The group was established in the 1980s after criticisms that the Pentagon was fielding weapons and systems that didn’t perform as safely or effectively as advertised. Hegseth is reducing the agency’s staff to about 45, down from 94, and firing and replacing its director. \nIt is a significant overhaul of a department that in 40 years has never before been placed so squarely on the chopping block. Here’s how defense tech companies stand to gain (and the rest of us may stand to lose).\n—James O’Donnell\nThis story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first, sign up here.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 Conspiracy theories are spreading about the LA protestsMisleading photos and videos are circulating on social media. (NYT $)+ Donald Trump has vowed to send 700 Marines to the city. (The Guardian)+ Waymo has paused its service in downtown LA after its vehicles were set alight. (LA Times $)\n2 RFK Jr has fired an entire CDC panel of vaccine expertsThe anti-vaccine advocate accused them of conflicts of interest. (Ars Technica)+ He claims that their replacements will “exercise independent judgment.” (WSJ $)+ RFK Jr is interested in using a toxic bleach solution to treat ailments. (Wired $)+ How measuring vaccine hesitancy could help health professionals tackle it. (MIT Technology Review)\n3 A new covid variant is spreading across Europe and the USWhile it’s considered low risk, ‘Nimbus’ appears to be more infectious. (Wired $)\n4 White House security cautioned against installing Starlink internetBut Elon Musk’s team ignored them and fitted the service in the complex anyway. (WP $)+ Trump isn’t planning on getting rid of it, though. (Bloomberg $)\n5 Developers are underwhelmed by Apple’s AI effortsIts WWDC announcements haven’t been met with much enthusiasm. (WSJ $)+ The company is opening up its AI models to developers for the first time. (FT $)+ Where’s the overhauled, AI-powered Siri we were promised? (TechCrunch)\n6 Meta is assembling a new AI research labResearchers will be tasked with beating its rivals to achieve superintelligence. (Bloomberg $)+ There’s no doubt that Meta is feeling the heat right now. (The Information $)\n7 Vulnerable minors are increasingly becoming radicalized onlineThe sad case of Rhianan Rudd illustrates the ease of access to extremist material. (FT $)\n8 Our nerves may play a central role in how cancer spreadsResearchers believe they may help tumors to grow. (New Scientist $)+ Why it’s so hard to use AI to diagnose cancer. (MIT Technology Review)\n9 An end is in sight for the video game actors’ strikeMajor labels have reached a tentative deal with the SAG-AFTRA. (Variety $)+ How Meta and AI companies recruited striking actors to train AI. (MIT Technology Review)\n10 The UK is planning a robotaxi trial next nextMany years behind other countries. (FT $)\n\nQuote of the day\n“At the end of the day, what they need to do is deliver on what they presented a year ago.”\n—Bob O’Donnell, chief analyst at Technalysis Research, tells Reuters where Apple went wrong with its lacklustre WWDC announcements.\n\nOne more thing\n\nThe great AI consciousness conundrumAI consciousness isn’t just a devilishly tricky intellectual puzzle; it’s a morally weighty problem with potentially dire consequences that philosophers, cognitive scientists, and engineers alike are currently grappling with.Fail to identify a conscious AI, and you might unintentionally subjugate a being whose interests ought to matter. Mistake an unconscious AI for a conscious one, and you risk compromising human safety and happiness for the sake of an unthinking, unfeeling hunk of silicon and code.Over the past few decades, a small research community has doggedly attacked the question of what consciousness is and how it works. The effort has yielded real progress. And now, with the rapid advance of AI technology, these insights could offer our only guide to the untested, morally fraught waters of artificial consciousness. Read the full story.\n—Grace Huckins\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)\n+ Rest in power Sly Stone, truly one of the funky greats.+ Did you know there’s an Olympics for scaffolding? Well, you do now.+ Just one man is responsible for some of the greatest film artwork of all time—Drew Struzan.+ That’s one dramatic pizza maker."
  },
  {
    "title": "IBM aims to build the world’s first large-scale, error-corrected quantum computer by 2028",
    "url": "https://www.technologyreview.com/2025/06/10/1118297/ibm-large-scale-error-corrected-quantum-computer-by-2028/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Tue, 10 Jun 2025 10:00:00 +0000",
    "published_datetime": "2025-06-10T11:00:00",
    "summary": "IBM announced detailed plans today to build an error-corrected quantum computer with significantly more computational capability than existing machines by 2028. It hopes to make the computer available to users via the cloud by 2029. \nThe proposed machine, named Starling, will consist of a network of modules, each of which contains a set of chips, housed within a new data center in Poughkeepsie, New York. “We’ve already started building the space,” says Jay Gambetta, vice president of IBM’s quantum initiative.\nIBM claims Starling will be a leap forward in quantum computing. In particular, the company aims for it to be the first large-scale machine to implement error correction. If Starling achieves this, IBM will have solved arguably the biggest technical hurdle facing the industry today to beat competitors including Google, Amazon Web Services, and smaller startups such as Boston-based QuEra and PsiQuantum of Palo Alto, California. \nIBM, along with the rest of the industry, has years of work ahead. But Gambetta thinks it has an edge because it has all the building blocks to build error correction capabilities in a large-scale machine. That means improvements in everything from algorithm development to chip packaging. “We’ve cracked the code for quantum error correction, and now we’ve moved from science to engineering,” he says. \nCorrecting errors in a quantum computer has been an engineering challenge, owing to the unique way the machines crunch numbers. Whereas classical computers encode information in the form of bits, or binary 1 and 0, quantum computers instead use qubits, which can represent “superpositions” of both values at once. IBM builds qubits made of tiny superconducting circuits, kept near absolute zero, in an interconnected layout on chips. Other companies have built qubits out of other materials, including neutral atoms, ions, and photons.\nQuantum computers sometimes commit errors, such as when the hardware operates on one qubit but accidentally also alters a neighboring qubit that should not be involved in the computation. These errors add up over time. Without error correction, quantum computers cannot accurately perform the complex algorithms that are expected to be the source of their scientific or commercial value, such as extremely precise chemistry simulations for discovering new materials and pharmaceutical drugs. \nBut error correction requires significant hardware overhead. Instead of encoding a single unit of information in a single “physical” qubit, error correction algorithms encode a unit of information in a constellation of physical qubits, referred to collectively as a “logical qubit.” \nCurrently, quantum computing researchers are competing to develop the best error correction scheme. Google’s surface code algorithm, while effective at correcting errors, requires on the order of 100 qubits to store a single logical qubit in memory. AWS’s Ocelot quantum computer uses a more efficient error correction scheme that requires nine physical qubits per logical qubit in memory. (The overhead is higher for qubits performing computations for storing data.) IBM’s error correction algorithm, known as a low-density parity check code, will make it possible to use 12 physical qubits per logical qubit in memory, a ratio comparable to AWS’s. \nOne distinguishing characteristic of Starling’s design will be its anticipated ability to diagnose errors, known as decoding, in real time. Decoding involves determining whether a measured signal from the quantum computer corresponds to an error. IBM has developed a decoding algorithm that can be quickly executed by a type of conventional chip known as an FPGA. This work bolsters the “credibility” of IBM’s error correction method, says Neil Gillespie of the UK-based quantum computing startup Riverlane. \nHowever, other error correction schemes and hardware designs aren’t out of the running yet. “It’s still not clear what the winning architecture is going to be,” says Gillespie. \nIBM intends Starling to be able to perform computational tasks beyond the capability of classical computers. Starling will have 200 logical qubits, which will be constructed using the company’s chips. It should be able to perform 100 million logical operations consecutively with accuracy; existing quantum computers can do so for only a few thousand. \nThe system will demonstrate error correction at a much larger scale than anything done before, claims Gambetta. Previous error correction demonstrations, such as those done by Google and Amazon, involve a single logical qubit, built from a single chip. Gambetta calls them “gadget experiments,” saying “They’re small-scale.” \nStill, it’s unclear whether Starling will be able to solve practical problems. Some experts think that you need a billion error-corrected logical operations to execute any useful algorithm. Starling represents “an interesting stepping-stone regime,” says Wolfgang Pfaff, a physicist at the University of Illinois Urbana-Champaign. “But it’s unlikely that this will generate economic value.” (Pfaff, who studies quantum computing hardware, has received research funding from IBM but is not involved with Starling.) \nThe timeline for Starling looks feasible, according to Pfaff. The design is “based in experimental and engineering reality,” he says. “They’ve come up with something that looks pretty compelling.” But building a quantum computer is hard, and it’s possible that IBM will encounter delays due to unforeseen technical complications. “This is the first time someone’s doing this,” he says of making a large-scale error-corrected quantum computer.\nIBM’s road map involves first building smaller machines before Starling. This year, it plans to demonstrate that error-corrected information can be stored robustly in a chip called Loon. Next year the company will build Kookaburra, a module that can both store information and perform computations. By the end of 2027, it plans to connect two Kookaburra-type modules together into a larger quantum computer, Cockatoo. After demonstrating that successfully, the next step is to scale up and connect around 100 modules to create Starling.\nThis strategy, says Pfaff, reflects the industry’s recent embrace of “modularity” when scaling up quantum computers—networking multiple modules together to create a larger quantum computer rather than laying out qubits on a single chip, as researchers did in earlier designs. \nIBM is also looking beyond 2029. After Starling, it plans to build another, Blue Jay. (“I like birds,” says Gambetta.) Blue Jay will contain 2000 logical qubits and is expected to be capable of a billion logical operations.",
    "content": "IBM announced detailed plans today to build an error-corrected quantum computer with significantly more computational capability than existing machines by 2028. It hopes to make the computer available to users via the cloud by 2029. \nThe proposed machine, named Starling, will consist of a network of modules, each of which contains a set of chips, housed within a new data center in Poughkeepsie, New York. “We’ve already started building the space,” says Jay Gambetta, vice president of IBM’s quantum initiative.\nIBM claims Starling will be a leap forward in quantum computing. In particular, the company aims for it to be the first large-scale machine to implement error correction. If Starling achieves this, IBM will have solved arguably the biggest technical hurdle facing the industry today to beat competitors including Google, Amazon Web Services, and smaller startups such as Boston-based QuEra and PsiQuantum of Palo Alto, California. \nIBM, along with the rest of the industry, has years of work ahead. But Gambetta thinks it has an edge because it has all the building blocks to build error correction capabilities in a large-scale machine. That means improvements in everything from algorithm development to chip packaging. “We’ve cracked the code for quantum error correction, and now we’ve moved from science to engineering,” he says. \nCorrecting errors in a quantum computer has been an engineering challenge, owing to the unique way the machines crunch numbers. Whereas classical computers encode information in the form of bits, or binary 1 and 0, quantum computers instead use qubits, which can represent “superpositions” of both values at once. IBM builds qubits made of tiny superconducting circuits, kept near absolute zero, in an interconnected layout on chips. Other companies have built qubits out of other materials, including neutral atoms, ions, and photons.\nQuantum computers sometimes commit errors, such as when the hardware operates on one qubit but accidentally also alters a neighboring qubit that should not be involved in the computation. These errors add up over time. Without error correction, quantum computers cannot accurately perform the complex algorithms that are expected to be the source of their scientific or commercial value, such as extremely precise chemistry simulations for discovering new materials and pharmaceutical drugs. \nBut error correction requires significant hardware overhead. Instead of encoding a single unit of information in a single “physical” qubit, error correction algorithms encode a unit of information in a constellation of physical qubits, referred to collectively as a “logical qubit.” \nCurrently, quantum computing researchers are competing to develop the best error correction scheme. Google’s surface code algorithm, while effective at correcting errors, requires on the order of 100 qubits to store a single logical qubit in memory. AWS’s Ocelot quantum computer uses a more efficient error correction scheme that requires nine physical qubits per logical qubit in memory. (The overhead is higher for qubits performing computations for storing data.) IBM’s error correction algorithm, known as a low-density parity check code, will make it possible to use 12 physical qubits per logical qubit in memory, a ratio comparable to AWS’s. \nOne distinguishing characteristic of Starling’s design will be its anticipated ability to diagnose errors, known as decoding, in real time. Decoding involves determining whether a measured signal from the quantum computer corresponds to an error. IBM has developed a decoding algorithm that can be quickly executed by a type of conventional chip known as an FPGA. This work bolsters the “credibility” of IBM’s error correction method, says Neil Gillespie of the UK-based quantum computing startup Riverlane. \nHowever, other error correction schemes and hardware designs aren’t out of the running yet. “It’s still not clear what the winning architecture is going to be,” says Gillespie. \nIBM intends Starling to be able to perform computational tasks beyond the capability of classical computers. Starling will have 200 logical qubits, which will be constructed using the company’s chips. It should be able to perform 100 million logical operations consecutively with accuracy; existing quantum computers can do so for only a few thousand. \nThe system will demonstrate error correction at a much larger scale than anything done before, claims Gambetta. Previous error correction demonstrations, such as those done by Google and Amazon, involve a single logical qubit, built from a single chip. Gambetta calls them “gadget experiments,” saying “They’re small-scale.” \nStill, it’s unclear whether Starling will be able to solve practical problems. Some experts think that you need a billion error-corrected logical operations to execute any useful algorithm. Starling represents “an interesting stepping-stone regime,” says Wolfgang Pfaff, a physicist at the University of Illinois Urbana-Champaign. “But it’s unlikely that this will generate economic value.” (Pfaff, who studies quantum computing hardware, has received research funding from IBM but is not involved with Starling.) \nThe timeline for Starling looks feasible, according to Pfaff. The design is “based in experimental and engineering reality,” he says. “They’ve come up with something that looks pretty compelling.” But building a quantum computer is hard, and it’s possible that IBM will encounter delays due to unforeseen technical complications. “This is the first time someone’s doing this,” he says of making a large-scale error-corrected quantum computer.\nIBM’s road map involves first building smaller machines before Starling. This year, it plans to demonstrate that error-corrected information can be stored robustly in a chip called Loon. Next year the company will build Kookaburra, a module that can both store information and perform computations. By the end of 2027, it plans to connect two Kookaburra-type modules together into a larger quantum computer, Cockatoo. After demonstrating that successfully, the next step is to scale up and connect around 100 modules to create Starling.\nThis strategy, says Pfaff, reflects the industry’s recent embrace of “modularity” when scaling up quantum computers—networking multiple modules together to create a larger quantum computer rather than laying out qubits on a single chip, as researchers did in earlier designs. \nIBM is also looking beyond 2029. After Starling, it plans to build another, Blue Jay. (“I like birds,” says Gambetta.) Blue Jay will contain 2000 logical qubits and is expected to be capable of a billion logical operations."
  },
  {
    "title": "The Pentagon is gutting the team that tests AI and weapons systems",
    "url": "https://www.technologyreview.com/2025/06/10/1118229/pentagon-gutting-ai-test/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Tue, 10 Jun 2025 09:00:00 +0000",
    "published_datetime": "2025-06-10T10:00:00",
    "summary": "The Trump administration’s chainsaw approach to federal spending lives on, even as Elon Musk turns on the president. On May 28, Secretary of Defense Pete Hegseth announced he’d be gutting a key office at the Department of Defense responsible for testing and evaluating the safety of weapons and AI systems.\nAs part of a string of moves aimed at “reducing bloated bureaucracy and wasteful spending in favor of increased lethality,” Hegseth cut the size of the Office of the Director of Operational Test and Evaluation in half. The group was established in the 1980s—following orders from Congress—after criticisms that the Pentagon was fielding weapons and systems that didn’t perform as safely or effectively as advertised. Hegseth is reducing the agency’s staff to about 45, down from 94, and firing and replacing its director. He gave the office just seven days to implement the changes.\nIt is a significant overhaul of a department that in 40 years has never before been placed so squarely on the chopping block. Here’s how today’s defense tech companies, which have fostered close connections to the Trump administration, stand to gain, and why safety testing might suffer as a result. \nThe Operational Test and Evaluation office is “the last gate before a technology gets to the field,” says Missy Cummings, a former fighter pilot for the US Navy who is now a professor of engineering and computer science at George Mason University. Though the military can do small experiments with new systems without running it by the office, it has to test anything that gets fielded at scale.\n“In a bipartisan way—up until now—everybody has seen it’s working to help reduce waste, fraud, and abuse,” she says. That’s because it provides an independent check on companies’ and contractors’ claims about how well their technology works. It also aims to expose the systems to more rigorous safety testing.\nThe gutting comes at a particularly pivotal time for AI and military adoption: The Pentagon is experimenting with putting AI into everything, mainstream companies like OpenAI are now more comfortable working with the military, and defense giants like Anduril are winning big contracts to launch AI systems (last Thursday, Anduril announced a whopping $2.5 billion funding round, doubling its valuation to over $30 billion). \nHegseth claims his cuts will “make testing and fielding weapons more efficient,” saving $300 million. But Cummings is concerned that they are paving a way to faster adoption while increasing the chances that new systems won’t be as safe or effective as promised. “The firings in DOTE send a clear message that all perceived obstacles for companies favored by Trump are going to be removed,” she says.\nAnduril and Anthropic, which have launched AI applications for military use, did not respond to my questions about whether they pushed for or approve of the cuts. A representative for OpenAI said that the company was not involved in lobbying for the restructuring. \n“The cuts make me nervous,” says Mark Cancian, a senior advisor at the Center for Strategic and International Studies who previously worked at the Pentagon in collaboration with the testing office. “It’s not that we’ll go from effective to ineffective, but you might not catch some of the problems that would surface in combat without this testing step.”\nIt’s hard to say precisely how the cuts will affect the office’s ability to test systems, and Cancian admits that those responsible for getting new technologies out onto the battlefield sometimes complain that it can really slow down adoption. But still, he says, the office frequently uncovers errors that weren’t previously caught.\nIt’s an especially important step, Cancian says, whenever the military is adopting a new type of technology like generative AI. Systems that might perform well in a lab setting almost always encounter new challenges in more realistic scenarios, and the Operational Test and Evaluation group is where that rubber meets the road.\nSo what to make of all this? It’s true that the military was experimenting with artificial intelligence long before the current AI boom, particularly with computer vision for drone feeds, and defense tech companies have been winning big contracts for this push across multiple presidential administrations. But this era is different. The Pentagon is announcing ambitious pilots specifically for large language models, a relatively nascent technology that by its very nature produces hallucinations and errors, and it appears eager to put much-hyped AI into everything. The key independent group dedicated to evaluating the accuracy of these new and complex systems now only has half the staff to do it. I’m not sure that’s a win for anyone.\nThis story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first, sign up here.",
    "content": "The Trump administration’s chainsaw approach to federal spending lives on, even as Elon Musk turns on the president. On May 28, Secretary of Defense Pete Hegseth announced he’d be gutting a key office at the Department of Defense responsible for testing and evaluating the safety of weapons and AI systems.\nAs part of a string of moves aimed at “reducing bloated bureaucracy and wasteful spending in favor of increased lethality,” Hegseth cut the size of the Office of the Director of Operational Test and Evaluation in half. The group was established in the 1980s—following orders from Congress—after criticisms that the Pentagon was fielding weapons and systems that didn’t perform as safely or effectively as advertised. Hegseth is reducing the agency’s staff to about 45, down from 94, and firing and replacing its director. He gave the office just seven days to implement the changes.\nIt is a significant overhaul of a department that in 40 years has never before been placed so squarely on the chopping block. Here’s how today’s defense tech companies, which have fostered close connections to the Trump administration, stand to gain, and why safety testing might suffer as a result. \nThe Operational Test and Evaluation office is “the last gate before a technology gets to the field,” says Missy Cummings, a former fighter pilot for the US Navy who is now a professor of engineering and computer science at George Mason University. Though the military can do small experiments with new systems without running it by the office, it has to test anything that gets fielded at scale.\n“In a bipartisan way—up until now—everybody has seen it’s working to help reduce waste, fraud, and abuse,” she says. That’s because it provides an independent check on companies’ and contractors’ claims about how well their technology works. It also aims to expose the systems to more rigorous safety testing.\nThe gutting comes at a particularly pivotal time for AI and military adoption: The Pentagon is experimenting with putting AI into everything, mainstream companies like OpenAI are now more comfortable working with the military, and defense giants like Anduril are winning big contracts to launch AI systems (last Thursday, Anduril announced a whopping $2.5 billion funding round, doubling its valuation to over $30 billion). \nHegseth claims his cuts will “make testing and fielding weapons more efficient,” saving $300 million. But Cummings is concerned that they are paving a way to faster adoption while increasing the chances that new systems won’t be as safe or effective as promised. “The firings in DOTE send a clear message that all perceived obstacles for companies favored by Trump are going to be removed,” she says.\nAnduril and Anthropic, which have launched AI applications for military use, did not respond to my questions about whether they pushed for or approve of the cuts. A representative for OpenAI said that the company was not involved in lobbying for the restructuring. \n“The cuts make me nervous,” says Mark Cancian, a senior advisor at the Center for Strategic and International Studies who previously worked at the Pentagon in collaboration with the testing office. “It’s not that we’ll go from effective to ineffective, but you might not catch some of the problems that would surface in combat without this testing step.”\nIt’s hard to say precisely how the cuts will affect the office’s ability to test systems, and Cancian admits that those responsible for getting new technologies out onto the battlefield sometimes complain that it can really slow down adoption. But still, he says, the office frequently uncovers errors that weren’t previously caught.\nIt’s an especially important step, Cancian says, whenever the military is adopting a new type of technology like generative AI. Systems that might perform well in a lab setting almost always encounter new challenges in more realistic scenarios, and the Operational Test and Evaluation group is where that rubber meets the road.\nSo what to make of all this? It’s true that the military was experimenting with artificial intelligence long before the current AI boom, particularly with computer vision for drone feeds, and defense tech companies have been winning big contracts for this push across multiple presidential administrations. But this era is different. The Pentagon is announcing ambitious pilots specifically for large language models, a relatively nascent technology that by its very nature produces hallucinations and errors, and it appears eager to put much-hyped AI into everything. The key independent group dedicated to evaluating the accuracy of these new and complex systems now only has half the staff to do it. I’m not sure that’s a win for anyone.\nThis story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first, sign up here."
  },
  {
    "title": "The Download: an inspiring toy robot arm, and why AM radio matters",
    "url": "https://www.technologyreview.com/2025/06/09/1118186/the-download-an-inspiring-toy-robot-arm-and-why-am-radio-matters/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Mon, 09 Jun 2025 12:10:00 +0000",
    "published_datetime": "2025-06-09T13:10:00",
    "summary": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nHow a 1980s toy robot arm inspired modern robotics\n—Jon Keegan\nAs a child of an electronic engineer, I spent a lot of time in our local Radio Shack as a kid. While my dad was locating capacitors and resistors, I was in the toy section. It was there, in 1984, that I discovered the best toy of my childhood: the Armatron robotic arm.\nDescribed as a “robot-like arm to aid young masterminds in scientific and laboratory experiments,” it was a legit robotic arm. And the bold look and function of Armatron made quite an impression on many young kids who would one day have a career in robotics. Read the full story.\nIf you’re interested in the future of robots, why not check out:+ Will we ever trust robots? If most robots still need remote human operators to be safe and effective, why should we welcome them into our homes? Read the full story.\n+ When you might start speaking to robots. Google is only the latest to fuse large language models with robots. Here’s why the trend has big implications.+ How AI models let robots carry out tasks in unfamiliar environments. Read the full story.+ China’s EV giants are betting big on humanoid robots. Technical know-how and existing supply chains give Chinese electric-vehicle makers a significant head start in the sector. Read the full story.\n\nWhy we still need AM radio\nThe most reliable way to keep us informed in times of disaster is being threatened. Check out Ariel Aberg-Riger’s beautiful visual story illustrating AM radio’s importance in uncertain times. \nBoth of these stories are from the most recent edition of our print magazine, which is all about how technology is changing creativity. Subscribe now to get future copies before they land.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 Protestors set Waymo robotaxis alight in Los AngelesThe groups clashed with police over the Trump administration’s immigration raids. (LA Times $)+ Much of the technology that fuels deportation orders is error-ridden. (Slate $)+ Immigrants are using a swathe of new apps to stay ahead of deportation. (Rest of World)\n2 What’s next for Elon Musk and Donald TrumpA full breakdown in relations could be much worse for Musk in the long run. (NY Mag $)+ Trump’s backers are rapidly turning on Musk, too. (New Yorker $)+ The biggest winner from their fall out? Jeff Bezos. (The Information $)\n3 DOGE used an inaccurate AI tool to terminate Veteran Affairs contactsIts code frequently produced glaring mistakes. (ProPublica)+ Undeterred, the department is on a hiring spree. (Wired $)+ Can AI help DOGE slash government budgets? It’s complex. (MIT Technology Review)\n4 Europe’s shrinking forests could cause it to miss net-zero targetsIts trees aren’t soaking up as much carbon as they used to. (New Scientist $)+ Inside the controversial tree farms powering Apple’s carbon neutral goal. (MIT Technology Review)\n5 OpenAI wants to embed ChatGPT into college campuses The ultimate goal? A personalized AI account for every student. (NYT $)+ Meanwhile, other universities are experimenting with tech-free classes. (The Atlantic $)+ ChatGPT is going to change education, not destroy it. (MIT Technology Review)\n6 Chinese regulators are pumping the brakes on self-driving carsThey’re developing a new framework to assess the safety of autonomous features. (FT $)+ The country’s robotaxis are rapidly catching up with the west. (Rest of World)+ How China is regulating robotaxis. (MIT Technology Review)\n7 Desalination is finally becoming a realityRemoving salt from seawater is one way to combat water scarcity. (WSJ $)+ If you can make it through tons of plastic, that is. (The Atlantic $)\n8 We’re getting better at fighting cancerDeaths from the disease in the US have dropped by a third since 1991. (Vox)+ Why it’s so hard to use AI to diagnose cancer. (MIT Technology Review)\n9 Teenage TikTokers’ skin regimes offer virtually no benefitAnd could even be potentially harmful. (The Guardian)+ The fight for “Instagram face” (MIT Technology Review)\n10 Tech’s layoff groups are providing much-needed supportWorkers who have been let go by their employers are forming little communities. (Insider $)\n\nQuote of the day\n“Every tech company is doing similar things but we were open about it.”\n—Luis von Ahn, chief executive of the language-learning app Duolingo, tells the Financial Times that his company is far from the only one adopting an AI-first strategy. \n\nOne more thing\n\nHow to break free of Spotify’s algorithmSince the heyday of radio, the branding of sound has evolved from broad genres like rock and hip-hop to “paranormal dark cabaret afternoon” and “synth space,” and streaming has become the default.Meanwhile, the ritual of discovering something new is now neatly packaged in a 30-song playlist. The only rule in music streaming is personalization.What we’ve gained in convenience, we’ve lost in curiosity. But it doesn’t have to be this way. Read the full story.\n—Tiffany Ng\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)\n+ Happy birthday to Michael J Fox, who turns 64 today!+ Whenever you need to play the world’s smallest violin, these scientists can help you out + An early JMW Turner oil painting has been rediscovered.+ Watching robots attempt to kickbox is pretty amusing.",
    "content": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nHow a 1980s toy robot arm inspired modern robotics\n—Jon Keegan\nAs a child of an electronic engineer, I spent a lot of time in our local Radio Shack as a kid. While my dad was locating capacitors and resistors, I was in the toy section. It was there, in 1984, that I discovered the best toy of my childhood: the Armatron robotic arm.\nDescribed as a “robot-like arm to aid young masterminds in scientific and laboratory experiments,” it was a legit robotic arm. And the bold look and function of Armatron made quite an impression on many young kids who would one day have a career in robotics. Read the full story.\nIf you’re interested in the future of robots, why not check out:+ Will we ever trust robots? If most robots still need remote human operators to be safe and effective, why should we welcome them into our homes? Read the full story.\n+ When you might start speaking to robots. Google is only the latest to fuse large language models with robots. Here’s why the trend has big implications.+ How AI models let robots carry out tasks in unfamiliar environments. Read the full story.+ China’s EV giants are betting big on humanoid robots. Technical know-how and existing supply chains give Chinese electric-vehicle makers a significant head start in the sector. Read the full story.\n\nWhy we still need AM radio\nThe most reliable way to keep us informed in times of disaster is being threatened. Check out Ariel Aberg-Riger’s beautiful visual story illustrating AM radio’s importance in uncertain times. \nBoth of these stories are from the most recent edition of our print magazine, which is all about how technology is changing creativity. Subscribe now to get future copies before they land.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 Protestors set Waymo robotaxis alight in Los AngelesThe groups clashed with police over the Trump administration’s immigration raids. (LA Times $)+ Much of the technology that fuels deportation orders is error-ridden. (Slate $)+ Immigrants are using a swathe of new apps to stay ahead of deportation. (Rest of World)\n2 What’s next for Elon Musk and Donald TrumpA full breakdown in relations could be much worse for Musk in the long run. (NY Mag $)+ Trump’s backers are rapidly turning on Musk, too. (New Yorker $)+ The biggest winner from their fall out? Jeff Bezos. (The Information $)\n3 DOGE used an inaccurate AI tool to terminate Veteran Affairs contactsIts code frequently produced glaring mistakes. (ProPublica)+ Undeterred, the department is on a hiring spree. (Wired $)+ Can AI help DOGE slash government budgets? It’s complex. (MIT Technology Review)\n4 Europe’s shrinking forests could cause it to miss net-zero targetsIts trees aren’t soaking up as much carbon as they used to. (New Scientist $)+ Inside the controversial tree farms powering Apple’s carbon neutral goal. (MIT Technology Review)\n5 OpenAI wants to embed ChatGPT into college campuses The ultimate goal? A personalized AI account for every student. (NYT $)+ Meanwhile, other universities are experimenting with tech-free classes. (The Atlantic $)+ ChatGPT is going to change education, not destroy it. (MIT Technology Review)\n6 Chinese regulators are pumping the brakes on self-driving carsThey’re developing a new framework to assess the safety of autonomous features. (FT $)+ The country’s robotaxis are rapidly catching up with the west. (Rest of World)+ How China is regulating robotaxis. (MIT Technology Review)\n7 Desalination is finally becoming a realityRemoving salt from seawater is one way to combat water scarcity. (WSJ $)+ If you can make it through tons of plastic, that is. (The Atlantic $)\n8 We’re getting better at fighting cancerDeaths from the disease in the US have dropped by a third since 1991. (Vox)+ Why it’s so hard to use AI to diagnose cancer. (MIT Technology Review)\n9 Teenage TikTokers’ skin regimes offer virtually no benefitAnd could even be potentially harmful. (The Guardian)+ The fight for “Instagram face” (MIT Technology Review)\n10 Tech’s layoff groups are providing much-needed supportWorkers who have been let go by their employers are forming little communities. (Insider $)\n\nQuote of the day\n“Every tech company is doing similar things but we were open about it.”\n—Luis von Ahn, chief executive of the language-learning app Duolingo, tells the Financial Times that his company is far from the only one adopting an AI-first strategy. \n\nOne more thing\n\nHow to break free of Spotify’s algorithmSince the heyday of radio, the branding of sound has evolved from broad genres like rock and hip-hop to “paranormal dark cabaret afternoon” and “synth space,” and streaming has become the default.Meanwhile, the ritual of discovering something new is now neatly packaged in a 30-song playlist. The only rule in music streaming is personalization.What we’ve gained in convenience, we’ve lost in curiosity. But it doesn’t have to be this way. Read the full story.\n—Tiffany Ng\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)\n+ Happy birthday to Michael J Fox, who turns 64 today!+ Whenever you need to play the world’s smallest violin, these scientists can help you out + An early JMW Turner oil painting has been rediscovered.+ Watching robots attempt to kickbox is pretty amusing."
  },
  {
    "title": "The Download: China’s AI agent boom, and GPS alternatives",
    "url": "https://www.technologyreview.com/2025/06/06/1118044/the-download-chinas-ai-agent-boom-and-gps-alternatives/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Fri, 06 Jun 2025 12:10:00 +0000",
    "published_datetime": "2025-06-06T13:10:00",
    "summary": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nManus has kick-started an AI agent boom in China\nLast year, China saw a boom in foundation models, the do-everything large language models that underpin the AI revolution. This year, the focus has shifted to AI agents—systems that are less about responding to users’ queries and more about autonomously accomplishing things for them.There are now a host of Chinese startups building these general-purpose digital tools, which can answer emails, browse the internet to plan vacations, and even design an interactive website. Many of these have emerged in just the last two months, following in the footsteps of Manus—a general AI agent that sparked weeks of social media frenzy for invite codes after its limited-release launch in early March.As the race to define what a useful AI agent looks like unfolds, a mix of ambitious startups and entrenched tech giants are now testing how these tools might actually work in practice—and for whom. Read the full story.\n—Caiwei Chen\n\nInside the race to find GPS alternatives\nLater this month, an inconspicuous 150-kilogram satellite is set to launch into space aboard the SpaceX Transporter 14 mission. Once in orbit, it will test super-accurate next-generation satnav technology designed to make up for the shortcomings of the US Global Positioning System (GPS).\nDespite the system’s indispensable nature, the GPS signal is easily suppressed or disrupted by everything from space weather to 5G cell towers to phone-size jammers worth a few tens of dollars. The problem has been whispered about among experts for years, but it has really come to the fore in the last three years, since Russia invaded Ukraine.Now, startup Xona Space Systems wants to create a space-based system that would do what GPS does but better. Read the full story.\n—Tereza Pultarova\n\nWhy doctors should look for ways to prescribe hope\n—Jessica Hamzelou\nThis week, I’ve been thinking about the powerful connection between mind and body. Some new research suggests that people with heart conditions have better outcomes when they are more hopeful and optimistic. Hopelessness, on the other hand, is associated with a significantly higher risk of death.\nThe findings build upon decades of fascinating research into the phenomenon of the placebo effect. Our beliefs and expectations about a medicine (or a sham treatment) can change the way it works. The placebo effect’s “evil twin,” the nocebo effect, is just as powerful—negative thinking has been linked to real symptoms.\nResearchers are still trying to understand the connection between body and mind, and how our thoughts can influence our physiology. In the meantime, many are developing ways to harness it in hospital settings. Is it possible for a doctor to prescribe hope? Read the full story.\nThis article first appeared in The Checkup, MIT Technology Review’s weekly biotech newsletter. To receive it in your inbox every Thursday, and read articles like this first, sign up here.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 Elon Musk threatened to cut off NASA’s use of SpaceX’s Dragon spacecraftHis war of words with Donald Trump is dramatically escalating. (WP $)+ If Musk actually carried through with his threat, NASA would seriously struggle. (NYT $)+ Silicon Valley is starting to pick sides. (Wired $)+ It appears as though Musk has more to lose from their bruising breakup. (NY Mag $)\n2 Apple and Alibaba’s AI rollout in China has been delayedIt’s the latest victim of Trump’s trade war. (FT $)+ The deal is supposed to support iPhones’ AI offerings in the country. (Reuters)\n3 X’s new policy blocks the use of its posts to ‘fine-tune or train’ AI modelsUnless companies strike a deal with them, that is. (TechCrunch)+ The platform could end up striking agreements like Reddit and Google. (The Verge)\n4 RJK Jr’s new hire is hunting for proof that vaccines cause autismVaccine skeptic David Geier is seeking access to a database he was previously barred from. (WSJ $)+ How measuring vaccine hesitancy could help health professionals tackle it. (MIT Technology Review)\n5 Anthropic has launched a new service for the militaryClaude Gov is designed specifically for US defense and intelligence agencies. (The Verge)+ Generative AI is learning to spy for the US military. (MIT Technology Review)\n6 There’s no guarantee your billion-dollar startup won’t failIn fact, one in five of them will. (Bloomberg $)+ Beware the rise of the AI coding startup. (Reuters)\n7 Walmart’s drone deliveries are taking offIt’s expanding to 100 new US stories in the next year. (Wired $)\n8 AI might be able to tell us how old the Dead Sea Scrolls really are Models suggest they’re even older than we previously thought. (The Economist $)+ How AI is helping historians better understand our past. (MIT Technology Review)\n9 All-in-one super apps are a hit in the Gulf They’re following in China’s footsteps. (Rest of World)\n10 Nintendo’s Switch 2 has revived the midnight launch eventFans queued for hours outside stores to get their hands on the new console. (Insider $)+ How the company managed to dodge Trump’s tariffs. (The Guardian)\n\nQuote of the day\n“Elon finally found a way to make Twitter fun again.”\n—Dan Pfeiffer, a host of the political podcast Pod Save America, jokes about Elon Musk and Donald Trump’s ongoing feud in a post on X.\n\nOne more thing\n\nThis rare earth metal shows us the future of our planet’s resources\nWe’re in the middle of a potentially transformative moment. Metals discovered barely a century ago now underpin the technologies we’re relying on for cleaner energy, and not having enough of them could slow progress. \nTake neodymium, one of the rare earth metals. It’s used in cryogenic coolers to reach ultra-low temperatures needed for devices like superconductors and in high-powered magnets that power everything from smartphones to wind turbines. And very soon, demand for it could outstrip supply. What happens then? And what does it reveal about issues across wider supply chains? Read our story to find out.\n—Casey Crownhart\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)\n+ Sightings of Bigfoot just happen to correlate with black bear populations? I smell a conspiracy!+ Watch as these symbols magically transform into a pretty impressive Black Sabbath mural.+ Underwater rugby is taking off in the UK.+ Fed up of beige Gen Z trends, TikTok is bringing the 80s back.",
    "content": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nManus has kick-started an AI agent boom in China\nLast year, China saw a boom in foundation models, the do-everything large language models that underpin the AI revolution. This year, the focus has shifted to AI agents—systems that are less about responding to users’ queries and more about autonomously accomplishing things for them.There are now a host of Chinese startups building these general-purpose digital tools, which can answer emails, browse the internet to plan vacations, and even design an interactive website. Many of these have emerged in just the last two months, following in the footsteps of Manus—a general AI agent that sparked weeks of social media frenzy for invite codes after its limited-release launch in early March.As the race to define what a useful AI agent looks like unfolds, a mix of ambitious startups and entrenched tech giants are now testing how these tools might actually work in practice—and for whom. Read the full story.\n—Caiwei Chen\n\nInside the race to find GPS alternatives\nLater this month, an inconspicuous 150-kilogram satellite is set to launch into space aboard the SpaceX Transporter 14 mission. Once in orbit, it will test super-accurate next-generation satnav technology designed to make up for the shortcomings of the US Global Positioning System (GPS).\nDespite the system’s indispensable nature, the GPS signal is easily suppressed or disrupted by everything from space weather to 5G cell towers to phone-size jammers worth a few tens of dollars. The problem has been whispered about among experts for years, but it has really come to the fore in the last three years, since Russia invaded Ukraine.Now, startup Xona Space Systems wants to create a space-based system that would do what GPS does but better. Read the full story.\n—Tereza Pultarova\n\nWhy doctors should look for ways to prescribe hope\n—Jessica Hamzelou\nThis week, I’ve been thinking about the powerful connection between mind and body. Some new research suggests that people with heart conditions have better outcomes when they are more hopeful and optimistic. Hopelessness, on the other hand, is associated with a significantly higher risk of death.\nThe findings build upon decades of fascinating research into the phenomenon of the placebo effect. Our beliefs and expectations about a medicine (or a sham treatment) can change the way it works. The placebo effect’s “evil twin,” the nocebo effect, is just as powerful—negative thinking has been linked to real symptoms.\nResearchers are still trying to understand the connection between body and mind, and how our thoughts can influence our physiology. In the meantime, many are developing ways to harness it in hospital settings. Is it possible for a doctor to prescribe hope? Read the full story.\nThis article first appeared in The Checkup, MIT Technology Review’s weekly biotech newsletter. To receive it in your inbox every Thursday, and read articles like this first, sign up here.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 Elon Musk threatened to cut off NASA’s use of SpaceX’s Dragon spacecraftHis war of words with Donald Trump is dramatically escalating. (WP $)+ If Musk actually carried through with his threat, NASA would seriously struggle. (NYT $)+ Silicon Valley is starting to pick sides. (Wired $)+ It appears as though Musk has more to lose from their bruising breakup. (NY Mag $)\n2 Apple and Alibaba’s AI rollout in China has been delayedIt’s the latest victim of Trump’s trade war. (FT $)+ The deal is supposed to support iPhones’ AI offerings in the country. (Reuters)\n3 X’s new policy blocks the use of its posts to ‘fine-tune or train’ AI modelsUnless companies strike a deal with them, that is. (TechCrunch)+ The platform could end up striking agreements like Reddit and Google. (The Verge)\n4 RJK Jr’s new hire is hunting for proof that vaccines cause autismVaccine skeptic David Geier is seeking access to a database he was previously barred from. (WSJ $)+ How measuring vaccine hesitancy could help health professionals tackle it. (MIT Technology Review)\n5 Anthropic has launched a new service for the militaryClaude Gov is designed specifically for US defense and intelligence agencies. (The Verge)+ Generative AI is learning to spy for the US military. (MIT Technology Review)\n6 There’s no guarantee your billion-dollar startup won’t failIn fact, one in five of them will. (Bloomberg $)+ Beware the rise of the AI coding startup. (Reuters)\n7 Walmart’s drone deliveries are taking offIt’s expanding to 100 new US stories in the next year. (Wired $)\n8 AI might be able to tell us how old the Dead Sea Scrolls really are Models suggest they’re even older than we previously thought. (The Economist $)+ How AI is helping historians better understand our past. (MIT Technology Review)\n9 All-in-one super apps are a hit in the Gulf They’re following in China’s footsteps. (Rest of World)\n10 Nintendo’s Switch 2 has revived the midnight launch eventFans queued for hours outside stores to get their hands on the new console. (Insider $)+ How the company managed to dodge Trump’s tariffs. (The Guardian)\n\nQuote of the day\n“Elon finally found a way to make Twitter fun again.”\n—Dan Pfeiffer, a host of the political podcast Pod Save America, jokes about Elon Musk and Donald Trump’s ongoing feud in a post on X.\n\nOne more thing\n\nThis rare earth metal shows us the future of our planet’s resources\nWe’re in the middle of a potentially transformative moment. Metals discovered barely a century ago now underpin the technologies we’re relying on for cleaner energy, and not having enough of them could slow progress. \nTake neodymium, one of the rare earth metals. It’s used in cryogenic coolers to reach ultra-low temperatures needed for devices like superconductors and in high-powered magnets that power everything from smartphones to wind turbines. And very soon, demand for it could outstrip supply. What happens then? And what does it reveal about issues across wider supply chains? Read our story to find out.\n—Casey Crownhart\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)\n+ Sightings of Bigfoot just happen to correlate with black bear populations? I smell a conspiracy!+ Watch as these symbols magically transform into a pretty impressive Black Sabbath mural.+ Underwater rugby is taking off in the UK.+ Fed up of beige Gen Z trends, TikTok is bringing the 80s back."
  },
  {
    "title": "Why doctors should look for ways to prescribe hope",
    "url": "https://www.technologyreview.com/2025/06/06/1117937/why-doctors-should-look-for-ways-to-prescribe-hope/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Fri, 06 Jun 2025 09:00:00 +0000",
    "published_datetime": "2025-06-06T10:00:00",
    "summary": "This week, I’ve been thinking about the powerful connection between mind and body. Some new research suggests that people with heart conditions have better outcomes when they are more hopeful and optimistic. Hopelessness, on the other hand, is associated with a significantly higher risk of death.\nThe findings build upon decades of fascinating research into the phenomenon of the placebo effect. Our beliefs and expectations about a medicine (or a sham treatment) can change the way it works. The placebo effect’s “evil twin,” the nocebo effect, is just as powerful—negative thinking has been linked to real symptoms.\nResearchers are still trying to understand the connection between body and mind, and how our thoughts can influence our physiology. In the meantime, many are developing ways to harness it in hospital settings. Is it possible for a doctor to prescribe hope?\nAlexander Montasem, a lecturer in psychology at the University of Liverpool, is trying to find an answer to that question. In his latest study, Montasem and his colleagues focused on people with cardiovascular disease.\nThe team reviewed all published research into the link between hope and heart health outcomes in such individuals. Hope is a pretty tricky thing to nail down, but these studies use questionnaires to try to do that. In one popular questionnaire, hope is defined as “a positive motivational state” based on having agency and plans to meet personal goals.\nMontasem’s team found 12 studies that fit the bill. All told, these studies included over 5,000 people. And together, they found that high hopefulness was associated with better health outcomes: less angina, less post-stroke fatigue, a higher quality of life, and a lower risk of death. The team presented its work at the British Cardiovascular Society meeting in Manchester earlier this week.\nWhen I read the results, it immediately got me thinking about the placebo effect. A placebo is a “sham” treatment—an inert substance like a sugar pill or saline injection that does not contain any medicine. And yet hundreds of studies have shown that such treatments can have remarkable effects.\nThey can ease the symptoms of pain, migraine, Parkinson’s disease, depression, anxiety, and a host of other disorders. The way a placebo is delivered can influence its effectiveness, and so can its color, shape, and price. Expensive placebos seem to be more effective. And placebos can even work when people know they are just placebos.\nAnd then there’s the nocebo effect. If you expect to feel worse after taking something, you are much more likely to. The nocebo effect can increase the risk of pain, gastrointestinal symptoms, flu-like symptoms, and more.  \nIt’s obvious our thoughts and beliefs can play an enormous role in our health and well-being. What’s less clear is exactly how it happens. Scientists have made some progress—there’s evidence that a range of brain chemicals, including the body’s own opioids, are involved in both the placebo and nocebo effects. But the exact mechanisms remain something of a mystery.\nIn the meantime, researchers are working on ways to harness the power of positive thinking. There have been long-running debates over whether it is ever ethical for a doctor to deceive patients to make them feel better. But I’m firmly of the belief that doctors have a duty to be honest with their patients.\nA more ethical approach might be to find ways to build patients’ hope, says Montasem. Not by exaggerating the likely benefit of a drug or by sugar-coating a prognosis, but perhaps by helping them work on their goals, agency, and general outlook on life.\nSome early research suggests that this approach can help. Laurie McLouth at the University of Kentucky and her colleagues found that a series of discussions about values, goals, and strategies to achieve those goals improved hope among people being treated for advanced lung cancer.\nMontasem now plans to review all the published work in this area and design a new approach to increasing hope. Any approach might have to be tailored to an individual, he adds. Some people might be more responsive to a more spiritual or religious way of thinking about their lives, for example.\nThese approaches could also be helpful for all of us, even outside clinical settings. I asked Montasem if he had any advice for people who want to have a positive outlook on life more generally. He told me that it’s important to have personal goals, along with a plan to achieve them. His own goals center on advancing his research, helping patients, and spending time with his family. “Materialistic goals aren’t as beneficial for your wellbeing,” he adds.\nSince we spoke, I’ve been thinking over my own goals. I’ve realized that my first is to come up with a list of goals. And I plan to do it soon. “The minute we give up [on pursuing] our goals, we start falling into hopelessness,” he says.\nThis article first appeared in The Checkup, MIT Technology Review’s weekly biotech newsletter. To receive it in your inbox every Thursday, and read articles like this first, sign up here.",
    "content": "This week, I’ve been thinking about the powerful connection between mind and body. Some new research suggests that people with heart conditions have better outcomes when they are more hopeful and optimistic. Hopelessness, on the other hand, is associated with a significantly higher risk of death.\nThe findings build upon decades of fascinating research into the phenomenon of the placebo effect. Our beliefs and expectations about a medicine (or a sham treatment) can change the way it works. The placebo effect’s “evil twin,” the nocebo effect, is just as powerful—negative thinking has been linked to real symptoms.\nResearchers are still trying to understand the connection between body and mind, and how our thoughts can influence our physiology. In the meantime, many are developing ways to harness it in hospital settings. Is it possible for a doctor to prescribe hope?\nAlexander Montasem, a lecturer in psychology at the University of Liverpool, is trying to find an answer to that question. In his latest study, Montasem and his colleagues focused on people with cardiovascular disease.\nThe team reviewed all published research into the link between hope and heart health outcomes in such individuals. Hope is a pretty tricky thing to nail down, but these studies use questionnaires to try to do that. In one popular questionnaire, hope is defined as “a positive motivational state” based on having agency and plans to meet personal goals.\nMontasem’s team found 12 studies that fit the bill. All told, these studies included over 5,000 people. And together, they found that high hopefulness was associated with better health outcomes: less angina, less post-stroke fatigue, a higher quality of life, and a lower risk of death. The team presented its work at the British Cardiovascular Society meeting in Manchester earlier this week.\nWhen I read the results, it immediately got me thinking about the placebo effect. A placebo is a “sham” treatment—an inert substance like a sugar pill or saline injection that does not contain any medicine. And yet hundreds of studies have shown that such treatments can have remarkable effects.\nThey can ease the symptoms of pain, migraine, Parkinson’s disease, depression, anxiety, and a host of other disorders. The way a placebo is delivered can influence its effectiveness, and so can its color, shape, and price. Expensive placebos seem to be more effective. And placebos can even work when people know they are just placebos.\nAnd then there’s the nocebo effect. If you expect to feel worse after taking something, you are much more likely to. The nocebo effect can increase the risk of pain, gastrointestinal symptoms, flu-like symptoms, and more.  \nIt’s obvious our thoughts and beliefs can play an enormous role in our health and well-being. What’s less clear is exactly how it happens. Scientists have made some progress—there’s evidence that a range of brain chemicals, including the body’s own opioids, are involved in both the placebo and nocebo effects. But the exact mechanisms remain something of a mystery.\nIn the meantime, researchers are working on ways to harness the power of positive thinking. There have been long-running debates over whether it is ever ethical for a doctor to deceive patients to make them feel better. But I’m firmly of the belief that doctors have a duty to be honest with their patients.\nA more ethical approach might be to find ways to build patients’ hope, says Montasem. Not by exaggerating the likely benefit of a drug or by sugar-coating a prognosis, but perhaps by helping them work on their goals, agency, and general outlook on life.\nSome early research suggests that this approach can help. Laurie McLouth at the University of Kentucky and her colleagues found that a series of discussions about values, goals, and strategies to achieve those goals improved hope among people being treated for advanced lung cancer.\nMontasem now plans to review all the published work in this area and design a new approach to increasing hope. Any approach might have to be tailored to an individual, he adds. Some people might be more responsive to a more spiritual or religious way of thinking about their lives, for example.\nThese approaches could also be helpful for all of us, even outside clinical settings. I asked Montasem if he had any advice for people who want to have a positive outlook on life more generally. He told me that it’s important to have personal goals, along with a plan to achieve them. His own goals center on advancing his research, helping patients, and spending time with his family. “Materialistic goals aren’t as beneficial for your wellbeing,” he adds.\nSince we spoke, I’ve been thinking over my own goals. I’ve realized that my first is to come up with a list of goals. And I plan to do it soon. “The minute we give up [on pursuing] our goals, we start falling into hopelessness,” he says.\nThis article first appeared in The Checkup, MIT Technology Review’s weekly biotech newsletter. To receive it in your inbox every Thursday, and read articles like this first, sign up here."
  },
  {
    "title": "Inside the race to find GPS alternatives",
    "url": "https://www.technologyreview.com/2025/06/06/1117978/inside-the-race-to-find-gps-alternatives/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Fri, 06 Jun 2025 09:00:00 +0000",
    "published_datetime": "2025-06-06T10:00:00",
    "summary": "Later this month, an inconspicuous 150-kilogram satellite is set to launch into space aboard the SpaceX Transporter 14 mission. Once in orbit, it will test super-accurate next-generation satnav technology designed to make up for the shortcomings of the US Global Positioning System (GPS). \nThe satellite is the first of a planned constellation called Pulsar, which is being developed by California-based Xona Space Systems. The company ultimately plans to have a constellation of 258 satellites in low Earth orbit. Although these satellites will operate much like those used to create GPS, they will orbit about 12,000 miles closer to Earth’s surface, beaming down a much stronger signal that’s more accurate—and harder to jam. \n“Just because of this shorter distance, we will put down signals that will be approximately a hundred times stronger than the GPS signal,” says Tyler Reid, chief technology officer and cofounder of Xona. “That means the reach of jammers will be much smaller against our system, but we will also be able to reach deeper into indoor locations, penetrating through multiple walls.”\nA satnav system for the 21st century\nThe first GPS system went live in 1993. In the decades since, it has become one of the foundational technologies that the world depends on. The precise positioning, navigation, and timing (PNT) signals beamed by its  satellites underpin much more than Google Maps in your phone. They guide drill heads at offshore oil rigs, time-stamp financial transactions, and help sync power grids all over the world.\nBut despite the system’s indispensable nature, the GPS signal is easily suppressed or disrupted by everything from space weather to 5G cell towers to phone-size jammers worth a few tens of dollars. The problem has been whispered about among experts for years, but it has really come to the fore in the last three years, since Russia invaded Ukraine. The boom in drone warfare that came to characterize that war also triggered a race to develop technology for thwarting drone attacks by jamming the GPS signals they need to navigate—or spoofing the signal, creating convincing but fake positioning data. \nThe crucial problem is one of distance: The GPS constellation, which consists of 24 satellites plus a handful of spares, orbits 12,550 miles (20,200 kilometers) above Earth, in a region known as medium Earth orbit. By the time their signals get all the way down to ground-based receivers, they are so faint that they can easily be overridden by jammers.\nOther existing Global Navigation Satellite System constellations, such as Europe’s Galileo, Russia’s GLONASS, and China’s Beidou, have similar architectures and experience the same problems.\nBut when Reid and cofounder Brian Manning founded Xona Space Systems in 2019, they didn’t think about jamming and spoofing. Their goal was to make autonomous driving ready for prime time. \n\nXona Space System’s completed Pulsar-0 satellite is launching this June.AEROSPACELAB\n\n\nDozens of robocars from Uber and Waymo were already cruising American freeways at that time, equipped with expensive suites of sensors like high-resolution cameras and lidar. The engineers figured a more precise satellite navigation system could reduce the need for those sensors, making it possible to create a safe autonomous vehicle affordable enough to go mainstream. One day, cars might even be able to share their positioning data with one another, Reid says. But they knew that GPS was nowhere near accurate enough to keep self-driving cars within the lane lines and away from other objects on the road. That is especially true in densely built-up urban environments that provide many chances for signals to bounce off walls, creating errors.\n“GPS has the superpower of being a ubiquitous system that works the same anywhere in the world,” Reid says. “But it’s a system that was designed primarily to support military missions, virtually to enable them to drop five bombs in the same bowl. But this meter-level accuracy is not enough to guide machines where they need to go and share that physical space with humans safely.”\nReid and Manning began to think about how to build a space-based PNT system that would do what GPS does but better, with accuracy of three inches (10 centimeters) or less and ironclad reliability in all sorts of challenging conditions.\nThe easiest way to do that is to bring the satellites closer to Earth so that data reaches receivers in real time without inaccuracy-causing delays. The stronger signal of satellites in low Earth orbit is more resistant to disruptions of all sorts. \nWhen GPS was conceived, none of that was possible. Constellations in low Earth orbit—altitudes up to 1,200 miles (2,000 km)—require hundreds of satellites to provide constant coverage over the entire globe. For a long time, space technology was too bulky and expensive to make such large constellations viable. Over the past decade, however, smaller electronics and lower launch costs have changed the equation.\n“In 2019, when we started, the ecosystem of low Earth orbit was really exploding,” Reid says. “We could see things like Starlink, OneWeb, and other constellations take off.”\nMatter of urgency\nIn the few years since Xona launched, concerns about GPS’s vulnerability have begun to grow amid rising geopolitical tensions. As a result, finding a reliable replacement has become a matter of strategic importance. \nIn Ukraine especially, GPS jamming and spoofing have become so common that prized US precision munitions such as the High Mobility Artillery Rocket System became effectively blind. Makers of first-person-view drones, which came to symbolize the war, had to refocus on AI-driven autonomous navigation to keep those drones in the game. \nThe problem quickly spilled beyond Ukraine. Countries bordering Russia, such as Finland and Estonia, complained that the increasing prevalence of GPS jamming and spoofing was affecting commercial flights and ships in the region.\nBut Clémence Poirier, a space security researcher at ETH Zurich, says that the problem of GPS disruption isn’t limited to the vicinity of war zones.\n“Basic jammers are very cheap and super easily accessible to everyone online,” Poirier says. “Even with the simplest ones, which can be the size of your phone, you can disrupt GPS signals in [an] area of a hundred or more meters.”\nIn 2013, a truck driver using such a device to conceal his location from his boss accidently disrupted GPS signals around the Newark airport in New Jersey. In 2022, the Dallas Fort Worth International Airport reported a 24-hour GPS outage, which prompted a temporary closure of one of its runways. The source of the interference was never identified. That same year, Denver International Airport experienced a 33-hour GPS disruption. \nRace to securing PNT\n“Xona is a promising solution to enhance the resilience of GPS-dependent critical infrastructures and mitigate the threat of GPS jamming and spoofing,” Poirier says. But, she adds, there is no “magic wand,” and a “variety of different approaches will be needed” to solve the problem.\nAnd indeed, Xona is not the only company hoping to provide a backup for the indispensable yet increasingly vulnerable GPS. Companies such as Anello Photonics, based in Santa Clara, California, and Sydney-based Advanced Navigation are testing terrestrial solutions: inertial navigation devices that are small and affordable enough for use beyond high-end military tech. These systems rely on gyroscopes and accelerometers to deduce a vehicle’s position from its own motions. \nWhen integrated into PNT receivers, these technologies can help detect GPS spoofing and take over for the duration of the interference. Inertial navigation has been around for decades, but recent advances in photonic technologies and microelectromechanical systems have brought it into the mainstream.\nThe French aerospace and defense conglomerate Safran is developing a system that distributes PNT data via  optical-fiber networks, which form the backbone of the global internet infrastructure. But the allure of space remains strong: The ability to reach any place at any time is what turned GPS from an obscure military system into a piece of taken-for-granted infrastructure that most people today can hardly live without.\nAnd Xona could have some space-based competition. Virginia-based TrustPoint is currently raising funds to build its own low-Earth-orbit PNT constellation, and some have proposed that signals from SpaceX’s Starlink could be repurposed to provide PNT services as well.\nXona hopes to secure its spot in the market by designing its signal to be compatible with that of GPS, allowing manufacturers of GPS receivers to easily slot the new constellation into existing tech. \nAlthough it will take at least until 2030 for the entire constellation to be up and running, Reid says Xona’s system will provide a valuable addition to the existing GPS infrastructure as soon as 16 of its satellites are in orbit. \nThe upcoming launch comes three years after a demonstration mission known as Huginn tested the basics of the technology. The new satellite, called Pulsar-0, will be used to see how well the system can resist jamming or spoofing.\nXona plans to launch an additional four spacecraft next year and hopes to have most of the constellation deployed by 2030. \n",
    "content": "Later this month, an inconspicuous 150-kilogram satellite is set to launch into space aboard the SpaceX Transporter 14 mission. Once in orbit, it will test super-accurate next-generation satnav technology designed to make up for the shortcomings of the US Global Positioning System (GPS). \nThe satellite is the first of a planned constellation called Pulsar, which is being developed by California-based Xona Space Systems. The company ultimately plans to have a constellation of 258 satellites in low Earth orbit. Although these satellites will operate much like those used to create GPS, they will orbit about 12,000 miles closer to Earth’s surface, beaming down a much stronger signal that’s more accurate—and harder to jam. \n“Just because of this shorter distance, we will put down signals that will be approximately a hundred times stronger than the GPS signal,” says Tyler Reid, chief technology officer and cofounder of Xona. “That means the reach of jammers will be much smaller against our system, but we will also be able to reach deeper into indoor locations, penetrating through multiple walls.”\nA satnav system for the 21st century\nThe first GPS system went live in 1993. In the decades since, it has become one of the foundational technologies that the world depends on. The precise positioning, navigation, and timing (PNT) signals beamed by its  satellites underpin much more than Google Maps in your phone. They guide drill heads at offshore oil rigs, time-stamp financial transactions, and help sync power grids all over the world.\nBut despite the system’s indispensable nature, the GPS signal is easily suppressed or disrupted by everything from space weather to 5G cell towers to phone-size jammers worth a few tens of dollars. The problem has been whispered about among experts for years, but it has really come to the fore in the last three years, since Russia invaded Ukraine. The boom in drone warfare that came to characterize that war also triggered a race to develop technology for thwarting drone attacks by jamming the GPS signals they need to navigate—or spoofing the signal, creating convincing but fake positioning data. \nThe crucial problem is one of distance: The GPS constellation, which consists of 24 satellites plus a handful of spares, orbits 12,550 miles (20,200 kilometers) above Earth, in a region known as medium Earth orbit. By the time their signals get all the way down to ground-based receivers, they are so faint that they can easily be overridden by jammers.\nOther existing Global Navigation Satellite System constellations, such as Europe’s Galileo, Russia’s GLONASS, and China’s Beidou, have similar architectures and experience the same problems.\nBut when Reid and cofounder Brian Manning founded Xona Space Systems in 2019, they didn’t think about jamming and spoofing. Their goal was to make autonomous driving ready for prime time. \n\nXona Space System’s completed Pulsar-0 satellite is launching this June.AEROSPACELAB\n\n\nDozens of robocars from Uber and Waymo were already cruising American freeways at that time, equipped with expensive suites of sensors like high-resolution cameras and lidar. The engineers figured a more precise satellite navigation system could reduce the need for those sensors, making it possible to create a safe autonomous vehicle affordable enough to go mainstream. One day, cars might even be able to share their positioning data with one another, Reid says. But they knew that GPS was nowhere near accurate enough to keep self-driving cars within the lane lines and away from other objects on the road. That is especially true in densely built-up urban environments that provide many chances for signals to bounce off walls, creating errors.\n“GPS has the superpower of being a ubiquitous system that works the same anywhere in the world,” Reid says. “But it’s a system that was designed primarily to support military missions, virtually to enable them to drop five bombs in the same bowl. But this meter-level accuracy is not enough to guide machines where they need to go and share that physical space with humans safely.”\nReid and Manning began to think about how to build a space-based PNT system that would do what GPS does but better, with accuracy of three inches (10 centimeters) or less and ironclad reliability in all sorts of challenging conditions.\nThe easiest way to do that is to bring the satellites closer to Earth so that data reaches receivers in real time without inaccuracy-causing delays. The stronger signal of satellites in low Earth orbit is more resistant to disruptions of all sorts. \nWhen GPS was conceived, none of that was possible. Constellations in low Earth orbit—altitudes up to 1,200 miles (2,000 km)—require hundreds of satellites to provide constant coverage over the entire globe. For a long time, space technology was too bulky and expensive to make such large constellations viable. Over the past decade, however, smaller electronics and lower launch costs have changed the equation.\n“In 2019, when we started, the ecosystem of low Earth orbit was really exploding,” Reid says. “We could see things like Starlink, OneWeb, and other constellations take off.”\nMatter of urgency\nIn the few years since Xona launched, concerns about GPS’s vulnerability have begun to grow amid rising geopolitical tensions. As a result, finding a reliable replacement has become a matter of strategic importance. \nIn Ukraine especially, GPS jamming and spoofing have become so common that prized US precision munitions such as the High Mobility Artillery Rocket System became effectively blind. Makers of first-person-view drones, which came to symbolize the war, had to refocus on AI-driven autonomous navigation to keep those drones in the game. \nThe problem quickly spilled beyond Ukraine. Countries bordering Russia, such as Finland and Estonia, complained that the increasing prevalence of GPS jamming and spoofing was affecting commercial flights and ships in the region.\nBut Clémence Poirier, a space security researcher at ETH Zurich, says that the problem of GPS disruption isn’t limited to the vicinity of war zones.\n“Basic jammers are very cheap and super easily accessible to everyone online,” Poirier says. “Even with the simplest ones, which can be the size of your phone, you can disrupt GPS signals in [an] area of a hundred or more meters.”\nIn 2013, a truck driver using such a device to conceal his location from his boss accidently disrupted GPS signals around the Newark airport in New Jersey. In 2022, the Dallas Fort Worth International Airport reported a 24-hour GPS outage, which prompted a temporary closure of one of its runways. The source of the interference was never identified. That same year, Denver International Airport experienced a 33-hour GPS disruption. \nRace to securing PNT\n“Xona is a promising solution to enhance the resilience of GPS-dependent critical infrastructures and mitigate the threat of GPS jamming and spoofing,” Poirier says. But, she adds, there is no “magic wand,” and a “variety of different approaches will be needed” to solve the problem.\nAnd indeed, Xona is not the only company hoping to provide a backup for the indispensable yet increasingly vulnerable GPS. Companies such as Anello Photonics, based in Santa Clara, California, and Sydney-based Advanced Navigation are testing terrestrial solutions: inertial navigation devices that are small and affordable enough for use beyond high-end military tech. These systems rely on gyroscopes and accelerometers to deduce a vehicle’s position from its own motions. \nWhen integrated into PNT receivers, these technologies can help detect GPS spoofing and take over for the duration of the interference. Inertial navigation has been around for decades, but recent advances in photonic technologies and microelectromechanical systems have brought it into the mainstream.\nThe French aerospace and defense conglomerate Safran is developing a system that distributes PNT data via  optical-fiber networks, which form the backbone of the global internet infrastructure. But the allure of space remains strong: The ability to reach any place at any time is what turned GPS from an obscure military system into a piece of taken-for-granted infrastructure that most people today can hardly live without.\nAnd Xona could have some space-based competition. Virginia-based TrustPoint is currently raising funds to build its own low-Earth-orbit PNT constellation, and some have proposed that signals from SpaceX’s Starlink could be repurposed to provide PNT services as well.\nXona hopes to secure its spot in the market by designing its signal to be compatible with that of GPS, allowing manufacturers of GPS receivers to easily slot the new constellation into existing tech. \nAlthough it will take at least until 2030 for the entire constellation to be up and running, Reid says Xona’s system will provide a valuable addition to the existing GPS infrastructure as soon as 16 of its satellites are in orbit. \nThe upcoming launch comes three years after a demonstration mission known as Huginn tested the basics of the technology. The new satellite, called Pulsar-0, will be used to see how well the system can resist jamming or spoofing.\nXona plans to launch an additional four spacecraft next year and hopes to have most of the constellation deployed by 2030. \n"
  },
  {
    "title": "Manus has kick-started an AI agent boom in China",
    "url": "https://www.technologyreview.com/2025/06/05/1117958/china-ai-agent-boom/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Thu, 05 Jun 2025 18:45:42 +0000",
    "published_datetime": "2025-06-05T19:45:42",
    "summary": "Last year, China saw a boom in foundation models, the do-everything large language models that underpin the AI revolution. This year, the focus has shifted to AI agents—systems that are less about responding to users’ queries and more about autonomously accomplishing things for them. \nThere are now a host of Chinese startups building these general-purpose digital tools, which can answer emails, browse the internet to plan vacations, and even design an interactive website. Many of these have emerged in just the last two months, following in the footsteps of Manus—a general AI agent that sparked weeks of social media frenzy for invite codes after its limited-release launch in early March. \nThese emerging AI agents aren’t large language models themselves. Instead, they’re built on top of them, using a workflow-based structure designed to get things done. A lot of these systems also introduce a different way of interacting with AI. Rather than just chatting back and forth with users, they are optimized for managing and executing multistep tasks—booking flights, managing schedules, conducting research—by using external tools and remembering instructions. \nChina could take the lead on building these kinds of agents. The country’s tightly integrated app ecosystems, rapid product cycles, and digitally fluent user base could provide a favorable environment for embedding AI into daily life. \nFor now, its leading AI agent startups are focusing their attention on the global market, because the best Western models don’t operate inside China’s firewalls. But that could change soon: Tech giants like ByteDance and Tencent are preparing their own AI agents that could bake automation directly into their native super-apps, pulling data from their vast ecosystem of programs that dominate many aspects of daily life in the country. \nAs the race to define what a useful AI agent looks like unfolds, a mix of ambitious startups and entrenched tech giants are now testing how these tools might actually work in practice—and for whom.\nSet the standard\nIt’s been a whirlwind few months for Manus, which was developed by the startup Butterfly Effect. The company raised $75 million in a funding round led by the US venture capital firm Benchmark, took the product on an ambitious global roadshow, and hired dozens of new employees. \nEven before registration opened to the public in May, Manus had become a reference point for what a broad, consumer‑oriented AI agent should accomplish. Rather than handling narrow chores for businesses, this “general” agent is designed to be able to help with everyday tasks like trip planning, stock comparison, or your kid’s school project. \nUnlike previous AI agents, Manus uses a browser-based sandbox that lets users supervise the agent like an intern, watching in real time as it scrolls through web pages, reads articles, or codes actions. It also proactively asks clarifying questions, supports long-term memory that would serve as context for future tasks.\n“Manus represents a promising product experience for AI agents,” says Ang Li, cofounder and CEO of Simular, a startup based in Palo Alto, California, that’s building AI agents that operate a real computer. “I believe Chinese startups have a huge advantage when it comes to designing consumer products, thanks to cutthroat domestic competition that leads to fast execution and greater attention to product details.”\nIn the case of Manus, the competition is moving fast. Two of the most buzzy follow‑ups, Genspark and Flowith, for example, are already boasting benchmark scores that match or edge past Manus’s. \nGenspark, led by former Baidu executives Eric Jing and Kay Zhu, links many small “super agents” through what it calls multi‑component prompting. The agent can switch among several large language models, accepts both images and text, and carries out tasks from making slide decks to placing phone calls. Whereas Manus relies heavily on Browser Use, a popular open-source product that lets agents operate a web browser in a virtual window like a human, Genspark directly integrates with a wide array of tools and APIs. Launched in April, the company says that it already has over 5 million users and over $36 million in yearly revenue.\nFlowith, the work of a young team that first grabbed public attention in April 2025 at a developer event hosted by the popular social media app Xiaohongshu, takes a different tack. Marketed as an “infinite agent,” it opens on a blank canvas where each question becomes a node on a branching map. Users can backtrack, take new branches, and store results in personal or sharable “knowledge gardens”—a design that feels more like project management software (think Notion) than a typical chat interface. Every inquiry or task builds its own mind-map-like graph, encouraging a more nonlinear and creative interaction with AI. Flowith’s core agent, NEO, runs in the cloud and can perform scheduled tasks like sending emails and compiling files. The founders want the app to be a “knowledge marketbase”, and aims to tap into the social aspect of AI with the aspiration of becoming “the OnlyFans of AI knowledge creators”.\nWhat they also share with Manus is the global ambition. Both Genspark and Flowith have stated that their primary focus is the international market.\nA global address\nStartups like Manus, Genspark, and Flowith—though founded by Chinese entrepreneurs—could blend seamlessly into the global tech scene and compete effectively abroad. Founders, investors, and analysts that MIT Technology Review has spoken to believe Chinese companies are moving fast, executing well, and quickly coming up with new products. \nMoney reinforces the pull to launch overseas. Customers there pay more, and there are plenty to go around. “You can price in USD, and with the exchange rate that’s a sevenfold multiplier,” Manus cofounder Xiao Hong quipped on a podcast. “Even if we’re only operating at 10% power because of cultural differences overseas, we’ll still make more than in China.”\nBut creating the same functionality in China is a challenge. Major US AI companies including OpenAI and Anthropic have opted out of mainland China because of geopolitical risks and challenges with regulatory compliance. Their absence initially created a black market as users resorted to VPNs and third-party mirrors to access tools like ChatGPT and Claude. That vacuum has since been filled by a new wave of Chinese chatbots—DeepSeek, Doubao, Kimi—but the appetite for foreign models hasn’t gone away. \nManus, for example, uses Anthropic’s Claude Sonnet—widely considered the top model for agentic tasks. Manus cofounder Zhang Tao has repeatedly praised Claude’s ability to juggle tools, remember contexts, and hold multi‑round conversations—all crucial for turning chatty software into an effective executive assistant.\nBut the company’s use of Sonnet has made its agent functionally unusable inside China without a VPN. If you open Manus from a mainland IP address, you’ll see a notice explaining that the team is “working on integrating Qwen’s model,” a special local version that is built on top of Alibaba’s open-source model. \nAn engineer overseeing ByteDance’s work on developing an agent, who spoke to MIT Technology Review anonymously to avoid sanction, said that the absence of Claude Sonnet models “limits everything we do in China.” DeepSeek’s open models, he added, still hallucinate too often and lack training on real‑world workflows. Developers we spoke with rank Alibaba’s Qwen series as the best domestic alternative, yet most say that switching to Qwen knocks performance down a notch.\nJiaxin Pei, a postdoctoral researcher at Stanford’s Institute for Human‑Centered AI, thinks that gap will close: “Building agentic capabilities in base LLMs has become a key focus for many LLM builders, and once people realize the value of this, it will only be a matter of time.”\nFor now, Manus is doubling down on audiences it can already serve. In a written response, the company said its “primary focus is overseas expansion,” noting that new offices in San Francisco, Singapore, and Tokyo have opened in the past month.\nA super‑app approach\nAlthough the concept of AI agents is still relatively new, the consumer-facing AI app market in China is already crowded with major tech players. DeepSeek remains the most widely used, while ByteDance’s Doubao and Moonshot’s Kimi have also become household names. However, most of these apps are still optimized for chat and entertainment rather than task execution. This gap in the local market has pushed China’s big tech firms to roll out their own user-facing agents, though early versions remain uneven in quality and rough around the edges. \nByteDance is testing Coze Space, an AI agent based on its own Doubao model family that lets users toggle between “plan” and “execute” modes, so they can either directly guide the agent’s actions or step back and watch it work autonomously. It connects up to 14 popular apps, including GitHub, Notion, and the company’s own Lark office suite. Early reviews say the tool can feel clunky and has a high failure rate, but it clearly aims to match what Manus offers.\nMeanwhile, Zhipu AI has released a free agent called AutoGLM Rumination, built on its proprietary ChatGLM models. Shanghai‑based Minimax has launched Minimax Agent. Both products look almost identical to Manus and demo basic tasks such as building a simple website, planning a trip, making a small Flash game, or running quick data analysis.\nDespite the limited usability of most general AI agents launched within China, big companies have plans to change that. During a May 15 earnings call, Tencent president Liu Zhiping teased an agent that would weave automation directly into China’s most ubiquitous app, WeChat. \nConsidered the original super-app, WeChat already handles messaging, mobile payments, news, and millions of mini‑programs that act like embedded apps. These programs give Tencent, its developer, access to data from millions of services that pervade everyday life in China, an advantage most competitors can only envy.\nHistorically, China’s consumer internet has splintered into competing walled gardens—share a Taobao link in WeChat and it resolves as plaintext, not a preview card. Unlike the more interoperable Western internet, China’s tech giants have long resisted integration with one another, choosing to wage platform war at the expense of a seamless user experience.\nBut the use of mini‑programs has given WeChat unprecedented reach across services that once resisted interoperability, from gym bookings to grocery orders. An agent able to roam that ecosystem could bypass the integration headaches dogging independent startups.\nAlibaba, the e-commerce giant behind the Qwen model series, has been a front-runner in China’s AI race but has been slower to release consumer-facing products. Even though Qwen was the most downloaded open-source model on Hugging Face in 2024, it didn’t power a dedicated chatbot app until early 2025. In March, Alibaba rebranded its cloud storage and search app Quark into an all-in-one AI search tool. By June, Quark had introduced DeepResearch—a new mode that marks its most agent-like effort to date. \nByteDance and Alibaba did not reply to MIT Technology Review’s request for comments.\n“Historically, Chinese tech products tend to pursue the all-in-one, super-app approach, and the latest Chinese AI agents reflect just that,” says Li of Simular, who previously worked at Google DeepMind on lifelong learning agents. “In contrast, AI agents in the US are more focused on serving specific verticals.”\nPei, the researcher at Stanford, says that existing tech giants could have a huge advantage in bringing the vision of general AI agents to life—especially those with built-in integration across services. “The customer-facing AI agent market is still very early, with tons of problems like authentication and liability,” he says. “But companies that already operate across a wide range of services have a natural advantage in deploying agents at scale.”\n",
    "content": "Last year, China saw a boom in foundation models, the do-everything large language models that underpin the AI revolution. This year, the focus has shifted to AI agents—systems that are less about responding to users’ queries and more about autonomously accomplishing things for them. \nThere are now a host of Chinese startups building these general-purpose digital tools, which can answer emails, browse the internet to plan vacations, and even design an interactive website. Many of these have emerged in just the last two months, following in the footsteps of Manus—a general AI agent that sparked weeks of social media frenzy for invite codes after its limited-release launch in early March. \nThese emerging AI agents aren’t large language models themselves. Instead, they’re built on top of them, using a workflow-based structure designed to get things done. A lot of these systems also introduce a different way of interacting with AI. Rather than just chatting back and forth with users, they are optimized for managing and executing multistep tasks—booking flights, managing schedules, conducting research—by using external tools and remembering instructions. \nChina could take the lead on building these kinds of agents. The country’s tightly integrated app ecosystems, rapid product cycles, and digitally fluent user base could provide a favorable environment for embedding AI into daily life. \nFor now, its leading AI agent startups are focusing their attention on the global market, because the best Western models don’t operate inside China’s firewalls. But that could change soon: Tech giants like ByteDance and Tencent are preparing their own AI agents that could bake automation directly into their native super-apps, pulling data from their vast ecosystem of programs that dominate many aspects of daily life in the country. \nAs the race to define what a useful AI agent looks like unfolds, a mix of ambitious startups and entrenched tech giants are now testing how these tools might actually work in practice—and for whom.\nSet the standard\nIt’s been a whirlwind few months for Manus, which was developed by the startup Butterfly Effect. The company raised $75 million in a funding round led by the US venture capital firm Benchmark, took the product on an ambitious global roadshow, and hired dozens of new employees. \nEven before registration opened to the public in May, Manus had become a reference point for what a broad, consumer‑oriented AI agent should accomplish. Rather than handling narrow chores for businesses, this “general” agent is designed to be able to help with everyday tasks like trip planning, stock comparison, or your kid’s school project. \nUnlike previous AI agents, Manus uses a browser-based sandbox that lets users supervise the agent like an intern, watching in real time as it scrolls through web pages, reads articles, or codes actions. It also proactively asks clarifying questions, supports long-term memory that would serve as context for future tasks.\n“Manus represents a promising product experience for AI agents,” says Ang Li, cofounder and CEO of Simular, a startup based in Palo Alto, California, that’s building AI agents that operate a real computer. “I believe Chinese startups have a huge advantage when it comes to designing consumer products, thanks to cutthroat domestic competition that leads to fast execution and greater attention to product details.”\nIn the case of Manus, the competition is moving fast. Two of the most buzzy follow‑ups, Genspark and Flowith, for example, are already boasting benchmark scores that match or edge past Manus’s. \nGenspark, led by former Baidu executives Eric Jing and Kay Zhu, links many small “super agents” through what it calls multi‑component prompting. The agent can switch among several large language models, accepts both images and text, and carries out tasks from making slide decks to placing phone calls. Whereas Manus relies heavily on Browser Use, a popular open-source product that lets agents operate a web browser in a virtual window like a human, Genspark directly integrates with a wide array of tools and APIs. Launched in April, the company says that it already has over 5 million users and over $36 million in yearly revenue.\nFlowith, the work of a young team that first grabbed public attention in April 2025 at a developer event hosted by the popular social media app Xiaohongshu, takes a different tack. Marketed as an “infinite agent,” it opens on a blank canvas where each question becomes a node on a branching map. Users can backtrack, take new branches, and store results in personal or sharable “knowledge gardens”—a design that feels more like project management software (think Notion) than a typical chat interface. Every inquiry or task builds its own mind-map-like graph, encouraging a more nonlinear and creative interaction with AI. Flowith’s core agent, NEO, runs in the cloud and can perform scheduled tasks like sending emails and compiling files. The founders want the app to be a “knowledge marketbase”, and aims to tap into the social aspect of AI with the aspiration of becoming “the OnlyFans of AI knowledge creators”.\nWhat they also share with Manus is the global ambition. Both Genspark and Flowith have stated that their primary focus is the international market.\nA global address\nStartups like Manus, Genspark, and Flowith—though founded by Chinese entrepreneurs—could blend seamlessly into the global tech scene and compete effectively abroad. Founders, investors, and analysts that MIT Technology Review has spoken to believe Chinese companies are moving fast, executing well, and quickly coming up with new products. \nMoney reinforces the pull to launch overseas. Customers there pay more, and there are plenty to go around. “You can price in USD, and with the exchange rate that’s a sevenfold multiplier,” Manus cofounder Xiao Hong quipped on a podcast. “Even if we’re only operating at 10% power because of cultural differences overseas, we’ll still make more than in China.”\nBut creating the same functionality in China is a challenge. Major US AI companies including OpenAI and Anthropic have opted out of mainland China because of geopolitical risks and challenges with regulatory compliance. Their absence initially created a black market as users resorted to VPNs and third-party mirrors to access tools like ChatGPT and Claude. That vacuum has since been filled by a new wave of Chinese chatbots—DeepSeek, Doubao, Kimi—but the appetite for foreign models hasn’t gone away. \nManus, for example, uses Anthropic’s Claude Sonnet—widely considered the top model for agentic tasks. Manus cofounder Zhang Tao has repeatedly praised Claude’s ability to juggle tools, remember contexts, and hold multi‑round conversations—all crucial for turning chatty software into an effective executive assistant.\nBut the company’s use of Sonnet has made its agent functionally unusable inside China without a VPN. If you open Manus from a mainland IP address, you’ll see a notice explaining that the team is “working on integrating Qwen’s model,” a special local version that is built on top of Alibaba’s open-source model. \nAn engineer overseeing ByteDance’s work on developing an agent, who spoke to MIT Technology Review anonymously to avoid sanction, said that the absence of Claude Sonnet models “limits everything we do in China.” DeepSeek’s open models, he added, still hallucinate too often and lack training on real‑world workflows. Developers we spoke with rank Alibaba’s Qwen series as the best domestic alternative, yet most say that switching to Qwen knocks performance down a notch.\nJiaxin Pei, a postdoctoral researcher at Stanford’s Institute for Human‑Centered AI, thinks that gap will close: “Building agentic capabilities in base LLMs has become a key focus for many LLM builders, and once people realize the value of this, it will only be a matter of time.”\nFor now, Manus is doubling down on audiences it can already serve. In a written response, the company said its “primary focus is overseas expansion,” noting that new offices in San Francisco, Singapore, and Tokyo have opened in the past month.\nA super‑app approach\nAlthough the concept of AI agents is still relatively new, the consumer-facing AI app market in China is already crowded with major tech players. DeepSeek remains the most widely used, while ByteDance’s Doubao and Moonshot’s Kimi have also become household names. However, most of these apps are still optimized for chat and entertainment rather than task execution. This gap in the local market has pushed China’s big tech firms to roll out their own user-facing agents, though early versions remain uneven in quality and rough around the edges. \nByteDance is testing Coze Space, an AI agent based on its own Doubao model family that lets users toggle between “plan” and “execute” modes, so they can either directly guide the agent’s actions or step back and watch it work autonomously. It connects up to 14 popular apps, including GitHub, Notion, and the company’s own Lark office suite. Early reviews say the tool can feel clunky and has a high failure rate, but it clearly aims to match what Manus offers.\nMeanwhile, Zhipu AI has released a free agent called AutoGLM Rumination, built on its proprietary ChatGLM models. Shanghai‑based Minimax has launched Minimax Agent. Both products look almost identical to Manus and demo basic tasks such as building a simple website, planning a trip, making a small Flash game, or running quick data analysis.\nDespite the limited usability of most general AI agents launched within China, big companies have plans to change that. During a May 15 earnings call, Tencent president Liu Zhiping teased an agent that would weave automation directly into China’s most ubiquitous app, WeChat. \nConsidered the original super-app, WeChat already handles messaging, mobile payments, news, and millions of mini‑programs that act like embedded apps. These programs give Tencent, its developer, access to data from millions of services that pervade everyday life in China, an advantage most competitors can only envy.\nHistorically, China’s consumer internet has splintered into competing walled gardens—share a Taobao link in WeChat and it resolves as plaintext, not a preview card. Unlike the more interoperable Western internet, China’s tech giants have long resisted integration with one another, choosing to wage platform war at the expense of a seamless user experience.\nBut the use of mini‑programs has given WeChat unprecedented reach across services that once resisted interoperability, from gym bookings to grocery orders. An agent able to roam that ecosystem could bypass the integration headaches dogging independent startups.\nAlibaba, the e-commerce giant behind the Qwen model series, has been a front-runner in China’s AI race but has been slower to release consumer-facing products. Even though Qwen was the most downloaded open-source model on Hugging Face in 2024, it didn’t power a dedicated chatbot app until early 2025. In March, Alibaba rebranded its cloud storage and search app Quark into an all-in-one AI search tool. By June, Quark had introduced DeepResearch—a new mode that marks its most agent-like effort to date. \nByteDance and Alibaba did not reply to MIT Technology Review’s request for comments.\n“Historically, Chinese tech products tend to pursue the all-in-one, super-app approach, and the latest Chinese AI agents reflect just that,” says Li of Simular, who previously worked at Google DeepMind on lifelong learning agents. “In contrast, AI agents in the US are more focused on serving specific verticals.”\nPei, the researcher at Stanford, says that existing tech giants could have a huge advantage in bringing the vision of general AI agents to life—especially those with built-in integration across services. “The customer-facing AI agent market is still very early, with tons of problems like authentication and liability,” he says. “But companies that already operate across a wide range of services have a natural advantage in deploying agents at scale.”\n"
  },
  {
    "title": "The Download: funding a CRISPR embryo startup, and bad news for clean cement",
    "url": "https://www.technologyreview.com/2025/06/05/1117928/the-download-funding-a-crispr-embryo-startup-and-bad-news-for-clean-cement/",
    "source": "MIT Technology Review",
    "category": "technology",
    "published": "Thu, 05 Jun 2025 12:10:00 +0000",
    "published_datetime": "2025-06-05T13:10:00",
    "summary": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nCrypto billionaire Brian Armstrong is ready to invest in CRISPR baby tech\nBrian Armstrong, the billionaire CEO of the cryptocurrency exchange Coinbase, says he’s ready to fund a US startup focused on gene-editing human embryos. If he goes forward, it would be the first major commercial investment in one of medicine’s most fraught ideas.\nIn a post on X June 2, Armstrong announced he was looking for gene-editing scientists and bioinformatics specialists to form a founding team for an “embryo editing” effort targeting an unmet medical need, such as a genetic disease.\nThe announcement from a deep-pocketed backer is a striking shift for a field considered taboo following the 2018 birth of the world’s first genetically edited children in China—a secretive experiment that led to international outrage and prison time for the lead scientist. Read the full story.\n—Antonio Regalado\n\nOver $1 billion in federal funding got slashed for this polluting industry\nThe clean cement industry might be facing the end of the road, before it ever really got rolling. \nLast week, the US Department of Energy announced that it was canceling $3.7 billion in funding for 24 projects related to energy and industry. That included nearly $1.3 billion for cement-related projects.Cement is a massive climate problem, accounting for roughly 7% of global greenhouse-gas emissions. What’s more, it’s a difficult industry to clean up, with huge traditional players and expensive equipment and infrastructure to replace. This funding was supposed to help address those difficulties, by supporting projects on the cusp of commercialization. Now companies will need to fill in the gap left by these cancellations, and it’s a big one. Read the full story.\n—Casey Crownhart\nThis article is from The Spark, MIT Technology Review’s weekly climate newsletter. To receive it in your inbox every Wednesday, sign up here.\n\nMIT Technology Review Narrated: How DeepSeek became a fortune teller for China’s youth\nAI-powered BaZi analysis has become the new oracle for a disillusioned generation seeking answers.\nThis is our latest story to be turned into a MIT Technology Review Narrated podcast, which we’re publishing each week on Spotify and Apple Podcasts. Just navigate to MIT Technology Review Narrated on either platform, and follow us to get all our new content as it’s released.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 Reddit is suing Anthropic Reddit claims the AI company kept accessing its site after claiming it had stopped. (WSJ $)+ Reddit says AI companies should not scrape the web without limitations. (NYT $)+ It claims that other AI giants have played by its rules. (NBC News)2 Inside the rise and rise of deepfake scamsThe best way to protect yourself is to back up and think who (or what) you’re trusting. (Wired $)+ An AI startup made a hyperrealistic deepfake of me that’s so good it’s scary. (MIT Technology Review)\n3 A lawsuit accuses DOGE of exploiting “error-riden” data to fire workersIt claims the department knew its records were inaccurate, but used them to fire 10,000 employees anyway.(Ars Technica)+ Unlike Elon Musk, Russ Vought knows the federal government inside out. (NY Mag $)+ The first wave of DOGE staffers are becoming full-time government workers. (Wired $)+ DOGE’s tech takeover threatens the safety and stability of our critical data. (MIT Technology Review)\n4 Can we make AI behave how we want it to?Looking all the way back to Asimov’s Laws can offer us some clues. (New Yorker $)\n5 Abuse is rife in Taiwan’s semiconductor factoriesWorkers were threatened with deportation and regular 16-hour shifts. (Rest of World)+ The Trump administration is renegotiating chip grants, apparently. (Reuters)6 Amazon wants to use humanoid robots to deliver packagesIt’s planning to test its bipedal machines’ ability to tackle an obstacle course.(The Information $)+ Why the humanoid workforce is running late. (MIT Technology Review)\n7 We don’t know how to archive the digital age properlyHistorians worry that they may lose access to intimate materials. (The Atlantic $)+ The race to save our online lives from a digital dark age. (MIT Technology Review)\n8 Here’s how major AI helpers tackled a rigorous reading testBearing in mind, they all still hallucinated. (WP $)\n9 Christians really love AI slopA major Christian media company is using new tools to spread the word. (404 Media)+ AI-generated garbage will make ads creepier and worse. (Bloomberg $)+ It’s also warping media metrics beyond recognition. (Digiday)\n10 What we can learn from potty-mouthed robots A lot of people swear. Why shouldn’t robots, too? (IEEE Spectrum)\n\nQuote of the day\n“Anthropic bills itself as the white knight of the AI industry. It is anything but.” \n—Reddit takes aim at Anthropic in a legal filing against the AI company, the Verge reports.\n\nOne more thing\n\nMaybe you will be able to live past 122How long can humans live? This is a good time to ask the question. The longevity scene is having a moment, and research suggests that we might be able to push human life spans further, potentially even reversing some signs of aging.Researchers can’t even agree on what the exact mechanisms of aging are and which they should be targeting. Debates continue to rage over how long it’s possible for humans to live—and whether there is a limit at all.But it looks likely that something will be developed in the coming decades that will help us live longer, in better health. Read the full story.\n—Jessica Hamzelou\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)\n+ There’s something so uplifting about this user-generated collection of videos of parks. + I could get on board with living in a cabin in the woods if it was this one. + You should probably let go of that grudge you’re holding onto. + Looking for some seasonal recipe inspo? Look no further.",
    "content": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nCrypto billionaire Brian Armstrong is ready to invest in CRISPR baby tech\nBrian Armstrong, the billionaire CEO of the cryptocurrency exchange Coinbase, says he’s ready to fund a US startup focused on gene-editing human embryos. If he goes forward, it would be the first major commercial investment in one of medicine’s most fraught ideas.\nIn a post on X June 2, Armstrong announced he was looking for gene-editing scientists and bioinformatics specialists to form a founding team for an “embryo editing” effort targeting an unmet medical need, such as a genetic disease.\nThe announcement from a deep-pocketed backer is a striking shift for a field considered taboo following the 2018 birth of the world’s first genetically edited children in China—a secretive experiment that led to international outrage and prison time for the lead scientist. Read the full story.\n—Antonio Regalado\n\nOver $1 billion in federal funding got slashed for this polluting industry\nThe clean cement industry might be facing the end of the road, before it ever really got rolling. \nLast week, the US Department of Energy announced that it was canceling $3.7 billion in funding for 24 projects related to energy and industry. That included nearly $1.3 billion for cement-related projects.Cement is a massive climate problem, accounting for roughly 7% of global greenhouse-gas emissions. What’s more, it’s a difficult industry to clean up, with huge traditional players and expensive equipment and infrastructure to replace. This funding was supposed to help address those difficulties, by supporting projects on the cusp of commercialization. Now companies will need to fill in the gap left by these cancellations, and it’s a big one. Read the full story.\n—Casey Crownhart\nThis article is from The Spark, MIT Technology Review’s weekly climate newsletter. To receive it in your inbox every Wednesday, sign up here.\n\nMIT Technology Review Narrated: How DeepSeek became a fortune teller for China’s youth\nAI-powered BaZi analysis has become the new oracle for a disillusioned generation seeking answers.\nThis is our latest story to be turned into a MIT Technology Review Narrated podcast, which we’re publishing each week on Spotify and Apple Podcasts. Just navigate to MIT Technology Review Narrated on either platform, and follow us to get all our new content as it’s released.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 Reddit is suing Anthropic Reddit claims the AI company kept accessing its site after claiming it had stopped. (WSJ $)+ Reddit says AI companies should not scrape the web without limitations. (NYT $)+ It claims that other AI giants have played by its rules. (NBC News)2 Inside the rise and rise of deepfake scamsThe best way to protect yourself is to back up and think who (or what) you’re trusting. (Wired $)+ An AI startup made a hyperrealistic deepfake of me that’s so good it’s scary. (MIT Technology Review)\n3 A lawsuit accuses DOGE of exploiting “error-riden” data to fire workersIt claims the department knew its records were inaccurate, but used them to fire 10,000 employees anyway.(Ars Technica)+ Unlike Elon Musk, Russ Vought knows the federal government inside out. (NY Mag $)+ The first wave of DOGE staffers are becoming full-time government workers. (Wired $)+ DOGE’s tech takeover threatens the safety and stability of our critical data. (MIT Technology Review)\n4 Can we make AI behave how we want it to?Looking all the way back to Asimov’s Laws can offer us some clues. (New Yorker $)\n5 Abuse is rife in Taiwan’s semiconductor factoriesWorkers were threatened with deportation and regular 16-hour shifts. (Rest of World)+ The Trump administration is renegotiating chip grants, apparently. (Reuters)6 Amazon wants to use humanoid robots to deliver packagesIt’s planning to test its bipedal machines’ ability to tackle an obstacle course.(The Information $)+ Why the humanoid workforce is running late. (MIT Technology Review)\n7 We don’t know how to archive the digital age properlyHistorians worry that they may lose access to intimate materials. (The Atlantic $)+ The race to save our online lives from a digital dark age. (MIT Technology Review)\n8 Here’s how major AI helpers tackled a rigorous reading testBearing in mind, they all still hallucinated. (WP $)\n9 Christians really love AI slopA major Christian media company is using new tools to spread the word. (404 Media)+ AI-generated garbage will make ads creepier and worse. (Bloomberg $)+ It’s also warping media metrics beyond recognition. (Digiday)\n10 What we can learn from potty-mouthed robots A lot of people swear. Why shouldn’t robots, too? (IEEE Spectrum)\n\nQuote of the day\n“Anthropic bills itself as the white knight of the AI industry. It is anything but.” \n—Reddit takes aim at Anthropic in a legal filing against the AI company, the Verge reports.\n\nOne more thing\n\nMaybe you will be able to live past 122How long can humans live? This is a good time to ask the question. The longevity scene is having a moment, and research suggests that we might be able to push human life spans further, potentially even reversing some signs of aging.Researchers can’t even agree on what the exact mechanisms of aging are and which they should be targeting. Debates continue to rage over how long it’s possible for humans to live—and whether there is a limit at all.But it looks likely that something will be developed in the coming decades that will help us live longer, in better health. Read the full story.\n—Jessica Hamzelou\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)\n+ There’s something so uplifting about this user-generated collection of videos of parks. + I could get on board with living in a cabin in the woods if it was this one. + You should probably let go of that grudge you’re holding onto. + Looking for some seasonal recipe inspo? Look no further."
  }
]