[
  {
    "title": "Craig Federighi confirms Apple’s first attempt at an AI Siri wasn’t good enough",
    "url": "https://www.theverge.com/news/685106/apple-ai-siri-delay-craig-federighi-greg-joswiak-wwdc-2025",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-06-10T19:47:26-04:00",
    "published_datetime": "2025-06-11T00:47:26",
    "summary": "\n\n\n\nIn March, Apple delayed its upgraded Siri, saying that “it’s going to take us longer than we thought to deliver” the promised features. At WWDC this week, Apple’s SVP of software Craig Federighi and SVP of worldwide marketing Greg Joswiak shared more details about the decision to delay in an interview with The Wall Street Journal’s Joanna Stern.\nAs part of its initial Apple Intelligence announcements at WWDC 2024, Apple said that the improved Siri would have awareness of your personal context and the ability to take actions for you in apps. While Apple was showing real software at that show, Siri “didn’t converge in the way, quality-wise, that we needed it to,” Federighi said. Apple wanted it to be “really, really reliable. And we weren’t able to achieve the reliability in the time we thought.”\n“Look, we don’t want to disappoint customers,” Joswiak said. “We never do. But it would’ve been more disappointing to ship something that didn’t hit our quality standard, that had an error rate that we felt was unacceptable. So we made what we thought was the best decision. I’d make it again.”\nStern asked why Apple, with all of its resources, couldn’t make it work. “When it comes to automating capabilities on devices in a reliable way, no one’s doing it really well right now,” Federighi said. “We wanted to be the first. We wanted to do it best.” While the company had “very promising early results and working initial versions,” the team came to feel that “this just doesn’t work reliably enough to be an Apple product,” he said.\nAt WWDC, Federighi also spoke to YouTuber iJustine, and both Federighi and Joswiak were interviewed by Tom’s Guide’s Mark Spoonauer and TechRadar’s Lance Ulanoff. In Apple’s March statement, it said that anticipated rolling out the Siri upgrades “in the coming year,” which, to Spoonauer, Joswiak clarified to mean 2026.",
    "content": "\n\n\n\nIn March, Apple delayed its upgraded Siri, saying that “it’s going to take us longer than we thought to deliver” the promised features. At WWDC this week, Apple’s SVP of software Craig Federighi and SVP of worldwide marketing Greg Joswiak shared more details about the decision to delay in an interview with The Wall Street Journal’s Joanna Stern.\nAs part of its initial Apple Intelligence announcements at WWDC 2024, Apple said that the improved Siri would have awareness of your personal context and the ability to take actions for you in apps. While Apple was showing real software at that show, Siri “didn’t converge in the way, quality-wise, that we needed it to,” Federighi said. Apple wanted it to be “really, really reliable. And we weren’t able to achieve the reliability in the time we thought.”\n“Look, we don’t want to disappoint customers,” Joswiak said. “We never do. But it would’ve been more disappointing to ship something that didn’t hit our quality standard, that had an error rate that we felt was unacceptable. So we made what we thought was the best decision. I’d make it again.”\nStern asked why Apple, with all of its resources, couldn’t make it work. “When it comes to automating capabilities on devices in a reliable way, no one’s doing it really well right now,” Federighi said. “We wanted to be the first. We wanted to do it best.” While the company had “very promising early results and working initial versions,” the team came to feel that “this just doesn’t work reliably enough to be an Apple product,” he said.\nAt WWDC, Federighi also spoke to YouTuber iJustine, and both Federighi and Joswiak were interviewed by Tom’s Guide’s Mark Spoonauer and TechRadar’s Lance Ulanoff. In Apple’s March statement, it said that anticipated rolling out the Siri upgrades “in the coming year,” which, to Spoonauer, Joswiak clarified to mean 2026."
  },
  {
    "title": "ChatGPT’s daylong outage is nearly fixed",
    "url": "https://www.theverge.com/news/684141/openai-chatgpt-sora-outage-issues-june-2025",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-06-10T19:41:41-04:00",
    "published_datetime": "2025-06-11T00:41:41",
    "summary": "\n\n\n\nOpenAI’s ChatGPT service was down all day for many users after the platform started experiencing performance issues on Tuesday morning. The chatbot responded with a “Hmm…something seems to have gone wrong” error message to my colleague after failing to load, and users across X and Reddit are reporting platform outages.\nDowndetector showed that issues started at around 3AM ET, with multiple regions impacted globally. OpenAI’s own status page said that some users started experiencing “elevated error rates and latency” at that time, noting that the issues were affecting ChatGPT, its Sora text-to-video AI tool, and OpenAI APIs.  OpenAI added a separate line for “elevated error rates on Sora” at 5:23AM ET, and later updated the status for both to “partial outage.”\nAs of 6:32PM ET, OpenAI’s tracker reported a “full recovery in the API,” and that “Nearly all ChatGPT components are now working properly for all users.” The one spot of trouble, however, is voice mode, which still has elevated error rates.\nSome users were able to access ChatGPT, but found that the service was sluggish and taking much longer than usual to respond. Others, like myself, were able to use the chatbot without any issues, so the outages and errors didn’t seem to impact everyone.\nPerplexity, the AI search engine service that utilizes some OpenAI models, also reported experiencing outages and reporting “slowness and elevated error rates” on its status page. Perplexity’s issues started at around 7AM ET, according to Downdetector.\nUpdate, June 10th: Noted OpenAI and Perplexity’s status updates.",
    "content": "\n\n\n\nOpenAI’s ChatGPT service was down all day for many users after the platform started experiencing performance issues on Tuesday morning. The chatbot responded with a “Hmm…something seems to have gone wrong” error message to my colleague after failing to load, and users across X and Reddit are reporting platform outages.\nDowndetector showed that issues started at around 3AM ET, with multiple regions impacted globally. OpenAI’s own status page said that some users started experiencing “elevated error rates and latency” at that time, noting that the issues were affecting ChatGPT, its Sora text-to-video AI tool, and OpenAI APIs.  OpenAI added a separate line for “elevated error rates on Sora” at 5:23AM ET, and later updated the status for both to “partial outage.”\nAs of 6:32PM ET, OpenAI’s tracker reported a “full recovery in the API,” and that “Nearly all ChatGPT components are now working properly for all users.” The one spot of trouble, however, is voice mode, which still has elevated error rates.\nSome users were able to access ChatGPT, but found that the service was sluggish and taking much longer than usual to respond. Others, like myself, were able to use the chatbot without any issues, so the outages and errors didn’t seem to impact everyone.\nPerplexity, the AI search engine service that utilizes some OpenAI models, also reported experiencing outages and reporting “slowness and elevated error rates” on its status page. Perplexity’s issues started at around 7AM ET, according to Downdetector.\nUpdate, June 10th: Noted OpenAI and Perplexity’s status updates."
  },
  {
    "title": "The best smart rings for tracking sleep and health",
    "url": "https://www.theverge.com/tech/647901/best-smart-rings",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-06-10T19:40:00-04:00",
    "published_datetime": "2025-06-11T00:40:00",
    "summary": "\n\n\n\nSo, you’re thinking of buying a smart ring. Well, some good news. Picking the best of the lot is incredibly easy right now. The “bad” news is that, as far as trustworthiness and reliability, your choices are somewhat limited, as this is still a niche and emerging gadget category.\nSmart rings are in the middle of a resurgence. That means a lot of experimental ideas and newcomer tech brands you’ve probably never heard of. Enough competitors have cropped up that I spent the better part of last summer rocking six rings like a high-tech mafia don. While these aren’t necessarily bad products (some are pretty good), many aren’t as polished as what you’d see in more mature categories like smartwatches, headphones, and smartphones. \nSpeaking of which, there are a few things to know about the category. Currently, these devices are primarily health trackers. Their benefit is they’re more discreet and are better suited to sleep tracking than a smartwatch. However, the vast majority don’t include smart alarms or push notifications. This makes them best suited to casual athletes or more wellness-minded people. Hardcore athletes would be better served in most cases by a smartwatch or fitness tracker, with a smart ring as a supplementary source of data. (But that’s quite an expensive endeavor.) Smart rings are also ill-suited for weightlifters, as they can easily scratch against equipment. \nWith that in mind, here’s the best smart ring for most people in 2025 — and a handful of runners-up worth highlighting for the more tech-adventurous.\n\n\nHow we test smart rings\nSmart rings are meant to be a stylish and discreet alternative to traditional fitness trackers. That requires a combination of experiential testing and benchmarks. We wear them daily for weeks to see how well they accommodate bloated fingers and temperature changes. We don’t take them off in the shower or to wash dishes to test waterproofing. And we compare them to a smartwatch, the Oura Ring, and a smart bed to gauge sleep and health tracking accuracy. Other factors we consider are size ranges, sizing kits, app design, syncing times, and, of course, battery life.\n\n\nSizing\nYour fingers will bloat. How accommodating is the design? What’s the size range offered? (Some of us have tiny fingers!) How easy is it to return?\n\n\nDesign\nMany people want a smart ring to double as a piece of jewelry. Is it comfortable to wear 24 / 7? Is the design versatile for all sorts of events? Will you get compliments for wearing it?\n\n\nDurability\nDoes the finish scuff? Will you see visible scratches if you wear other rings alongside it?\n\n\nCharging and battery\nRings are easy to lose. Does it have a charging case or does it use a charging dock that a cat can easily knock off your nightstand? Sleep tracking is one of the most popular use cases for a smart ring, and for that you need good battery life. How much do you get on a single charge?\n\n\nApp\nMany smart ring companies are newcomers. The hardware can be nice, but it means nothing if the app is a nightmare. How easy is the ring to update and sync? Does it sync with larger platforms like Apple Health or Google Health Connect? \n\n\nBest smart ring for most people\nSurprising no one, it’s the Oura Ring 4. \nI can already hear some of you shouting, “But what about the subscription!” And I agree. Even Oura’s relatively affordable $6 monthly fee can feel more like $100 when you consider the sheer number of apps, gadgets, and services asking for a chunk of your monthly paycheck. However, Oura is still the best in terms of hardware, size range, features offered, app, dedication to research, and experience in the field. Many of the smart rings available today follow the example Oura set this past decade. \nThe upgrades from the Oura Ring Gen 3 to the Oura Ring 4 were mostly software-based, with minor hardware refinements. You can read more in my review, but the gist is a more accurate heart rate and blood oxygen algorithm, improved automatic activity detection, and an expanded range that spans size 4 to 15. The app has been redesigned to be less cluttered, and in the last few weeks, Oura added AI-powered meal logging and glucose tracking, the latter of which requires Oura users to purchase a Dexcom Stelo CGM ($99). It also recently launched an AI chatbot. (Of the AI chatbots in health trackers I’ve tested, this one is among the more polished implementations — though it often feels like Captain Obvious-level insights.) \nI’ve been long-term testing three iterations of the Oura Ring since 2018. Accuracy, design, and comfort have improved with each generation. The company continues to frequently and clearly communicate research and scientific developments. Third-party retail options have expanded, and I’ve seen investment pour into Oura. In an emerging category, these things matter. A lot. While I believe some of Oura’s newer competitors do some things better or have more creative ideas, Oura is the one I continually recommend for its combination of reliability, accuracy, and experience.\nRead my full Oura Ring 4 review.\nHonorable mentions\nIf subscriptions are an absolute dealbreaker, you’ll find zero protest here. In that case, here are the best alternatives to the Oura Ring. \nThe $400 Samsung Galaxy Ring nails the hardware. Its charging case is more elegant than the Oura Ring’s, and I prefer the slightly concave design for comfort. It also has the second widest size range. If you’re already all-in on a Samsung Galaxy Watch 7 or Ultra, you get the added benefit of extended battery life. If you have the latest Galaxy Z Flip 6 or Z Fold 6, Samsung also has gesture controls for the ring so you can control the camera.\nThere are a lot of interesting ecosystem-centric ideas that Samsung has for its Galaxy Ring, but while there’s no subscription, it’ll cost you a pretty penny to unlock the ring’s full potential. Without discounts, we’re talking about $1,800 to nearly $3,000 for the phone, watch, and ring. The Galaxy Ring is also a first-gen device with some first-gen quirks, too. Samsung is still catching up with sleep tracking accuracy, and its Galaxy AI-powered health features are rather hit or miss.\nI’m also keen on the $350 Ultrahuman Ring Air. It gave the Oura Ring an honest run for its money when I tested six smart rings at once last year. It’s not quite as good with accuracy, but it’s on par with comfort and design. The app has much more of a fitness focus than wellness. Instead of a subscription, it has “Power Plugs.” You can think of them as add-on features. Some are free, like smart alarms and cycle tracking. Others will come with an additional fee, like a planned atrial fibrillation detection Power Plug and a cardio adaptability metric, which costs $2.90 a month.\nLastly, I’ve been testing the RingConn Gen 2 Air, a slimmer, entry-level version of its Gen 2 ring. At $200, it’s the most affordable smart ring I’ve tested but looks and feels a lot nicer than the original RingConn I tested last summer. I had issues with the RingConn’s squarish shape, but it’s much less noticeable this time around and more comfortable. It’s broadly accurate, and the app goes heavy on AI, to middling effect. It has great battery life. I’ve gotten around eight to nine days on a single charge — far better than any other smart ring I’ve tested. \nUpdate, June 10th: Updated to reflect current pricing / availability and add several related links.",
    "content": "\n\n\n\nSo, you’re thinking of buying a smart ring. Well, some good news. Picking the best of the lot is incredibly easy right now. The “bad” news is that, as far as trustworthiness and reliability, your choices are somewhat limited, as this is still a niche and emerging gadget category.\nSmart rings are in the middle of a resurgence. That means a lot of experimental ideas and newcomer tech brands you’ve probably never heard of. Enough competitors have cropped up that I spent the better part of last summer rocking six rings like a high-tech mafia don. While these aren’t necessarily bad products (some are pretty good), many aren’t as polished as what you’d see in more mature categories like smartwatches, headphones, and smartphones. \nSpeaking of which, there are a few things to know about the category. Currently, these devices are primarily health trackers. Their benefit is they’re more discreet and are better suited to sleep tracking than a smartwatch. However, the vast majority don’t include smart alarms or push notifications. This makes them best suited to casual athletes or more wellness-minded people. Hardcore athletes would be better served in most cases by a smartwatch or fitness tracker, with a smart ring as a supplementary source of data. (But that’s quite an expensive endeavor.) Smart rings are also ill-suited for weightlifters, as they can easily scratch against equipment. \nWith that in mind, here’s the best smart ring for most people in 2025 — and a handful of runners-up worth highlighting for the more tech-adventurous.\n\n\nHow we test smart rings\nSmart rings are meant to be a stylish and discreet alternative to traditional fitness trackers. That requires a combination of experiential testing and benchmarks. We wear them daily for weeks to see how well they accommodate bloated fingers and temperature changes. We don’t take them off in the shower or to wash dishes to test waterproofing. And we compare them to a smartwatch, the Oura Ring, and a smart bed to gauge sleep and health tracking accuracy. Other factors we consider are size ranges, sizing kits, app design, syncing times, and, of course, battery life.\n\n\nSizing\nYour fingers will bloat. How accommodating is the design? What’s the size range offered? (Some of us have tiny fingers!) How easy is it to return?\n\n\nDesign\nMany people want a smart ring to double as a piece of jewelry. Is it comfortable to wear 24 / 7? Is the design versatile for all sorts of events? Will you get compliments for wearing it?\n\n\nDurability\nDoes the finish scuff? Will you see visible scratches if you wear other rings alongside it?\n\n\nCharging and battery\nRings are easy to lose. Does it have a charging case or does it use a charging dock that a cat can easily knock off your nightstand? Sleep tracking is one of the most popular use cases for a smart ring, and for that you need good battery life. How much do you get on a single charge?\n\n\nApp\nMany smart ring companies are newcomers. The hardware can be nice, but it means nothing if the app is a nightmare. How easy is the ring to update and sync? Does it sync with larger platforms like Apple Health or Google Health Connect? \n\n\nBest smart ring for most people\nSurprising no one, it’s the Oura Ring 4. \nI can already hear some of you shouting, “But what about the subscription!” And I agree. Even Oura’s relatively affordable $6 monthly fee can feel more like $100 when you consider the sheer number of apps, gadgets, and services asking for a chunk of your monthly paycheck. However, Oura is still the best in terms of hardware, size range, features offered, app, dedication to research, and experience in the field. Many of the smart rings available today follow the example Oura set this past decade. \nThe upgrades from the Oura Ring Gen 3 to the Oura Ring 4 were mostly software-based, with minor hardware refinements. You can read more in my review, but the gist is a more accurate heart rate and blood oxygen algorithm, improved automatic activity detection, and an expanded range that spans size 4 to 15. The app has been redesigned to be less cluttered, and in the last few weeks, Oura added AI-powered meal logging and glucose tracking, the latter of which requires Oura users to purchase a Dexcom Stelo CGM ($99). It also recently launched an AI chatbot. (Of the AI chatbots in health trackers I’ve tested, this one is among the more polished implementations — though it often feels like Captain Obvious-level insights.) \nI’ve been long-term testing three iterations of the Oura Ring since 2018. Accuracy, design, and comfort have improved with each generation. The company continues to frequently and clearly communicate research and scientific developments. Third-party retail options have expanded, and I’ve seen investment pour into Oura. In an emerging category, these things matter. A lot. While I believe some of Oura’s newer competitors do some things better or have more creative ideas, Oura is the one I continually recommend for its combination of reliability, accuracy, and experience.\nRead my full Oura Ring 4 review.\nHonorable mentions\nIf subscriptions are an absolute dealbreaker, you’ll find zero protest here. In that case, here are the best alternatives to the Oura Ring. \nThe $400 Samsung Galaxy Ring nails the hardware. Its charging case is more elegant than the Oura Ring’s, and I prefer the slightly concave design for comfort. It also has the second widest size range. If you’re already all-in on a Samsung Galaxy Watch 7 or Ultra, you get the added benefit of extended battery life. If you have the latest Galaxy Z Flip 6 or Z Fold 6, Samsung also has gesture controls for the ring so you can control the camera.\nThere are a lot of interesting ecosystem-centric ideas that Samsung has for its Galaxy Ring, but while there’s no subscription, it’ll cost you a pretty penny to unlock the ring’s full potential. Without discounts, we’re talking about $1,800 to nearly $3,000 for the phone, watch, and ring. The Galaxy Ring is also a first-gen device with some first-gen quirks, too. Samsung is still catching up with sleep tracking accuracy, and its Galaxy AI-powered health features are rather hit or miss.\nI’m also keen on the $350 Ultrahuman Ring Air. It gave the Oura Ring an honest run for its money when I tested six smart rings at once last year. It’s not quite as good with accuracy, but it’s on par with comfort and design. The app has much more of a fitness focus than wellness. Instead of a subscription, it has “Power Plugs.” You can think of them as add-on features. Some are free, like smart alarms and cycle tracking. Others will come with an additional fee, like a planned atrial fibrillation detection Power Plug and a cardio adaptability metric, which costs $2.90 a month.\nLastly, I’ve been testing the RingConn Gen 2 Air, a slimmer, entry-level version of its Gen 2 ring. At $200, it’s the most affordable smart ring I’ve tested but looks and feels a lot nicer than the original RingConn I tested last summer. I had issues with the RingConn’s squarish shape, but it’s much less noticeable this time around and more comfortable. It’s broadly accurate, and the app goes heavy on AI, to middling effect. It has great battery life. I’ve gotten around eight to nine days on a single charge — far better than any other smart ring I’ve tested. \nUpdate, June 10th: Updated to reflect current pricing / availability and add several related links."
  },
  {
    "title": "Hands on with macOS Tahoe 26: Liquid Glass, new theme options, and Spotlight",
    "url": "https://www.theverge.com/apple/685052/apple-macos-tahoe-26-beta-hands-on-liquid-glass-themes-spotlight",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-06-10T19:33:37-04:00",
    "published_datetime": "2025-06-11T00:33:37",
    "summary": "\n\nSpotlight and themes are in the limelight. | Screenshot: Antonio G. Di Benedetto / The Verge\n\nAt WWDC, Apple announced its new Liquid Glass design language, which is coming to all of its devices, including Macs. I've been tinkering with the macOS Tahoe 26 developer beta on the M4 MacBook Air for about a day. So far, the aesthetic changes range from slick to slightly overwrought, but the new Spotlight search features are nifty and useful. \nThere are new touches of glassy transparency all over macOS 26, including the Dock, Finder, widgets, and built-in apps. It's more subtle than on the iPhone, mostly because the Mac's much larger screen real estate makes the Liquid Glass elements more like accents than whatever this mess is supposed to be. I'm not very fond of it just yet, but maybe it will grow on me, like UI changes tend to.\n\nThe Dock now has a frosted background that's more translucent than Sequoia's flatter design. The hazy, frozen glass aesthetic also extends to widgets, like the calendar and weather, and drop-down menus - though the latter have much higher opacity. The pop-ups for volume and brightness now use this distorted glass look as well, though they've moved to the top-right corner of the screen instead of being centered above the dock. Frankly, they're ugly,  …\nRead the full story at The Verge.",
    "content": "\n\nSpotlight and themes are in the limelight. | Screenshot: Antonio G. Di Benedetto / The Verge\n\nAt WWDC, Apple announced its new Liquid Glass design language, which is coming to all of its devices, including Macs. I've been tinkering with the macOS Tahoe 26 developer beta on the M4 MacBook Air for about a day. So far, the aesthetic changes range from slick to slightly overwrought, but the new Spotlight search features are nifty and useful. \nThere are new touches of glassy transparency all over macOS 26, including the Dock, Finder, widgets, and built-in apps. It's more subtle than on the iPhone, mostly because the Mac's much larger screen real estate makes the Liquid Glass elements more like accents than whatever this mess is supposed to be. I'm not very fond of it just yet, but maybe it will grow on me, like UI changes tend to.\n\nThe Dock now has a frosted background that's more translucent than Sequoia's flatter design. The hazy, frozen glass aesthetic also extends to widgets, like the calendar and weather, and drop-down menus - though the latter have much higher opacity. The pop-ups for volume and brightness now use this distorted glass look as well, though they've moved to the top-right corner of the screen instead of being centered above the dock. Frankly, they're ugly,  …\nRead the full story at The Verge."
  },
  {
    "title": "Apple punts on Siri updates as it struggles to keep up in the AI race",
    "url": "https://www.theverge.com/apple/682984/apple-punts-on-siri-updates-as-it-struggles-to-keep-up-in-the-ai-race",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-06-10T19:23:27-04:00",
    "published_datetime": "2025-06-11T00:23:27",
    "summary": "\n\n\n\nApple's WWDC 2025 had new software, Formula 1 references, and a piano man crooning the text of different app reviews. But one key feature got the short end of the stick: Siri.\nAlthough the company continuously referenced Apple Intelligence and pushed new features like live translation for Messages, FaceTime, and phone calls, Apple's AI assistant was barely mentioned. In fact, the most attention Siri got was when Apple explained that some of its previously promised features were running behind schedule.\nTo address what many saw as the elephant in the room, Apple's keynote briefly mentioned that it had updated Siri to be \"more natural and more helpful,\" but that personalization features were still on the horizon. Those features were first mentioned at last year's WWDC, with a rollout timeline \"over the course of the next year.\"\n\"We're continuing our work to deliver the features that make Siri even more personal,\" Craig Federighi, Apple's SVP of software engineering, said during Monday's keynote. \"This work needed more time to reach our high quality bar, and we look forward to sharing more about it in the coming year.\"\nApple's relative silence on Siri stands out\nApple has long b …\nRead the full story at The Verge.",
    "content": "\n\n\n\nApple's WWDC 2025 had new software, Formula 1 references, and a piano man crooning the text of different app reviews. But one key feature got the short end of the stick: Siri.\nAlthough the company continuously referenced Apple Intelligence and pushed new features like live translation for Messages, FaceTime, and phone calls, Apple's AI assistant was barely mentioned. In fact, the most attention Siri got was when Apple explained that some of its previously promised features were running behind schedule.\nTo address what many saw as the elephant in the room, Apple's keynote briefly mentioned that it had updated Siri to be \"more natural and more helpful,\" but that personalization features were still on the horizon. Those features were first mentioned at last year's WWDC, with a rollout timeline \"over the course of the next year.\"\n\"We're continuing our work to deliver the features that make Siri even more personal,\" Craig Federighi, Apple's SVP of software engineering, said during Monday's keynote. \"This work needed more time to reach our high quality bar, and we look forward to sharing more about it in the coming year.\"\nApple's relative silence on Siri stands out\nApple has long b …\nRead the full story at The Verge."
  },
  {
    "title": "Sam Altman claims an average ChatGPT query uses ‘roughly one fifteenth of a teaspoon’ of water",
    "url": "https://www.theverge.com/news/685045/sam-altman-average-chatgpt-energy-water",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-06-10T18:28:49-04:00",
    "published_datetime": "2025-06-10T23:28:49",
    "summary": "\n\n\n\nOpenAI CEO Sam Altman, in a blog post published Tuesday, says an average ChatGPT query uses about 0.000085 gallons of water, or “roughly one fifteenth of a teaspoon.” He made the claim as part of a broader post on his predictions about how AI will change the world. \n“People are often curious about how much energy a ChatGPT query uses; the average query uses about 0.34 watt-hours, about what an oven would use in a little over one second, or a high-efficiency lightbulb would use in a couple of minutes,” he says. He also argues that “the cost of intelligence should eventually converge to near the cost of electricity.” OpenAI didn’t immediately respond to a request for comment on how Altman came to those figures.\nAI companies have come under scrutiny for energy costs of their technology. This year, for example, researchers forecast that AI could consume more power than Bitcoin mining by the end of the year. In an article last year, The Washington Post worked with researchers to determine that a 100-word email “generated by an AI chatbot using GPT-4” required “a little more than 1 bottle.” The publication also found that water usage can depend on where a datacenter is located.",
    "content": "\n\n\n\nOpenAI CEO Sam Altman, in a blog post published Tuesday, says an average ChatGPT query uses about 0.000085 gallons of water, or “roughly one fifteenth of a teaspoon.” He made the claim as part of a broader post on his predictions about how AI will change the world. \n“People are often curious about how much energy a ChatGPT query uses; the average query uses about 0.34 watt-hours, about what an oven would use in a little over one second, or a high-efficiency lightbulb would use in a couple of minutes,” he says. He also argues that “the cost of intelligence should eventually converge to near the cost of electricity.” OpenAI didn’t immediately respond to a request for comment on how Altman came to those figures.\nAI companies have come under scrutiny for energy costs of their technology. This year, for example, researchers forecast that AI could consume more power than Bitcoin mining by the end of the year. In an article last year, The Washington Post worked with researchers to determine that a 100-word email “generated by an AI chatbot using GPT-4” required “a little more than 1 bottle.” The publication also found that water usage can depend on where a datacenter is located."
  },
  {
    "title": "The best budget robot vacuums",
    "url": "https://www.theverge.com/23846479/best-budget-robot-vacuum-robot-mop",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-06-10T18:22:31-04:00",
    "published_datetime": "2025-06-10T23:22:31",
    "summary": "\n\n\n\nToday’s robot vacuums are becoming a bit like cars: with all the features, upgrades, and fancy trimmings available these days, it’s easy to forget that they can just be simple machines that get us from point A to point B. Yes, some bots blow hot air on their bums (mop pads), deftly navigate dog poop, and have arms to pick up your socks, but there are plenty of basic budget robot vacuums that just do a decent job of cleaning your floor autonomously — as long as you tidy up first.\nFancier models have obstacle recognition, and some even use AI-powered cameras to tell popcorn from poop and avoid the latter. If you want one of those, check out my best robot vacuum buying guide. But if you think you can manage the task of picking up after yourself (and your puppy), a budget bot will save you a lot of money and still do a good job cleaning your floor. \nFeatured in this article\n\n\n\n\nHow I test robot vacuums\nTo judge its vacuuming power, I run every robot vacuum through a series of tests on hardwood and carpet, including flour, kitty litter, oatmeal, and pet and human hair. I test obstacle avoidance using cables, shoes, socks, and bed skirts. I test mopping effectiveness on hardwood and tile floors using dried and moist messes. If the robot has an auto-empty dock, I test to see how well it empties the onboard bin as well as any other features of the dock. I run the robot vacs around three different levels in my home to see how they handle different surfaces, room transitions, and edge sensing. I evaluate how long they run before needing to recharge and test each app, focusing on its mapping functions to see how simple they are to use and how reliable they are. I also examine each robot’s build quality and parts availability, and I totally judge them based on how much my cat Boone likes to play with them.\n\n\nPrice\nYes, there are sub-$200 robots out there. No, I do not recommend you buy them. With so many new models coming out almost daily, it’s better to look for a sale on an older model from a well-known company than buy a no-name budget bot. You can pick up a brand new, two-year-old Roomba or Roborock with mapping and advanced navigation for half its original price. These gadgets should last for years, so it’s not like buying last season’s Prada slip-ons.That said, sales are hard to keep track of, so some of the prices listed here may seem high for a budget bot. If you see one that fits your needs, keep an eye on The Verge’s deals page for when they go on an even better sale. \n\n\nCleaning prowess\nThe cheaper the bot, the more important suction power is, as they tend to have fewer features that improve cleaning. Higher-end robots have things like better brushes, carpet boost mode, and dirt detection. At a minimum, look for 2,500Pa (if the manufacturer lists suction power; some don’t). I also much prefer rubber roller brushes or a rubber/bristle hybrid over just bristle brushes. Rubber rollers get up more dirt and get tangled less than bristles.\n\n\nA mop (or not)\nBear in mind that most budget mopping bots don’t really mop — it’s more just using a damp cloth to pick up the fine dust the robot’s vacuum left behind, which is useful but not essential. Mop attachments with water reservoirs also take up space on a robot and mean a smaller bin.\n\n\nA big bin\nA big bin means you don’t need to empty it as often. Eight hundred milliliters is the largest I’ve seen, but anything over 450 ml is decent on a budget bot. With many bots now pulling double duty as mopping robots and the prevalence of auto-empty docks, it’s hard to find robots with big bins. But if you’re on a budget and don’t want to spend extra for the dock, a big bin will mean less hands-on time with your vacuum.\n\n\nOr an auto-empty option\nIf you can swing it, I strongly recommend an auto-empty dock, and there are finally some cheaper versions out there. While it’s a nice-to-have rather than a must-have, delegating the chore of emptying the bin to the robot does mean your floors will be cleaner since a vacuum with a full bin won’t suck up dirt. Many standalone robots now have an auto-empty dock option you can add later if you want to wait and see, but buying them together is generally cheaper.\n\n\nNavigation / mapping\nWe are starting to see true budget bots use the vSLAM (visual simultaneous localization and mapping) or lidar-powered navigation or mapping found on higher-end robots, albeit lower-level versions. Some, use the bump and roll technique, with more now adding a gyroscope function that at least makes them go in a straight line.Choosing an older version of a high-end robot will get you the better navigation, but I’ve also included a few bump-and-roll bots with basic mapping capability, which makes the experience better all around. Non-mapping bots may miss entire sections of your home and, when they start again after charging, may go over the area they last cleaned. However, mapping is less important if you want a bot for a single room or small apartment.\n\n\nGood battery life / long runtime\nWhile most bots can recharge and resume (go back to their charging base and refuel before going back out again), a bot that can go for at least two hours on one charge will get the job done more quickly and be less annoying. I look for at least 120 minutes of runtime (180 is the best).\n\n\nA decent app\nA lot of budget bots have barely usable apps; this is another reason why buying a lower-cost option from a company with higher-end models gets you a better experience, as the app is usually more polished.A good basic app, though, should have the ability to set multiple schedules to send the robot out, an option for a do-not-disturb period (so it doesn’t start up again at 2AM because it finally recharged), and a way to link to voice assistants and smart home platforms like Amazon Alexa, Google Home, and Apple’s Siri.\n\n\nRepairability\nEven at the budget end, you’ll be spending $200 to $300 on a robot vacuum, so repairability and the availability of replacement parts are a big bonus.\n\n\n\nBest budget robot vacuum \nSuction power: 5,300Pa / Dustbin capacity: 300ml / Self-empty dock option: Yes / Mopping option: Yes / Mapping: Yes, lidar / Keep-out zones: Yes, virtual / Runtime: 100 mins, 2,600mAh battery/ Brush style: Single rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nFor around $300, the Tapo RV30 Max Plus is a very capable robot vacuum and mop with some key features usually only found on vacuums that are more than twice its price. These include room-specific cleaning, multiple suction and water levels, smart lidar-based navigation, and an auto-empty dock. With brands like Roomba and Roborock, you’re often paying double for the privilege of not having to empty the bot’s bin.\n\nThanks to lidar navigation, the RV30 did an excellent job of navigating my house, cleaning the perimeters of the rooms, and then using a mesh grid to clean inside the rooms. I did have to tidy up before it ran, though, as there’s no camera on board or AI-powered obstacle detection — so cables and socks will trip it up. \nIts 5,200Pa suction power is impressive on a bot at this price, and ably sucked up Cheerios and dry oatmeal on hard flooring. It left some of the finer dust and debris, as its single bristle / rubber brush isn’t super effective. It fared less well on carpet. However, in the app, I could set it to clean a room three times for each job, after which it generally picked up all visible debris.\nMopping was better than average for a mop with no pressure or oscillation. It has a wide mop pad, and the bot has a big 300ml tank (which also incorporates a 300ml dustbin), so it applies enough water for a good surface clean.\nAnother unique feature for a budget robot is the ability to set customized cleaning for each room, choosing from five suction levels and three water levels as well as three rotations.\n5,200Pa suction power is impressive on a bot at this price\nThe Tapo app is very simple to use, with an easy-to-edit map that lets you add virtual walls and no-go zones, add furniture, and designate carpet areas. There’s no carpet sensing, so you need to tell it where carpets are if you don’t want it to mop them. You can also set the cleaning direction and build up to four maps — again, features usually only found on higher-end robots.\nIt’s also easy to start a clean from the app, and I really like that you can tap on the map to send the robot to that spot.\nThe biggest downside of the Tapo is its tiny battery, which is just 2,600mAh. That is half the size of most vacs, and it couldn’t clean my entire 800-square-foot downstairs without needing to go back and recharge. It also takes a while to charge and occasionally has trouble repositioning itself on its dock.\nYou can get the RV30 without the auto-empty dock for around $80 less if you prefer an even simpler robot vacuum setup. This way, it will fit under a couch or bed, but you’ll have to manually empty its bin.\nBest budget robot vacuum and mop\nSuction power: 6,000Pa / Dustbin capacity: 400ml / Runtime: 180 mins, 5,200mAh battery / Brush style: dual rubber / Auto-empty dock option: yes / Mapping: yes, lidar navigation / Keep-out zones: yes, virtual / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nThe Roborock S8 is a great vacuum that mops well and has AI-powered obstacle detection—a rarity at this price point. Its dual rubber roller brushes and 6,000Pa of suction do an excellent job on hard floors and carpets, and its flat mop that vibrates is effective at scrubbing your floors. \nThere’s the option of pairing the S8 with a fairly sleek auto-empty dock, but unlike Roborock’s QRevo line (which starts at around $600), the dock won’t automatically fill the water tank or wash the mop; you’ll have to do that work manually.\nFormerly a flagship robot vacuum for Roborock, this once $750 bot can now be found for well under $500, even with its auto-empty dock. Its flat mop pad vibrates 3,000 times a second to simulate some good old-fashioned scrubbing, and the bot comes with an extra-large on-board water tank, which means it actually gets wet enough to be effective.\n\nThe S8 can be set to mop only — something few budget bots offer, and its mop-only mode does an excellent job, moving in a tighter “Z” pattern and going over the floors twice. It also has a slow option for a more thorough cleaning. I liked to send it out to vacuum everywhere first, then recharge and go out again to mop, which resulted in sparklingly clean floors. It does take a long time, though.\nAnother great feature at this price is that the S8 has carpet sensing and can raise its mops a few millimeters to avoid dampening your carpets. Most other budget mopping bots require you to remove the mop pads when vacuuming carpet or set keep-out zones around your rugs. This bot can also raise its wheels when it cleans messes like ketchup to prevent its brushes from getting sticky.\nHowever, the mop-raising feature can only clear low-pile rugs, so I had to set no-mopping zones around my plush floor coverings. The S8 requires a fair amount of hands-on time since you have to refill its reservoir manually and wash the mopping pads (you can throw them in the washing machine). If you want to avoid those chores, you’ll need to bump up to about $600 and get whichever Roborock QRevo vac and mop is on sale. This adds spinning mopping pads and an auto wash/dry/refill dock.\nBest budget robot vacuum for pet hair\n\nSuction Power: 5,000Pa / Dustbin capacity: 770ml / Self-empty dock option: Yes / Mopping option: Yes / Mapping: Yes, lidar / Suction power: 5,500Pa / Keep-out zones: Yes, virtual / Runtime: 240 mins, 5,200mAh battery / Brush style: dual, rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nMy recommendation for families with pets who don’t want to spend a small fortune on an auto-empty robot vacuum is to buy a good bot with a big bin. These are getting harder to find now that every bot wants to be a multitasker and also mop (the water reservoir takes up valuable dustbin room). So, I’m very pleased with Roborock’s Q5 Pro with its 770ml dustbin. \nThis huge bin pairs with dual rubber roller brushes that are better at getting pet hair out of rugs than single brushes. The rubber is also less prone than bristles to getting tangled with hair, and combined with 5,500Pa suction power, this vacuum does a good job on very dirty floors. It does have a removable mopping pad with a small water tank built into it, too, which is useful for cleaning up the fine dust left behind by the vacuum, but it isn’t going to scrub your floors. It will, however, keep the pet hair at bay.\nDon’t confuse this with the cheaper Roborock Q5, however. That bot has a smaller bin, lower suction, shorter runtime, and only one roller brush. It’s worth spending the extra for the Pro.\n\n\n\n\n\n\n\nThe Q5 Pro Plus pairs the bot with the redesigned Roborock auto-empty dock if you really don’t like emptying the robot’s onboard bin, normally a hefty price bump, it’s on sale for $360 at Amazon. The dock is relatively compact and lightweight compared to previous versions. However, considering the size of the Q5 Pro’s bin, you’d only have to empty it three times before the dock’s 2.5-liter bag is also full.\nThe Q5 Pro doesn’t have AI-powered obstacle avoidance, although it will dodge shoes and larger objects. It does have a huge 5,200mAh battery that will run for about four hours. It uses the excellent Roborock app and has all the same software features of the higher-end Roborock’s family, including lidar mapping and navigation, digital keep-out zones, room-specific cleaning, zone cleaning, and voice control.\nBest basic bump-and-roll bot\nSuction power: unknown / Dustbin capacity: 425ml /  Runtime: 120 mins / Brush style: single bristle / rubber hybrid / Auto-empty dock option: no / Mapping: no / Keep-out zones: no / Works with: Amazon Alexa, Google Home\nThe Shark Ion’s big bin, simple app experience, decent battery life, repairability, and bullish nature make this an excellent bump-and-roll bot. It doesn’t map or have any special navigation features other than colliding with things and changing direction. It’s not fancy, but it gets the job done.\nIt’s a good one to stick under a bed or desk and set to run when you’re not home, as it’s loud and rattly and will bang into everything in its path. But its big wheels and 120-minute runtime mean it’s less prone to getting stuck or running out of juice than simpler $200 bots. \nUnlike many budget bots, it uses a hybrid roller brush that’s both bristle and plastic and doesn’t get as tangled as standard bristle brushes. Its short, squat side brushes are surprisingly effective at getting debris into the robot’s path, and because they’re short, they’re less prone to getting tangled in stray cords.\n\nBut the best thing ‘bout this bot is its tank-like wheels that will roll right over anything in its path, including high transitions between rooms, obstacles like lounger chair legs, and other furniture traps that regularly stump other bots. That’s a good thing, as there’s no mapping, obstacle detection, or any way to set keep-out zones here. This bot just goes. \nAnother bonus: replacement parts are easily available, making it simple to repair and just keep going.\nShark doesn’t share suction power specs, but it ably handled all my tests, including the toughest: raw oatmeal. Those little flakes are hard to pick up; side brushes will spin them all over the floor. It did a good job on pet hair, too, although, like most robots I tested, it required at least two runs to get everything up effectively.\nThe app is super basic: just on / off, scheduling, and a choice of three power levels (all loud). Disappointingly, you can only schedule it once a day. Most robots can be programmed to do two to three passes, but in place of that, I like the option to schedule it to go out twice to make sure it gets the job done. I couldn’t do that with the Shark. Still, you can press its button or use the app to send it out again if needed.\nBest budget Roomba robot vacuum\nSuction power: unknown / Dustbin capacity: 419ml / Runtime: 90 minutes / Brush style: dual rubber / Auto-empty dock option: yes / Mopping option: yes / Mapping: yes / Keep-out zones: physical only / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nThe Roomba i5 is the follow-up to my previous top pick for a budget robot, the Roomba i3. It’s not the cheapest bot on the block, but its cleaning chops, attractive design, good software, and robust, easily-repairable hardware make it a good choice for spending a smaller budget. \nThe i5 brings mopping capability to the lower end of iRobot’s line via a swappable mopping bin that adds a flat mopping pad and a sizable 210ml reservoir. There’s no carpet avoidance, though, so I had to roll up the ends of my carpets to block it from going on them. \nBut this bot is best as a vacuum, and it cleans almost as well as iRobot’s higher-end j7 but for a lot less money. It has slightly lower suction power, but it boasts Roomba’s signature dual roller rubber brushes, which do an excellent job of removing pet hair from hardwood floors and sucking up oatmeal from plush carpets. These are slightly different from the Roborock dual brushes, and I find the nubs make them more effective at digging out the dirt, especially from carpet. \n\nThe i5 has mapping and room-specific cleaning, so you can send it to clean the kitchen if you want. However, unlike my top pick, the Tapo RV30, there’s no option to set virtual keep-out zones. If you have somewhere you don’t want the bot to roam, you’ll need to buy iRobot’s virtual wall towers. It also has a relatively small bin, but you can pair it with an auto-empty base (although that doubles the cost).  \nThe i5 is a solid vacuum with big wheels and a big bumper that can easily tackle any floor surface you throw at it. It can manage most transitions and is one of the only vacs I’ve tested that doesn’t get stuck on the uneven wooden floors in my screened-in porch. It does tend to bump into things, but it gets almost everywhere you want it to and won’t be put off by a bed skirt. But if you have delicate items on rickety tables, watch out.\n\nAs with all Roombas, the i5 is easy to self-repair, and you can buy (not inexpensive) replacements for all its parts. I’ve actually rebuilt an i3 (the previous model) after it rolled over some dog poop. There’s no obstacle avoidance here; you have to bump up to the Roomba j7 for that (which, if you can get it on sale anywhere, is a great robot vacuum.)  \niRobot also offers the Combo j5 for $529.99 (currently on sale for $249.99 at Amazon), adding more advanced mapping, including virtual keep-out zones and better obstacle and carpet detection. It also has a shinier finish, whereas the i5 retains the fabric-covered body of the i3. If you can find the j5 on sale for close to or less than the i3 (it’s $379 with the auto-empty dock on Amazon at the time of writing), go for it. Otherwise, the i3 is your best bet for a budget Roomba. \nBest budget robot vacuum without Wi-Fi\nSuction power: 2,000Pa / Dustbin capacity: 600ml / Runtime: 100 mins / Brush style: single bristle / rubber hybrid / Auto-empty dock option: no / Mapping: no / Keep-out zones: no / Works with: n/a\nThe Eufy 11S Max is a rarity — a robot vacuum that doesn’t use Wi-Fi at all. There’s not even an app. Instead, you just press the button, and off it trundles. It also comes with a remote if you’d rather not get up off the couch, and you can use that to program it to clean at a specific time. \nThe 11S is super slim, 72.5 mm high, with no lidar tower, so it will get under most couches and very quiet. It has a big 600ml bin, and I was very impressed with how much it got up off my hardwood floors, even with its relatively small 2,000Pa of suction. There are three cleaning levels, and at the lowest, it registers around 55db, quiet enough to run in a home office.\nIt does have a smallish battery — only 100 minutes of runtime — but it will go back and recharge. For $200, this is the perfect budget bot for those wary of or who don’t want to deal with an app and Wi-Fi. It’s a bump-and-roll bot, meaning there are no real navigation skills. But it has plenty of replaceable parts, including the battery and wheels, so you can keep it going for a long time.\nBest self-cleaning, self-emptying robot vacuum / mop under $500\nSuction Power: 5,100Pa / Dustbin capacity: 360ml / Self-empty dock option: Yes / Mopping option: Yes / Mapping: Yes, lidar / Suction power: 5,100Pa / Keep-out zones: Yes, virtual / Runtime/Battery: 180 mins, 5,400mAh / Brush style: Single rubber bristle hybrid / Works with: Amazon Alexa, Google Home\nThe Yeedi Cube is the least expensive robot vacuum with the same kind of multifunction dock and high-end features as robots over $1,000. This means it can automatically fill its onboard water tank, clean and dry its mop, and empty the bin. It also has more advanced obstacle avoidance tech than most budget bots, although, unlike the pricier bots, it uses lasers to see objects, not an AI-powered camera, which is less effective. While it originally retailed for $699.99, it’s now an older model and is regularly on sale for less than $500.\nThe Yeedi resembles the Shark and Roomba in its full-speed-ahead nature. It will just run into things, and if it can clean them, great! It also only goes around larger objects. So, while it ably sucked up Cheerios and picked up all the oatmeal flakes, it got stuck on cords and socks. Definitely keep it away from pet waste.\n\nThe Yeedi’s mopping prowess is impressive. It scrubs the floor using a thin microfiber cloth that vibrates 2,500 times a minute to get up grime. The dock cleans the mopping pad, drains the dirty water, and auto empties the bin, but the robot carries its one-liter water tank around on its back, so it doesn’t need to go back and refill during a run.\nOne downside is that it uses a single hybrid rubber / bristle brush, which gets tangled with hair. However, combined with 5,100Pa of suction power, it did a good job of picking up dirt from the floors.\nI really liked the handle; it makes it easy to pick up the vacuum and put it where you want to clean. An onboard spot clean button means you don’t need to fuss with the app to get it to clean up a dedicated area. The map offers room-specific cleaning and keep-out zones for vacuuming and mopping but can be a bit fiddly to use.\nWhat’s coming next\n\niRobot’s new Roomba lineup includes several budget-friendly options — including the $319.99 Roomba 105 Combo and the $469.99 Roomba 205 DustCompactor Combo, neither of which we’ve tested. Both entry-level models can vacuum and mop, offer lidar navigation and mapping, and tout 7,000Pa of suction power. They also both offer virtual keep-out zones and automatic carpet detection and avoidance; however, the 205 features a new onboard debris and dust compactor, which iRobot says allows you to go eight weeks without emptying the vacuum.\n\nUpdate, June 10th: Adjusted pricing / availability and added several new links.",
    "content": "\n\n\n\nToday’s robot vacuums are becoming a bit like cars: with all the features, upgrades, and fancy trimmings available these days, it’s easy to forget that they can just be simple machines that get us from point A to point B. Yes, some bots blow hot air on their bums (mop pads), deftly navigate dog poop, and have arms to pick up your socks, but there are plenty of basic budget robot vacuums that just do a decent job of cleaning your floor autonomously — as long as you tidy up first.\nFancier models have obstacle recognition, and some even use AI-powered cameras to tell popcorn from poop and avoid the latter. If you want one of those, check out my best robot vacuum buying guide. But if you think you can manage the task of picking up after yourself (and your puppy), a budget bot will save you a lot of money and still do a good job cleaning your floor. \nFeatured in this article\n\n\n\n\nHow I test robot vacuums\nTo judge its vacuuming power, I run every robot vacuum through a series of tests on hardwood and carpet, including flour, kitty litter, oatmeal, and pet and human hair. I test obstacle avoidance using cables, shoes, socks, and bed skirts. I test mopping effectiveness on hardwood and tile floors using dried and moist messes. If the robot has an auto-empty dock, I test to see how well it empties the onboard bin as well as any other features of the dock. I run the robot vacs around three different levels in my home to see how they handle different surfaces, room transitions, and edge sensing. I evaluate how long they run before needing to recharge and test each app, focusing on its mapping functions to see how simple they are to use and how reliable they are. I also examine each robot’s build quality and parts availability, and I totally judge them based on how much my cat Boone likes to play with them.\n\n\nPrice\nYes, there are sub-$200 robots out there. No, I do not recommend you buy them. With so many new models coming out almost daily, it’s better to look for a sale on an older model from a well-known company than buy a no-name budget bot. You can pick up a brand new, two-year-old Roomba or Roborock with mapping and advanced navigation for half its original price. These gadgets should last for years, so it’s not like buying last season’s Prada slip-ons.That said, sales are hard to keep track of, so some of the prices listed here may seem high for a budget bot. If you see one that fits your needs, keep an eye on The Verge’s deals page for when they go on an even better sale. \n\n\nCleaning prowess\nThe cheaper the bot, the more important suction power is, as they tend to have fewer features that improve cleaning. Higher-end robots have things like better brushes, carpet boost mode, and dirt detection. At a minimum, look for 2,500Pa (if the manufacturer lists suction power; some don’t). I also much prefer rubber roller brushes or a rubber/bristle hybrid over just bristle brushes. Rubber rollers get up more dirt and get tangled less than bristles.\n\n\nA mop (or not)\nBear in mind that most budget mopping bots don’t really mop — it’s more just using a damp cloth to pick up the fine dust the robot’s vacuum left behind, which is useful but not essential. Mop attachments with water reservoirs also take up space on a robot and mean a smaller bin.\n\n\nA big bin\nA big bin means you don’t need to empty it as often. Eight hundred milliliters is the largest I’ve seen, but anything over 450 ml is decent on a budget bot. With many bots now pulling double duty as mopping robots and the prevalence of auto-empty docks, it’s hard to find robots with big bins. But if you’re on a budget and don’t want to spend extra for the dock, a big bin will mean less hands-on time with your vacuum.\n\n\nOr an auto-empty option\nIf you can swing it, I strongly recommend an auto-empty dock, and there are finally some cheaper versions out there. While it’s a nice-to-have rather than a must-have, delegating the chore of emptying the bin to the robot does mean your floors will be cleaner since a vacuum with a full bin won’t suck up dirt. Many standalone robots now have an auto-empty dock option you can add later if you want to wait and see, but buying them together is generally cheaper.\n\n\nNavigation / mapping\nWe are starting to see true budget bots use the vSLAM (visual simultaneous localization and mapping) or lidar-powered navigation or mapping found on higher-end robots, albeit lower-level versions. Some, use the bump and roll technique, with more now adding a gyroscope function that at least makes them go in a straight line.Choosing an older version of a high-end robot will get you the better navigation, but I’ve also included a few bump-and-roll bots with basic mapping capability, which makes the experience better all around. Non-mapping bots may miss entire sections of your home and, when they start again after charging, may go over the area they last cleaned. However, mapping is less important if you want a bot for a single room or small apartment.\n\n\nGood battery life / long runtime\nWhile most bots can recharge and resume (go back to their charging base and refuel before going back out again), a bot that can go for at least two hours on one charge will get the job done more quickly and be less annoying. I look for at least 120 minutes of runtime (180 is the best).\n\n\nA decent app\nA lot of budget bots have barely usable apps; this is another reason why buying a lower-cost option from a company with higher-end models gets you a better experience, as the app is usually more polished.A good basic app, though, should have the ability to set multiple schedules to send the robot out, an option for a do-not-disturb period (so it doesn’t start up again at 2AM because it finally recharged), and a way to link to voice assistants and smart home platforms like Amazon Alexa, Google Home, and Apple’s Siri.\n\n\nRepairability\nEven at the budget end, you’ll be spending $200 to $300 on a robot vacuum, so repairability and the availability of replacement parts are a big bonus.\n\n\n\nBest budget robot vacuum \nSuction power: 5,300Pa / Dustbin capacity: 300ml / Self-empty dock option: Yes / Mopping option: Yes / Mapping: Yes, lidar / Keep-out zones: Yes, virtual / Runtime: 100 mins, 2,600mAh battery/ Brush style: Single rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nFor around $300, the Tapo RV30 Max Plus is a very capable robot vacuum and mop with some key features usually only found on vacuums that are more than twice its price. These include room-specific cleaning, multiple suction and water levels, smart lidar-based navigation, and an auto-empty dock. With brands like Roomba and Roborock, you’re often paying double for the privilege of not having to empty the bot’s bin.\n\nThanks to lidar navigation, the RV30 did an excellent job of navigating my house, cleaning the perimeters of the rooms, and then using a mesh grid to clean inside the rooms. I did have to tidy up before it ran, though, as there’s no camera on board or AI-powered obstacle detection — so cables and socks will trip it up. \nIts 5,200Pa suction power is impressive on a bot at this price, and ably sucked up Cheerios and dry oatmeal on hard flooring. It left some of the finer dust and debris, as its single bristle / rubber brush isn’t super effective. It fared less well on carpet. However, in the app, I could set it to clean a room three times for each job, after which it generally picked up all visible debris.\nMopping was better than average for a mop with no pressure or oscillation. It has a wide mop pad, and the bot has a big 300ml tank (which also incorporates a 300ml dustbin), so it applies enough water for a good surface clean.\nAnother unique feature for a budget robot is the ability to set customized cleaning for each room, choosing from five suction levels and three water levels as well as three rotations.\n5,200Pa suction power is impressive on a bot at this price\nThe Tapo app is very simple to use, with an easy-to-edit map that lets you add virtual walls and no-go zones, add furniture, and designate carpet areas. There’s no carpet sensing, so you need to tell it where carpets are if you don’t want it to mop them. You can also set the cleaning direction and build up to four maps — again, features usually only found on higher-end robots.\nIt’s also easy to start a clean from the app, and I really like that you can tap on the map to send the robot to that spot.\nThe biggest downside of the Tapo is its tiny battery, which is just 2,600mAh. That is half the size of most vacs, and it couldn’t clean my entire 800-square-foot downstairs without needing to go back and recharge. It also takes a while to charge and occasionally has trouble repositioning itself on its dock.\nYou can get the RV30 without the auto-empty dock for around $80 less if you prefer an even simpler robot vacuum setup. This way, it will fit under a couch or bed, but you’ll have to manually empty its bin.\nBest budget robot vacuum and mop\nSuction power: 6,000Pa / Dustbin capacity: 400ml / Runtime: 180 mins, 5,200mAh battery / Brush style: dual rubber / Auto-empty dock option: yes / Mapping: yes, lidar navigation / Keep-out zones: yes, virtual / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nThe Roborock S8 is a great vacuum that mops well and has AI-powered obstacle detection—a rarity at this price point. Its dual rubber roller brushes and 6,000Pa of suction do an excellent job on hard floors and carpets, and its flat mop that vibrates is effective at scrubbing your floors. \nThere’s the option of pairing the S8 with a fairly sleek auto-empty dock, but unlike Roborock’s QRevo line (which starts at around $600), the dock won’t automatically fill the water tank or wash the mop; you’ll have to do that work manually.\nFormerly a flagship robot vacuum for Roborock, this once $750 bot can now be found for well under $500, even with its auto-empty dock. Its flat mop pad vibrates 3,000 times a second to simulate some good old-fashioned scrubbing, and the bot comes with an extra-large on-board water tank, which means it actually gets wet enough to be effective.\n\nThe S8 can be set to mop only — something few budget bots offer, and its mop-only mode does an excellent job, moving in a tighter “Z” pattern and going over the floors twice. It also has a slow option for a more thorough cleaning. I liked to send it out to vacuum everywhere first, then recharge and go out again to mop, which resulted in sparklingly clean floors. It does take a long time, though.\nAnother great feature at this price is that the S8 has carpet sensing and can raise its mops a few millimeters to avoid dampening your carpets. Most other budget mopping bots require you to remove the mop pads when vacuuming carpet or set keep-out zones around your rugs. This bot can also raise its wheels when it cleans messes like ketchup to prevent its brushes from getting sticky.\nHowever, the mop-raising feature can only clear low-pile rugs, so I had to set no-mopping zones around my plush floor coverings. The S8 requires a fair amount of hands-on time since you have to refill its reservoir manually and wash the mopping pads (you can throw them in the washing machine). If you want to avoid those chores, you’ll need to bump up to about $600 and get whichever Roborock QRevo vac and mop is on sale. This adds spinning mopping pads and an auto wash/dry/refill dock.\nBest budget robot vacuum for pet hair\n\nSuction Power: 5,000Pa / Dustbin capacity: 770ml / Self-empty dock option: Yes / Mopping option: Yes / Mapping: Yes, lidar / Suction power: 5,500Pa / Keep-out zones: Yes, virtual / Runtime: 240 mins, 5,200mAh battery / Brush style: dual, rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nMy recommendation for families with pets who don’t want to spend a small fortune on an auto-empty robot vacuum is to buy a good bot with a big bin. These are getting harder to find now that every bot wants to be a multitasker and also mop (the water reservoir takes up valuable dustbin room). So, I’m very pleased with Roborock’s Q5 Pro with its 770ml dustbin. \nThis huge bin pairs with dual rubber roller brushes that are better at getting pet hair out of rugs than single brushes. The rubber is also less prone than bristles to getting tangled with hair, and combined with 5,500Pa suction power, this vacuum does a good job on very dirty floors. It does have a removable mopping pad with a small water tank built into it, too, which is useful for cleaning up the fine dust left behind by the vacuum, but it isn’t going to scrub your floors. It will, however, keep the pet hair at bay.\nDon’t confuse this with the cheaper Roborock Q5, however. That bot has a smaller bin, lower suction, shorter runtime, and only one roller brush. It’s worth spending the extra for the Pro.\n\n\n\n\n\n\n\nThe Q5 Pro Plus pairs the bot with the redesigned Roborock auto-empty dock if you really don’t like emptying the robot’s onboard bin, normally a hefty price bump, it’s on sale for $360 at Amazon. The dock is relatively compact and lightweight compared to previous versions. However, considering the size of the Q5 Pro’s bin, you’d only have to empty it three times before the dock’s 2.5-liter bag is also full.\nThe Q5 Pro doesn’t have AI-powered obstacle avoidance, although it will dodge shoes and larger objects. It does have a huge 5,200mAh battery that will run for about four hours. It uses the excellent Roborock app and has all the same software features of the higher-end Roborock’s family, including lidar mapping and navigation, digital keep-out zones, room-specific cleaning, zone cleaning, and voice control.\nBest basic bump-and-roll bot\nSuction power: unknown / Dustbin capacity: 425ml /  Runtime: 120 mins / Brush style: single bristle / rubber hybrid / Auto-empty dock option: no / Mapping: no / Keep-out zones: no / Works with: Amazon Alexa, Google Home\nThe Shark Ion’s big bin, simple app experience, decent battery life, repairability, and bullish nature make this an excellent bump-and-roll bot. It doesn’t map or have any special navigation features other than colliding with things and changing direction. It’s not fancy, but it gets the job done.\nIt’s a good one to stick under a bed or desk and set to run when you’re not home, as it’s loud and rattly and will bang into everything in its path. But its big wheels and 120-minute runtime mean it’s less prone to getting stuck or running out of juice than simpler $200 bots. \nUnlike many budget bots, it uses a hybrid roller brush that’s both bristle and plastic and doesn’t get as tangled as standard bristle brushes. Its short, squat side brushes are surprisingly effective at getting debris into the robot’s path, and because they’re short, they’re less prone to getting tangled in stray cords.\n\nBut the best thing ‘bout this bot is its tank-like wheels that will roll right over anything in its path, including high transitions between rooms, obstacles like lounger chair legs, and other furniture traps that regularly stump other bots. That’s a good thing, as there’s no mapping, obstacle detection, or any way to set keep-out zones here. This bot just goes. \nAnother bonus: replacement parts are easily available, making it simple to repair and just keep going.\nShark doesn’t share suction power specs, but it ably handled all my tests, including the toughest: raw oatmeal. Those little flakes are hard to pick up; side brushes will spin them all over the floor. It did a good job on pet hair, too, although, like most robots I tested, it required at least two runs to get everything up effectively.\nThe app is super basic: just on / off, scheduling, and a choice of three power levels (all loud). Disappointingly, you can only schedule it once a day. Most robots can be programmed to do two to three passes, but in place of that, I like the option to schedule it to go out twice to make sure it gets the job done. I couldn’t do that with the Shark. Still, you can press its button or use the app to send it out again if needed.\nBest budget Roomba robot vacuum\nSuction power: unknown / Dustbin capacity: 419ml / Runtime: 90 minutes / Brush style: dual rubber / Auto-empty dock option: yes / Mopping option: yes / Mapping: yes / Keep-out zones: physical only / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nThe Roomba i5 is the follow-up to my previous top pick for a budget robot, the Roomba i3. It’s not the cheapest bot on the block, but its cleaning chops, attractive design, good software, and robust, easily-repairable hardware make it a good choice for spending a smaller budget. \nThe i5 brings mopping capability to the lower end of iRobot’s line via a swappable mopping bin that adds a flat mopping pad and a sizable 210ml reservoir. There’s no carpet avoidance, though, so I had to roll up the ends of my carpets to block it from going on them. \nBut this bot is best as a vacuum, and it cleans almost as well as iRobot’s higher-end j7 but for a lot less money. It has slightly lower suction power, but it boasts Roomba’s signature dual roller rubber brushes, which do an excellent job of removing pet hair from hardwood floors and sucking up oatmeal from plush carpets. These are slightly different from the Roborock dual brushes, and I find the nubs make them more effective at digging out the dirt, especially from carpet. \n\nThe i5 has mapping and room-specific cleaning, so you can send it to clean the kitchen if you want. However, unlike my top pick, the Tapo RV30, there’s no option to set virtual keep-out zones. If you have somewhere you don’t want the bot to roam, you’ll need to buy iRobot’s virtual wall towers. It also has a relatively small bin, but you can pair it with an auto-empty base (although that doubles the cost).  \nThe i5 is a solid vacuum with big wheels and a big bumper that can easily tackle any floor surface you throw at it. It can manage most transitions and is one of the only vacs I’ve tested that doesn’t get stuck on the uneven wooden floors in my screened-in porch. It does tend to bump into things, but it gets almost everywhere you want it to and won’t be put off by a bed skirt. But if you have delicate items on rickety tables, watch out.\n\nAs with all Roombas, the i5 is easy to self-repair, and you can buy (not inexpensive) replacements for all its parts. I’ve actually rebuilt an i3 (the previous model) after it rolled over some dog poop. There’s no obstacle avoidance here; you have to bump up to the Roomba j7 for that (which, if you can get it on sale anywhere, is a great robot vacuum.)  \niRobot also offers the Combo j5 for $529.99 (currently on sale for $249.99 at Amazon), adding more advanced mapping, including virtual keep-out zones and better obstacle and carpet detection. It also has a shinier finish, whereas the i5 retains the fabric-covered body of the i3. If you can find the j5 on sale for close to or less than the i3 (it’s $379 with the auto-empty dock on Amazon at the time of writing), go for it. Otherwise, the i3 is your best bet for a budget Roomba. \nBest budget robot vacuum without Wi-Fi\nSuction power: 2,000Pa / Dustbin capacity: 600ml / Runtime: 100 mins / Brush style: single bristle / rubber hybrid / Auto-empty dock option: no / Mapping: no / Keep-out zones: no / Works with: n/a\nThe Eufy 11S Max is a rarity — a robot vacuum that doesn’t use Wi-Fi at all. There’s not even an app. Instead, you just press the button, and off it trundles. It also comes with a remote if you’d rather not get up off the couch, and you can use that to program it to clean at a specific time. \nThe 11S is super slim, 72.5 mm high, with no lidar tower, so it will get under most couches and very quiet. It has a big 600ml bin, and I was very impressed with how much it got up off my hardwood floors, even with its relatively small 2,000Pa of suction. There are three cleaning levels, and at the lowest, it registers around 55db, quiet enough to run in a home office.\nIt does have a smallish battery — only 100 minutes of runtime — but it will go back and recharge. For $200, this is the perfect budget bot for those wary of or who don’t want to deal with an app and Wi-Fi. It’s a bump-and-roll bot, meaning there are no real navigation skills. But it has plenty of replaceable parts, including the battery and wheels, so you can keep it going for a long time.\nBest self-cleaning, self-emptying robot vacuum / mop under $500\nSuction Power: 5,100Pa / Dustbin capacity: 360ml / Self-empty dock option: Yes / Mopping option: Yes / Mapping: Yes, lidar / Suction power: 5,100Pa / Keep-out zones: Yes, virtual / Runtime/Battery: 180 mins, 5,400mAh / Brush style: Single rubber bristle hybrid / Works with: Amazon Alexa, Google Home\nThe Yeedi Cube is the least expensive robot vacuum with the same kind of multifunction dock and high-end features as robots over $1,000. This means it can automatically fill its onboard water tank, clean and dry its mop, and empty the bin. It also has more advanced obstacle avoidance tech than most budget bots, although, unlike the pricier bots, it uses lasers to see objects, not an AI-powered camera, which is less effective. While it originally retailed for $699.99, it’s now an older model and is regularly on sale for less than $500.\nThe Yeedi resembles the Shark and Roomba in its full-speed-ahead nature. It will just run into things, and if it can clean them, great! It also only goes around larger objects. So, while it ably sucked up Cheerios and picked up all the oatmeal flakes, it got stuck on cords and socks. Definitely keep it away from pet waste.\n\nThe Yeedi’s mopping prowess is impressive. It scrubs the floor using a thin microfiber cloth that vibrates 2,500 times a minute to get up grime. The dock cleans the mopping pad, drains the dirty water, and auto empties the bin, but the robot carries its one-liter water tank around on its back, so it doesn’t need to go back and refill during a run.\nOne downside is that it uses a single hybrid rubber / bristle brush, which gets tangled with hair. However, combined with 5,100Pa of suction power, it did a good job of picking up dirt from the floors.\nI really liked the handle; it makes it easy to pick up the vacuum and put it where you want to clean. An onboard spot clean button means you don’t need to fuss with the app to get it to clean up a dedicated area. The map offers room-specific cleaning and keep-out zones for vacuuming and mopping but can be a bit fiddly to use.\nWhat’s coming next\n\niRobot’s new Roomba lineup includes several budget-friendly options — including the $319.99 Roomba 105 Combo and the $469.99 Roomba 205 DustCompactor Combo, neither of which we’ve tested. Both entry-level models can vacuum and mop, offer lidar navigation and mapping, and tout 7,000Pa of suction power. They also both offer virtual keep-out zones and automatic carpet detection and avoidance; however, the 205 features a new onboard debris and dust compactor, which iRobot says allows you to go eight weeks without emptying the vacuum.\n\nUpdate, June 10th: Adjusted pricing / availability and added several new links."
  },
  {
    "title": "Android 16 is here, but its big redesign isn’t ready",
    "url": "https://www.theverge.com/news/684994/android-16-material-3-expressive-redesign-not-ready",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-06-10T17:23:55-04:00",
    "published_datetime": "2025-06-10T22:23:55",
    "summary": "\n\n\n\nGoogle rolled out a bunch of new features with Android 16 on Tuesday, but the company appears to be saving its big Material 3 Expressive redesign for a future update. The update doesn’t feature the design language’s revamped elements, and a source tells Android Authority’s Mishaal Rahman that Google is planning to launch the new look on September 3rd, 2025, instead.\nWith Android 16, Google is starting to roll out support for Live Updates with progress-centric notifications and enhanced settings for users with hearing aids. The updates are coming to Pixel devices first, but according to Google, Android users will have to wait for another update to see Live Updates “fully realized.”\n\nGoogle officially took the wraps off Material 3 Expressive following a leak last month, which features updates to icon shapes, type styles, and color palettes with “more natural, springy animations” across the Android interface. You can still check out some Material 3 Expressive updates in the Android 16 QPR1 beta that’s available now, but Rahman notes that Google plans on launching more design updates in the next Android 16 QPR1 Beta 2.\nGoogle is expected to include Android’s desktop mode in a September launch as well. The new mode, which builds on Samsung’s DeX platform, optimizes apps and content for large-screen devices. It will allow you to resize multiple app windows across your screens, as well as connect phones and tablets to external displays for a desktop-like experience. Users with a Pixel 8 and up can try out these features in the Android 16 beta, but the rest of us will likely have to wait a few more months.",
    "content": "\n\n\n\nGoogle rolled out a bunch of new features with Android 16 on Tuesday, but the company appears to be saving its big Material 3 Expressive redesign for a future update. The update doesn’t feature the design language’s revamped elements, and a source tells Android Authority’s Mishaal Rahman that Google is planning to launch the new look on September 3rd, 2025, instead.\nWith Android 16, Google is starting to roll out support for Live Updates with progress-centric notifications and enhanced settings for users with hearing aids. The updates are coming to Pixel devices first, but according to Google, Android users will have to wait for another update to see Live Updates “fully realized.”\n\nGoogle officially took the wraps off Material 3 Expressive following a leak last month, which features updates to icon shapes, type styles, and color palettes with “more natural, springy animations” across the Android interface. You can still check out some Material 3 Expressive updates in the Android 16 QPR1 beta that’s available now, but Rahman notes that Google plans on launching more design updates in the next Android 16 QPR1 Beta 2.\nGoogle is expected to include Android’s desktop mode in a September launch as well. The new mode, which builds on Samsung’s DeX platform, optimizes apps and content for large-screen devices. It will allow you to resize multiple app windows across your screens, as well as connect phones and tablets to external displays for a desktop-like experience. Users with a Pixel 8 and up can try out these features in the Android 16 beta, but the rest of us will likely have to wait a few more months."
  },
  {
    "title": "Google is offering employee buyouts in Search and other orgs",
    "url": "https://www.theverge.com/google/684966/google-buyouts-search-org",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-06-10T17:21:38-04:00",
    "published_datetime": "2025-06-10T22:21:38",
    "summary": "\n\n\n\nGoogle is starting to offer buyouts to US-based employees in its sprawling Search organization, along with other divisions like marketing, research, and core engineering, according to multiple employees familiar with the matter.\nThe buyouts, which Google is referring to as a \"voluntary exit program,\" are currently not being offered to employees in DeepMind, Google Cloud, YouTube, or Google's central ad sales organization. Employees in Google's platforms and services group, which includes Android and the Pixel line of devices, were offered buyouts earlier this year before the company enacted layoffs. It's unclear if more layoffs will follow this week's buyout announcement. Employees in some orgs are being offered a minimum of 14 weeks' pay with a July 1st enrollment deadline. \nOther parts of Google, including YouTube, are also requiring US employees within a 50-mile radius of an office to return to work at least three days a week by September, or be laid off with severance.\nIn an internal memo I obtained, Nick Fox, the head of Google's wider \"Knowledge and Information\" group that includes Search, called the buyout program a \"supportive exit path for those of you who don't feel a …\nRead the full story at The Verge.",
    "content": "\n\n\n\nGoogle is starting to offer buyouts to US-based employees in its sprawling Search organization, along with other divisions like marketing, research, and core engineering, according to multiple employees familiar with the matter.\nThe buyouts, which Google is referring to as a \"voluntary exit program,\" are currently not being offered to employees in DeepMind, Google Cloud, YouTube, or Google's central ad sales organization. Employees in Google's platforms and services group, which includes Android and the Pixel line of devices, were offered buyouts earlier this year before the company enacted layoffs. It's unclear if more layoffs will follow this week's buyout announcement. Employees in some orgs are being offered a minimum of 14 weeks' pay with a July 1st enrollment deadline. \nOther parts of Google, including YouTube, are also requiring US employees within a 50-mile radius of an office to return to work at least three days a week by September, or be laid off with severance.\nIn an internal memo I obtained, Nick Fox, the head of Google's wider \"Knowledge and Information\" group that includes Search, called the buyout program a \"supportive exit path for those of you who don't feel a …\nRead the full story at The Verge."
  },
  {
    "title": "More than a million people now have Alexa Plus",
    "url": "https://www.theverge.com/news/684560/amazon-alexa-plus-one-million-users-coming-summer-2025",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-06-10T17:15:39-04:00",
    "published_datetime": "2025-06-10T22:15:39",
    "summary": "\n\nAlexa Plus was announced in February 2025 and is now rolling out to users in an Early Access program.\n\nWhile a smarter Siri may have been a no-show at WWDC, Alexa Plus, the generative AI-powered overhaul of Amazon’s voice assistant, is finally appearing in the wild. \nNo one at The Verge has access yet, but Amazon spokesperson Eric Sveum tells me over a million people now do — up from “hundreds of thousands” just last month. And while it was initially a struggle to find anyone who had it, there is now evidence that Alexa Plus is finally out there, based on recent Reddit and Facebook user posts.\nAccording to Sveum, Alexa Plus is now being rolled out to customers with Echo smart speakers and displays “at an increasing pace” following its late March launch, and the company will “make it even more broadly available over the summer,” he says.\nThe slow rollout is down to Panos Panay’s insistence that all Alexa Plus problems be ironed out before the full release, according to a recent profile of the new head of Amazon devices and services in The Wall Street Journal. It reported that “he knows that getting Alexa+ right is critical because it will be released to millions of people who depend on the technology across multiple devices. It’s a very public rollout.”\nFirst announced in September 2023, the supercharged Alexa faced more than a year of delays, reportedly in part due to the challenges of imposing the new technology on top of the existing Alexa assistant. \nIt was finally relaunched under Panay last February as an entirely new assistant, and was slated to roll out to US users in the Early Access program in March. When it eventually gets its full release, the new assistant will cost $19.99 a month and be free for Prime members.\nHowever, it sounds like it’s not fully ready for primetime. Several features announced at the launch event aren’t yet in Early Access. According to Sveum these include asking Alexa to “jump to your favorite scene on Fire TV; order groceries hands-free; order delivery through Grubhub; schedule your next spa visit; brainstorm the perfect gift idea; set personalized reminders and Routines for your family; create personalized music — on the fly” and “Access Alexa+ on browser.” That last one feels big, as personal computers are a place that Alexa has long struggled to gain traction and is somewhere it will need to be to compete with ChatGPT, Gemini, etc.\n\nSveum says that these missing features “will ship over the coming weeks and months” and that nearly 90 percent of announced features are live in Early Access. These include the big one, a more conversational voice assistant, which I tested briefly at the launch event. Plus, the ability to ask Alexa to remember important details you tell it and recall things from documents you’ve sent to it (Alexa now has its own email address).\nSeveral features announced at the launch event are still not part of the Early Access program.\nAlexa Plus can also manage your calendar and move music from room to room, says Sveum. It can book you an Uber, find tickets for an upcoming event, and source someone to come fix something via Thumbtack. For smart home control, you can create Alexa Routines by voice, control multiple devices at once, and customize your own smart home widget on Echo Show devices. Smart cooking timers are also live, says Sveum.\n“A lot of customers are telling us they love having natural, free-flowing conversations with Alexa. It enables them to complete more complex requests like controlling multiple smart home devices at once, deep dive on music or trending topics,” Sveum says. “We’re also getting lots of positive feedback about how easy and helpful it is to get things done — like coordinating calendars, making reservations, and taking care of weekly meal planning.”\nThere haven’t been any formal reviews of Alexa Plus yet (Amazon PR seems to be keeping a tight lid on this one), but one USA Today columnist got in through the Early Access program. He was largely complimentary about the experience, writing he’s “been very pleased – and occasionally quite impressed.” \nThis is also the general vibe on Facebook and Reddit user groups from those with access, but there are clearly some bugs to work out. “It’s early days, but it feels a tiny bit closer to what I have with ChatGPT,” said one Reddit user. \nAnother user agreed, noting they liked how it remembered things they mentioned to it and could recall them. But they did say they weren’t happy that Alexa couldn’t access some smart temperature sensors that the previous Alexa could. One user said controlling multiple smart home devices at once was impressive, but another said they reverted to regular Alexa as the Plus version couldn’t control their smart air fryer.\nControl of smart home devices is clearly going to be a huge hurdle here. Existing smart voice assistants with their command and control structure can generally be relied upon to do the correct thing (assuming they heard/understood you). However, the transition to these more conversational, intuitive assistants is potentially fraught with danger, especially when it comes to controlling things in your home. Still, I’m very much looking forward to putting it to the test.",
    "content": "\n\nAlexa Plus was announced in February 2025 and is now rolling out to users in an Early Access program.\n\nWhile a smarter Siri may have been a no-show at WWDC, Alexa Plus, the generative AI-powered overhaul of Amazon’s voice assistant, is finally appearing in the wild. \nNo one at The Verge has access yet, but Amazon spokesperson Eric Sveum tells me over a million people now do — up from “hundreds of thousands” just last month. And while it was initially a struggle to find anyone who had it, there is now evidence that Alexa Plus is finally out there, based on recent Reddit and Facebook user posts.\nAccording to Sveum, Alexa Plus is now being rolled out to customers with Echo smart speakers and displays “at an increasing pace” following its late March launch, and the company will “make it even more broadly available over the summer,” he says.\nThe slow rollout is down to Panos Panay’s insistence that all Alexa Plus problems be ironed out before the full release, according to a recent profile of the new head of Amazon devices and services in The Wall Street Journal. It reported that “he knows that getting Alexa+ right is critical because it will be released to millions of people who depend on the technology across multiple devices. It’s a very public rollout.”\nFirst announced in September 2023, the supercharged Alexa faced more than a year of delays, reportedly in part due to the challenges of imposing the new technology on top of the existing Alexa assistant. \nIt was finally relaunched under Panay last February as an entirely new assistant, and was slated to roll out to US users in the Early Access program in March. When it eventually gets its full release, the new assistant will cost $19.99 a month and be free for Prime members.\nHowever, it sounds like it’s not fully ready for primetime. Several features announced at the launch event aren’t yet in Early Access. According to Sveum these include asking Alexa to “jump to your favorite scene on Fire TV; order groceries hands-free; order delivery through Grubhub; schedule your next spa visit; brainstorm the perfect gift idea; set personalized reminders and Routines for your family; create personalized music — on the fly” and “Access Alexa+ on browser.” That last one feels big, as personal computers are a place that Alexa has long struggled to gain traction and is somewhere it will need to be to compete with ChatGPT, Gemini, etc.\n\nSveum says that these missing features “will ship over the coming weeks and months” and that nearly 90 percent of announced features are live in Early Access. These include the big one, a more conversational voice assistant, which I tested briefly at the launch event. Plus, the ability to ask Alexa to remember important details you tell it and recall things from documents you’ve sent to it (Alexa now has its own email address).\nSeveral features announced at the launch event are still not part of the Early Access program.\nAlexa Plus can also manage your calendar and move music from room to room, says Sveum. It can book you an Uber, find tickets for an upcoming event, and source someone to come fix something via Thumbtack. For smart home control, you can create Alexa Routines by voice, control multiple devices at once, and customize your own smart home widget on Echo Show devices. Smart cooking timers are also live, says Sveum.\n“A lot of customers are telling us they love having natural, free-flowing conversations with Alexa. It enables them to complete more complex requests like controlling multiple smart home devices at once, deep dive on music or trending topics,” Sveum says. “We’re also getting lots of positive feedback about how easy and helpful it is to get things done — like coordinating calendars, making reservations, and taking care of weekly meal planning.”\nThere haven’t been any formal reviews of Alexa Plus yet (Amazon PR seems to be keeping a tight lid on this one), but one USA Today columnist got in through the Early Access program. He was largely complimentary about the experience, writing he’s “been very pleased – and occasionally quite impressed.” \nThis is also the general vibe on Facebook and Reddit user groups from those with access, but there are clearly some bugs to work out. “It’s early days, but it feels a tiny bit closer to what I have with ChatGPT,” said one Reddit user. \nAnother user agreed, noting they liked how it remembered things they mentioned to it and could recall them. But they did say they weren’t happy that Alexa couldn’t access some smart temperature sensors that the previous Alexa could. One user said controlling multiple smart home devices at once was impressive, but another said they reverted to regular Alexa as the Plus version couldn’t control their smart air fryer.\nControl of smart home devices is clearly going to be a huge hurdle here. Existing smart voice assistants with their command and control structure can generally be relied upon to do the correct thing (assuming they heard/understood you). However, the transition to these more conversational, intuitive assistants is potentially fraught with danger, especially when it comes to controlling things in your home. Still, I’m very much looking forward to putting it to the test."
  }
]