[
  {
    "title": "Meta’s beef with the press flares at its antitrust trial",
    "url": "https://www.theverge.com/politics/666507/meta-tech-press-antitrust-trial",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-05-13T20:35:17-04:00",
    "published_datetime": "2025-05-14T01:35:17",
    "summary": "\n\n\n\nLong-simmering tension between Silicon Valley and the press that covers it is surfacing during the Federal Trade Commission's antitrust trial against Meta. \nDuring a heated cross-examination of the FTC's key economic expert, Scott Hemphill, Meta's lead attorney, Mark Hansen, noted that Hemphill joined Facebook co-founder Chris Hughes and former Biden official Tim Wu in pitching regulators on an antitrust probe of the company back in 2019. The pitch deck for the probe that was shown in court included \"public recognition\" of the company's aggressive acquisition strategy from two reporters: Kara Swisher, who currently hosts two podcasts for The Verge's parent company, Vox Media, and Om Malik, the founder of the early tech blog GigaOm who is now a venture capitalist.\nIn an attempt to undercut Hemphill's credibility, Hansen caught Swisher and Malik in the crossfire. He called Malik a \"failed blogger\" with an axe to grind against Meta. He then suggested that Swisher, whom he referred to as a Vanity Fair columnist (she last wrote for the site in 2015), was similarly biased against the company. In court, he projected a headline about her recently calling Mark Zuckerberg a \"small little  …\nRead the full story at The Verge.",
    "content": "\n\n\n\nLong-simmering tension between Silicon Valley and the press that covers it is surfacing during the Federal Trade Commission's antitrust trial against Meta. \nDuring a heated cross-examination of the FTC's key economic expert, Scott Hemphill, Meta's lead attorney, Mark Hansen, noted that Hemphill joined Facebook co-founder Chris Hughes and former Biden official Tim Wu in pitching regulators on an antitrust probe of the company back in 2019. The pitch deck for the probe that was shown in court included \"public recognition\" of the company's aggressive acquisition strategy from two reporters: Kara Swisher, who currently hosts two podcasts for The Verge's parent company, Vox Media, and Om Malik, the founder of the early tech blog GigaOm who is now a venture capitalist.\nIn an attempt to undercut Hemphill's credibility, Hansen caught Swisher and Malik in the crossfire. He called Malik a \"failed blogger\" with an axe to grind against Meta. He then suggested that Swisher, whom he referred to as a Vanity Fair columnist (she last wrote for the site in 2015), was similarly biased against the company. In court, he projected a headline about her recently calling Mark Zuckerberg a \"small little  …\nRead the full story at The Verge."
  },
  {
    "title": "DJI said Mavic 4 Pro wouldn’t launch in US but these stores are selling it anyhow",
    "url": "https://www.theverge.com/drone/666425/dji-mavic-4-pro-on-sale-preorder-adorama-bh-photo",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-05-13T18:49:24-04:00",
    "published_datetime": "2025-05-13T23:49:24",
    "summary": "\n\n\n\nBy the time you read these words, it's quite possible that Adorama will be out of stock of the new DJI Mavic 4 Pro. But when I wrote them, the US-based retailer was still selling a drone that wasn't supposed to go on sale in the US at all, with roughly 70 left in stock.\nThis morning, I wrote how DJI was skipping the US with its most advanced drone yet, citing Trump's tariffs among other reasons for the decision. DJI did not send the drone to US reviewers, and it wouldn't provide US prices when we asked.\nBut Adorama and B&H, two rival camera stores based in New York City, apparently didn't get the message!\n\n  @verge It might be a while until you can buy the new DJI Mavic 4 Pro in the US. #dji #mavic4pro #drone #tech #techtok  ♬ original sound - The Verge  \n\nToday, they both listed the drone for $2,699 - or $3,549 for the Fly More Kit, or $4,649 for the Creator Combo with the fancy new controller with the folding sticks and swiveling 1600-nit screen, or $1,299 for that controller all by its lonesome. B&H even issued a press release. \nB&H is only offering preorders today; I confirmed with Miguel Perez in the store's drone department that \"we don't yet have it in stock,\" and he  …\nRead the full story at The Verge.",
    "content": "\n\n\n\nBy the time you read these words, it's quite possible that Adorama will be out of stock of the new DJI Mavic 4 Pro. But when I wrote them, the US-based retailer was still selling a drone that wasn't supposed to go on sale in the US at all, with roughly 70 left in stock.\nThis morning, I wrote how DJI was skipping the US with its most advanced drone yet, citing Trump's tariffs among other reasons for the decision. DJI did not send the drone to US reviewers, and it wouldn't provide US prices when we asked.\nBut Adorama and B&H, two rival camera stores based in New York City, apparently didn't get the message!\n\n  @verge It might be a while until you can buy the new DJI Mavic 4 Pro in the US. #dji #mavic4pro #drone #tech #techtok  ♬ original sound - The Verge  \n\nToday, they both listed the drone for $2,699 - or $3,549 for the Fly More Kit, or $4,649 for the Creator Combo with the fancy new controller with the folding sticks and swiveling 1600-nit screen, or $1,299 for that controller all by its lonesome. B&H even issued a press release. \nB&H is only offering preorders today; I confirmed with Miguel Perez in the store's drone department that \"we don't yet have it in stock,\" and he  …\nRead the full story at The Verge."
  },
  {
    "title": "Here are the best robot vacuum deals available right now",
    "url": "https://www.theverge.com/24350561/best-robot-vacuum-mop-irobot-roomba-eufy-roborock-deals-sale",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-05-13T18:46:37-04:00",
    "published_datetime": "2025-05-13T23:46:37",
    "summary": "\n\nA number of excellent models are on sale right now, including the SwitchBot S10. | Photo by Jennifer Pattison Tuohy / The Verge\n\nWe’re in an age where you can realistically delegate tasks to smart hunks of metal, whether it’s a self-driving car or a robot that can clean on your behalf. Most of us probably won’t be able to afford the helpful sentient humanoids being developed in our lifetimes, but robot vacuums are an affordable way to experience that promised utopia right now.\nToday’s floor cleaners are also more advanced than ever. In addition to vacuuming, many of the best models can now mop, allowing you to tackle both carpet and hardwood flooring. Some can automatically dispense of their trash and dirty water, too, and clean their own components without intervention. Soon, we’ll even have models that can pick up dirty laundry and purify the air in your home, preventing you from having to lift a finger.\n\n\nThe best Roborock dealsThe best Dreame dealsThe best SwitchBot dealsThe best Eufy dealsThe best Yeedi dealsThe best Shark dealsOther robot vacuum deals\n\nBut if you need something relatively affordable for daily cleaning, you’d be surprised how little you have to pay for premium features. Below, we’ve listed the best deals currently available on a slate of Verge-approved robot vacuums, whether you prefer a budget entry-level model from Yeedi or a top-of-the-line offering from iRobot, Dreame, and more.\nThe best Roborock deals\nRoborock’s S8 MaxV Ultra — our pick for the best robot vacuum overall — is available from Best Buy, Roborock, and Amazon for $1,299.99 ($500 off), which is $200 shy of its best price to date. The combination of a 10,000Pa suction power and dual rubber roller brushes makes it a terrific vacuum, one that can easily pick up pet hair and other debris. It can also mop with great efficiency thanks to a sonic mopping system that vibrates the mop pad 4,000 times a minute, allowing it to clean sticky juices, thick condiments, and other common spills. The mop arm can extend to cover corners and baseboard edges, too.\nThe S8 MaxV Ultra’s camera-equipped AI obstacle avoidance makes it the best navigator in Roborock’s lineup and one of the top models overall, though it’s not quite as strong as Roomba’s. The mobile app offers ample options to customize cleaning zones and schedules, and you can use its dedicated voice assistant to start and stop routines. It’s also a Matter-ready robot that’s compatible with Amazon Alexa, Google Home, and Apple Home.\nThe Roborock S8 Plus is another great robot vacuum / mop hybrid that’s available for $519.99 ($480 off) — its second-best price to date — from Walmart and Roborock. It offers a vibrating mop pad that scrubs floors well, and, like the S8 MaxV Ultra, it features dual rubber roller brushes. It’s not as powerful as the MaxV Ultra given its 6,000Pa of suction, but it still does a good job of sucking up dirt from carpets. It also lacks a water tank, though you do get good obstacle detection and a smaller auto-empty dock that saves space.\nThe best Dreame deals\nThe Dreame X40 Ultra is another mopping robot, and while it’s on the more expensive side, you can currently pick it up for $999.99 ($500 off) — $100 shy of its all-time low — from Dreame and Amazon. You’re paying a premium for 12,000Pa of suction power and a pair of removable, self-retracting mop pads, which it can automatically clean and dry on its own using the included base. It can also empty its own bin and refill its own water tank.\nThe Dreame X40 Ultra features an extendable side brush and mop pads, too, offering better coverage for baseboards, corners, and the underside of your furniture. It uses a combination of AI-powered cameras and “3D-structured light” (presumably based on lidar technology) to map and navigate rooms, with customizable keep-out zones and more functions available in the app. There’s also a dirt detection system that can identify messier spills and adjust its cleaning routine accordingly.\nThe Dream L20 Ultra is available for an all-time low of $549.98 ($450 off) at Amazon. The L20 Ultra is an excellent alternative to Dreame’s newer flagship robots, including the X40. It lacks a bit of power in comparison, though its 7,000Pa of suction power is still enough for most cleaning jobs. It also doesn’t have the L40’s tri-cut brush, which makes the step-up model more efficient at picking up pet hair. The only other real advantage the X40 holds over the L20 is its self-extending arms for vacuuming (though the dual mop pads can extend a bit for baseboard and corner coverage), nor does it have dirt detection.\nThe L20 Ultra’s base station is rather large, but it can take care of the entire cleaning process, including emptying the dustbin, emptying and refilling the water tanks, and washing and drying the mop pads. It doesn’t have a heated cleaning function for the mop pads, however. It uses a lidar-based AI-powered navigation system, and you can prompt it to start cleaning by voice using Amazon Alexa and Google Assistant voice commands.\nThe best SwitchBot deals\nThe SwitchBot S10 is available with a free water tank for $459.99 ($740 off) — $69 shy of its all-time low — when you check out via Roborock’s online storefront with promo code MDYLOM. The S10 is one of the most affordable robot vacuum / mop hybrids you can buy, one that can refill its own tank so long as you hook the battery-powered base station into your home’s plumbing. It can also dry its own mop pads and empty its own bin at a separate docking bay, and offers enough capacity to run for up to 90 days without intervention.\nThe S10’s self-cleaning roller mop is more effective than the typical pads we see in most other units, but it’s also limited to a smaller coverage area. It only has a single roller brush for vacuuming, but its respectable 6,500Pa suction can make up for it. And while it has lidar mapping and AI-powered obstacle avoidance, we found it still has a tendency to get stuck on laundry, bath mats, and other obstacles. The S10 is also one of the few robovacs with Matter support, however, which effectively enables native control through Apple Home, Google Home, and Alexa (though said platforms don’t yet fully support robot vacuums).\nRead our SwitchBot S10 review.\nThe SwitchBot K10 Plus is also available for an all-time low of $199.99 ($200 off) directly from SwitchBot with promo code LMTM120. At 3.6 inches high and 9.8 inches wide, it’s a more petite option if you want something that can maneuver tighter spaces, which it does to decent success with a lidar-based mapping system that supports digital keep-out zones. It only has 2,500Pa suction, but that should be powerful enough to lift dirt in all but the deepest carpeting. You can also attach disposable mopping pads, though their mopping function doesn’t work well. The K10 Plus comes with a self-emptying dock that can hold a respectable four liters of dirt before it needs emptying.\nThe best Eufy deals\nThe Eufy X10 Pro Omni, our current pick for the best midrange robot vacuum / mop, is now available at Amazon for $699.99 ($100 off), which is about $150 shy of the all-time low we last saw during Amazon’s Big Spring Sale. You can also grab it directly from Eufy for the same price when you use promo code WS24T2351121 at checkout.\nThe X10 Pro Omni is a bit of a novelty, at least in comparison to other robovacs in its price range, in that it offers AI-powered obstacle detection, which allows it to deftly navigate cables and other clutter. It also features a slew of functions you’d expect from top-of-the-line models, including 8,000Pa of suction power, speedy lidar-powered mapping, and oscillating dual spinning brushes for mopping.\nMind you, none of these features are as effective as they are on more premium models, though the result is an all-in-one bot that punches above its weight. Plus, it has heated mop drying and onboard water reservoir, the latter of which prevents it from having to return to its multifunction auto-empty / wash / fill dock too frequently.\nIf you’re looking for a bump-and-roll model that’s relatively budget-friendly, the Eufy 11S Max is on sale at Amazon for just $159.99 ($90 off). The 11S Max stands out from other robovacs because it doesn’t use Wi-Fi, meaning it doesn’t require you to fiddle with a mobile app on your phone. Instead, you can control it using an on-board button or with the included remote, which also allows you to create cleaning schedules. It’s relatively quiet and reliable, too, with 2,000Pa of suction power and replaceable parts, making it a great long-term investment for those who want something basic.\nThe best Yeedi deals\nThe Yeedi Cube is currently down to an all-time low of $246.99 ($243 off) at Amazon for Prime members. It’s not easy to find a self-emptying / self-cleaning vacuum at this price, as those features are typically only available on robots that cost upward of $600 or more.\nWith 5,100Pa of suction power, the Cube can tackle most common vacuuming scenarios, though its single hybrid rubber / bristle brush can get easily tangled with pet hair. It mops better than most models in its range, however, namely because its vibrating microfiber pads can actually scrub your floors. The Cube uses lasers for object avoidance, too, though it’s not as effective for navigation as those with lidar and AI smarts. It can avoid large furniture and other objects, but it might need your help rerouting around cables, toys, and laundry. Still, we found it navigates better than most other robots under $300.\nThe best Shark deals\nThe Shark Matrix Plus 2-in-1 is a great robot vacuum / mop hybrid that’s now on sale for an all-time low of $379.99 ($320 off) at Amazon, Best Buy, and directly from Shark. Before the Eufy X10 Pro Omni took its place, the Matrix Plus 2-in-1 was our runner-up pick for those seeking a midrange robot vacuum that mops and automatically empties its own bin. Its vibrating, sonic mopping feature does an excellent job of scrubbing hardwood floors; however, keep in mind that you’ll have to fill and attach the mop reservoir manually.\n\nOther robot vacuum deals\nUpdate, May 13th: Updated to reflect current pricing / availability and several new deals, including one for the Deebot X8 Pro Omni.\n",
    "content": "\n\nA number of excellent models are on sale right now, including the SwitchBot S10. | Photo by Jennifer Pattison Tuohy / The Verge\n\nWe’re in an age where you can realistically delegate tasks to smart hunks of metal, whether it’s a self-driving car or a robot that can clean on your behalf. Most of us probably won’t be able to afford the helpful sentient humanoids being developed in our lifetimes, but robot vacuums are an affordable way to experience that promised utopia right now.\nToday’s floor cleaners are also more advanced than ever. In addition to vacuuming, many of the best models can now mop, allowing you to tackle both carpet and hardwood flooring. Some can automatically dispense of their trash and dirty water, too, and clean their own components without intervention. Soon, we’ll even have models that can pick up dirty laundry and purify the air in your home, preventing you from having to lift a finger.\n\n\nThe best Roborock dealsThe best Dreame dealsThe best SwitchBot dealsThe best Eufy dealsThe best Yeedi dealsThe best Shark dealsOther robot vacuum deals\n\nBut if you need something relatively affordable for daily cleaning, you’d be surprised how little you have to pay for premium features. Below, we’ve listed the best deals currently available on a slate of Verge-approved robot vacuums, whether you prefer a budget entry-level model from Yeedi or a top-of-the-line offering from iRobot, Dreame, and more.\nThe best Roborock deals\nRoborock’s S8 MaxV Ultra — our pick for the best robot vacuum overall — is available from Best Buy, Roborock, and Amazon for $1,299.99 ($500 off), which is $200 shy of its best price to date. The combination of a 10,000Pa suction power and dual rubber roller brushes makes it a terrific vacuum, one that can easily pick up pet hair and other debris. It can also mop with great efficiency thanks to a sonic mopping system that vibrates the mop pad 4,000 times a minute, allowing it to clean sticky juices, thick condiments, and other common spills. The mop arm can extend to cover corners and baseboard edges, too.\nThe S8 MaxV Ultra’s camera-equipped AI obstacle avoidance makes it the best navigator in Roborock’s lineup and one of the top models overall, though it’s not quite as strong as Roomba’s. The mobile app offers ample options to customize cleaning zones and schedules, and you can use its dedicated voice assistant to start and stop routines. It’s also a Matter-ready robot that’s compatible with Amazon Alexa, Google Home, and Apple Home.\nThe Roborock S8 Plus is another great robot vacuum / mop hybrid that’s available for $519.99 ($480 off) — its second-best price to date — from Walmart and Roborock. It offers a vibrating mop pad that scrubs floors well, and, like the S8 MaxV Ultra, it features dual rubber roller brushes. It’s not as powerful as the MaxV Ultra given its 6,000Pa of suction, but it still does a good job of sucking up dirt from carpets. It also lacks a water tank, though you do get good obstacle detection and a smaller auto-empty dock that saves space.\nThe best Dreame deals\nThe Dreame X40 Ultra is another mopping robot, and while it’s on the more expensive side, you can currently pick it up for $999.99 ($500 off) — $100 shy of its all-time low — from Dreame and Amazon. You’re paying a premium for 12,000Pa of suction power and a pair of removable, self-retracting mop pads, which it can automatically clean and dry on its own using the included base. It can also empty its own bin and refill its own water tank.\nThe Dreame X40 Ultra features an extendable side brush and mop pads, too, offering better coverage for baseboards, corners, and the underside of your furniture. It uses a combination of AI-powered cameras and “3D-structured light” (presumably based on lidar technology) to map and navigate rooms, with customizable keep-out zones and more functions available in the app. There’s also a dirt detection system that can identify messier spills and adjust its cleaning routine accordingly.\nThe Dream L20 Ultra is available for an all-time low of $549.98 ($450 off) at Amazon. The L20 Ultra is an excellent alternative to Dreame’s newer flagship robots, including the X40. It lacks a bit of power in comparison, though its 7,000Pa of suction power is still enough for most cleaning jobs. It also doesn’t have the L40’s tri-cut brush, which makes the step-up model more efficient at picking up pet hair. The only other real advantage the X40 holds over the L20 is its self-extending arms for vacuuming (though the dual mop pads can extend a bit for baseboard and corner coverage), nor does it have dirt detection.\nThe L20 Ultra’s base station is rather large, but it can take care of the entire cleaning process, including emptying the dustbin, emptying and refilling the water tanks, and washing and drying the mop pads. It doesn’t have a heated cleaning function for the mop pads, however. It uses a lidar-based AI-powered navigation system, and you can prompt it to start cleaning by voice using Amazon Alexa and Google Assistant voice commands.\nThe best SwitchBot deals\nThe SwitchBot S10 is available with a free water tank for $459.99 ($740 off) — $69 shy of its all-time low — when you check out via Roborock’s online storefront with promo code MDYLOM. The S10 is one of the most affordable robot vacuum / mop hybrids you can buy, one that can refill its own tank so long as you hook the battery-powered base station into your home’s plumbing. It can also dry its own mop pads and empty its own bin at a separate docking bay, and offers enough capacity to run for up to 90 days without intervention.\nThe S10’s self-cleaning roller mop is more effective than the typical pads we see in most other units, but it’s also limited to a smaller coverage area. It only has a single roller brush for vacuuming, but its respectable 6,500Pa suction can make up for it. And while it has lidar mapping and AI-powered obstacle avoidance, we found it still has a tendency to get stuck on laundry, bath mats, and other obstacles. The S10 is also one of the few robovacs with Matter support, however, which effectively enables native control through Apple Home, Google Home, and Alexa (though said platforms don’t yet fully support robot vacuums).\nRead our SwitchBot S10 review.\nThe SwitchBot K10 Plus is also available for an all-time low of $199.99 ($200 off) directly from SwitchBot with promo code LMTM120. At 3.6 inches high and 9.8 inches wide, it’s a more petite option if you want something that can maneuver tighter spaces, which it does to decent success with a lidar-based mapping system that supports digital keep-out zones. It only has 2,500Pa suction, but that should be powerful enough to lift dirt in all but the deepest carpeting. You can also attach disposable mopping pads, though their mopping function doesn’t work well. The K10 Plus comes with a self-emptying dock that can hold a respectable four liters of dirt before it needs emptying.\nThe best Eufy deals\nThe Eufy X10 Pro Omni, our current pick for the best midrange robot vacuum / mop, is now available at Amazon for $699.99 ($100 off), which is about $150 shy of the all-time low we last saw during Amazon’s Big Spring Sale. You can also grab it directly from Eufy for the same price when you use promo code WS24T2351121 at checkout.\nThe X10 Pro Omni is a bit of a novelty, at least in comparison to other robovacs in its price range, in that it offers AI-powered obstacle detection, which allows it to deftly navigate cables and other clutter. It also features a slew of functions you’d expect from top-of-the-line models, including 8,000Pa of suction power, speedy lidar-powered mapping, and oscillating dual spinning brushes for mopping.\nMind you, none of these features are as effective as they are on more premium models, though the result is an all-in-one bot that punches above its weight. Plus, it has heated mop drying and onboard water reservoir, the latter of which prevents it from having to return to its multifunction auto-empty / wash / fill dock too frequently.\nIf you’re looking for a bump-and-roll model that’s relatively budget-friendly, the Eufy 11S Max is on sale at Amazon for just $159.99 ($90 off). The 11S Max stands out from other robovacs because it doesn’t use Wi-Fi, meaning it doesn’t require you to fiddle with a mobile app on your phone. Instead, you can control it using an on-board button or with the included remote, which also allows you to create cleaning schedules. It’s relatively quiet and reliable, too, with 2,000Pa of suction power and replaceable parts, making it a great long-term investment for those who want something basic.\nThe best Yeedi deals\nThe Yeedi Cube is currently down to an all-time low of $246.99 ($243 off) at Amazon for Prime members. It’s not easy to find a self-emptying / self-cleaning vacuum at this price, as those features are typically only available on robots that cost upward of $600 or more.\nWith 5,100Pa of suction power, the Cube can tackle most common vacuuming scenarios, though its single hybrid rubber / bristle brush can get easily tangled with pet hair. It mops better than most models in its range, however, namely because its vibrating microfiber pads can actually scrub your floors. The Cube uses lasers for object avoidance, too, though it’s not as effective for navigation as those with lidar and AI smarts. It can avoid large furniture and other objects, but it might need your help rerouting around cables, toys, and laundry. Still, we found it navigates better than most other robots under $300.\nThe best Shark deals\nThe Shark Matrix Plus 2-in-1 is a great robot vacuum / mop hybrid that’s now on sale for an all-time low of $379.99 ($320 off) at Amazon, Best Buy, and directly from Shark. Before the Eufy X10 Pro Omni took its place, the Matrix Plus 2-in-1 was our runner-up pick for those seeking a midrange robot vacuum that mops and automatically empties its own bin. Its vibrating, sonic mopping feature does an excellent job of scrubbing hardwood floors; however, keep in mind that you’ll have to fill and attach the mop reservoir manually.\n\nOther robot vacuum deals\nUpdate, May 13th: Updated to reflect current pricing / availability and several new deals, including one for the Deebot X8 Pro Omni.\n"
  },
  {
    "title": "Judge slams lawyers for &#8216;bogus AI-generated research&#8217;",
    "url": "https://www.theverge.com/news/666443/judge-slams-lawyers-ai-bogus-research",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-05-13T18:22:47-04:00",
    "published_datetime": "2025-05-13T23:22:47",
    "summary": "\n\n\n\nA California judge slammed a pair of law firms for the undisclosed use of AI after he received a supplemental brief with “numerous false, inaccurate, and misleading legal citations and quotations.” In a ruling submitted last week, Judge Michael Wilner imposed $31,000 in sanctions against the law firms involved, saying “no reasonably competent attorney should out-source research and writing” to AI, as pointed out by law professors Eric Goldman and Blake Reid on Bluesky.\n“I read their brief, was persuaded (or at least intrigued) by the authorities that they cited, and looked up the decisions to learn more about them – only to find that they didn’t exist,” Judge Milner writes. “That’s scary. It almost led to the scarier outcome (from my perspective) of including those bogus materials in a judicial order.”\nAs noted in the filing, a plaintiff’s legal representative for a civil lawsuit against State Farm used AI to generate an outline for a supplemental brief. However, this outline contained “bogus AI-generated research” when it was sent to a separate law firm, K&L Gates, which added the information to a brief. “No attorney or staff member at either firm apparently cite-checked or otherwise reviewed that research before filing the brief,” Judge Milner writes.\nWhen Judge Milner reviewed the brief, he found that “at least two of the authorities cited do not exist at all.” After asking K&L Gates for clarification, the firm resubmitted the brief, which Judge Milner said contained “considerably more made-up citations and quotations beyond the two initial errors.” He then issued an Order to Show Cause, resulting in lawyers giving sworn statements that confirm the use of AI. The lawyer who created the outline admitted to using Google Gemini, as well as the AI legal research tools in Westlaw Precision with CoCounsel.\nThis isn’t the first time lawyers have been caught using AI in the courtroom. Former Trump lawyer Michael Cohen cited made-up court cases in a legal document after mistaking Google Gemini, then called Bard, as “a super-charged search engine” rather than an AI chatbot. A judge also found that lawyers suing a Colombian airline included a slew of phony cases generated by ChatGPT in their brief.\n“The initial, undisclosed use of AI products to generate the first draft of the brief was flat-out wrong,” Judge Milner writes. “And sending that material to other lawyers without disclosing its sketchy AI origins realistically put those professionals in harm’s way.”",
    "content": "\n\n\n\nA California judge slammed a pair of law firms for the undisclosed use of AI after he received a supplemental brief with “numerous false, inaccurate, and misleading legal citations and quotations.” In a ruling submitted last week, Judge Michael Wilner imposed $31,000 in sanctions against the law firms involved, saying “no reasonably competent attorney should out-source research and writing” to AI, as pointed out by law professors Eric Goldman and Blake Reid on Bluesky.\n“I read their brief, was persuaded (or at least intrigued) by the authorities that they cited, and looked up the decisions to learn more about them – only to find that they didn’t exist,” Judge Milner writes. “That’s scary. It almost led to the scarier outcome (from my perspective) of including those bogus materials in a judicial order.”\nAs noted in the filing, a plaintiff’s legal representative for a civil lawsuit against State Farm used AI to generate an outline for a supplemental brief. However, this outline contained “bogus AI-generated research” when it was sent to a separate law firm, K&L Gates, which added the information to a brief. “No attorney or staff member at either firm apparently cite-checked or otherwise reviewed that research before filing the brief,” Judge Milner writes.\nWhen Judge Milner reviewed the brief, he found that “at least two of the authorities cited do not exist at all.” After asking K&L Gates for clarification, the firm resubmitted the brief, which Judge Milner said contained “considerably more made-up citations and quotations beyond the two initial errors.” He then issued an Order to Show Cause, resulting in lawyers giving sworn statements that confirm the use of AI. The lawyer who created the outline admitted to using Google Gemini, as well as the AI legal research tools in Westlaw Precision with CoCounsel.\nThis isn’t the first time lawyers have been caught using AI in the courtroom. Former Trump lawyer Michael Cohen cited made-up court cases in a legal document after mistaking Google Gemini, then called Bard, as “a super-charged search engine” rather than an AI chatbot. A judge also found that lawyers suing a Colombian airline included a slew of phony cases generated by ChatGPT in their brief.\n“The initial, undisclosed use of AI products to generate the first draft of the brief was flat-out wrong,” Judge Milner writes. “And sending that material to other lawyers without disclosing its sketchy AI origins realistically put those professionals in harm’s way.”"
  },
  {
    "title": "Elon Musk’s apparent power play at the Copyright Office completely backfired",
    "url": "https://www.theverge.com/politics/666179/maga-elon-musk-sacks-copyright-office-perlmutter",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-05-13T18:17:12-04:00",
    "published_datetime": "2025-05-13T23:17:12",
    "summary": "\n\n\n\nWhat initially appeared to be a power play by Elon Musk and the Department of Government Efficiency (DOGE) to take over the US Copyright Office by having Donald Trump remove the officials in charge has now backfired in spectacular fashion, as Trump's acting replacements are known to be unfriendly - and even downright hostile - to the tech industry. \nWhen Trump fired Librarian of Congress Carla Hayden last week and Register of Copyrights Shira Perlmutter over the weekend, it was seen as another move driven by the tech wing of the Republican Party - especially in light of the Copyright Office releasing a pre-publication report saying some kinds of generative AI training would not be considered fair use. And when two men showed up at the Copyright Office inside the Library of Congress carrying letters purporting to appoint them to acting leadership positions, the DOGE takeover appeared to be complete.\nBut those two men, Paul Perkins and Brian Nieves, were not DOGE at all, but instead approved by the MAGA wing of the Trump coalition that aims to put tech companies in check. \nPerkins, now the supposed acting Register of Copyrights, is an eight-year veteran of the DOJ who served in t …\nRead the full story at The Verge.",
    "content": "\n\n\n\nWhat initially appeared to be a power play by Elon Musk and the Department of Government Efficiency (DOGE) to take over the US Copyright Office by having Donald Trump remove the officials in charge has now backfired in spectacular fashion, as Trump's acting replacements are known to be unfriendly - and even downright hostile - to the tech industry. \nWhen Trump fired Librarian of Congress Carla Hayden last week and Register of Copyrights Shira Perlmutter over the weekend, it was seen as another move driven by the tech wing of the Republican Party - especially in light of the Copyright Office releasing a pre-publication report saying some kinds of generative AI training would not be considered fair use. And when two men showed up at the Copyright Office inside the Library of Congress carrying letters purporting to appoint them to acting leadership positions, the DOGE takeover appeared to be complete.\nBut those two men, Paul Perkins and Brian Nieves, were not DOGE at all, but instead approved by the MAGA wing of the Trump coalition that aims to put tech companies in check. \nPerkins, now the supposed acting Register of Copyrights, is an eight-year veteran of the DOJ who served in t …\nRead the full story at The Verge."
  },
  {
    "title": "Apple TV&#8217;s wireless audio sync now works with Dolby Atmos",
    "url": "https://www.theverge.com/news/666418/apple-tv-4k-dolby-atmos-wireless-audio-sync-tvos-update",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-05-13T18:15:21-04:00",
    "published_datetime": "2025-05-13T23:15:21",
    "summary": "\n\n\n\nApple is pushing a new software update for Apple TV today that includes a useful feature for home theater setups: the ability to automatically calibrate the synchronization of Dolby Atmos surround sound audio with your speakers.\nThe new tvOS 18.5 update enhances Apple’s existing Wireless Audio Sync feature, introduced in 2019, that lets you use your iPhone’s microphone to calibrate audio sources with your home theater speakers. Now it can help you get your TV video synced up with Atmos audio over either AirPlay or Bluetooth by accounting for latency.\nAs pointed out by MacRumors, people have complained about Apple TV Dolby Atmos syncing issues with sound bars and other speakers on Reddit and on Apple’s community discussions page, but until now they couldn’t use Apple’s tool to try to fix things.\nAfter updating, you can calibrate your audio by going to Settings > Video and Audio > Wireless Audio Sync on your Apple TV, and following the steps from there.",
    "content": "\n\n\n\nApple is pushing a new software update for Apple TV today that includes a useful feature for home theater setups: the ability to automatically calibrate the synchronization of Dolby Atmos surround sound audio with your speakers.\nThe new tvOS 18.5 update enhances Apple’s existing Wireless Audio Sync feature, introduced in 2019, that lets you use your iPhone’s microphone to calibrate audio sources with your home theater speakers. Now it can help you get your TV video synced up with Atmos audio over either AirPlay or Bluetooth by accounting for latency.\nAs pointed out by MacRumors, people have complained about Apple TV Dolby Atmos syncing issues with sound bars and other speakers on Reddit and on Apple’s community discussions page, but until now they couldn’t use Apple’s tool to try to fix things.\nAfter updating, you can calibrate your audio by going to Settings > Video and Audio > Wireless Audio Sync on your Apple TV, and following the steps from there."
  },
  {
    "title": "Paul McCartney and Dua Lipa call on the UK to pass AI copyright transparency law",
    "url": "https://www.theverge.com/news/666379/paul-mccartney-dua-lipa-uk-ai-copyright-amendment-letter",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-05-13T18:01:30-04:00",
    "published_datetime": "2025-05-13T23:01:30",
    "summary": "\n\nDua Lipa performs on May 12th in Spain. | ﻿Photo by Aldara Zarraoa/Redferns for ABA\n\nLast week, Paul McCartney, Dua Lipa, Ian McKellen, Elton John, and hundreds of others in the UK creative industry signed an open letter backing an effort to force AI firms to reveal the copyrighted works used to train their models.  They support an amendment to the UK’s Data (Use and Access) Bill proposed by letter organizer Beeban Kidron, adding the requirement, which the UK government has opposed.\nThe British House of Lords passed the amendment yesterday, 272 to 125, reports The Guardian, and now it’s going back to the House of Commons, where the amendment could be removed again. The British government says the fight over the amendment “is holding back both the creative and tech sectors and needs to be resolved by new legislation,” writes The Guardian. \nFrom the letter:\n\nWe will lose an immense growth opportunity if we give our work away at the behest of a handful of powerful overseas tech companies, and with it our future income, the UK’s position as a creative powerhouse, and any hope that the technology of daily life will embody the values and laws of the United Kingdom.\n\nAlso signed by many media companies, music publishers, and arts organizations, the letter insists that the amendments “will spur a dynamic licensing market that will enhance the role of human creativity in the UK, positioning us as a key player in the global AI supply chain.”\nCompanies like OpenAI and Meta have been accused in court of using copyrighted material without permission to train their models. Baroness Beeban Kidron, who tabled the amendment, writes that although the UK’s creative industries welcome creative advancements enabled by AI, “…how AI is developed and who it benefits are two of the most important questions of our time.”  \n“My lords,” The Guardian quotes Kidron as saying yesterday, “it is an assault on the British economy and it is happening at scale to a sector worth £120bn to the UK, an industry that is central to the industrial strategy and of enormous cultural import.”",
    "content": "\n\nDua Lipa performs on May 12th in Spain. | ﻿Photo by Aldara Zarraoa/Redferns for ABA\n\nLast week, Paul McCartney, Dua Lipa, Ian McKellen, Elton John, and hundreds of others in the UK creative industry signed an open letter backing an effort to force AI firms to reveal the copyrighted works used to train their models.  They support an amendment to the UK’s Data (Use and Access) Bill proposed by letter organizer Beeban Kidron, adding the requirement, which the UK government has opposed.\nThe British House of Lords passed the amendment yesterday, 272 to 125, reports The Guardian, and now it’s going back to the House of Commons, where the amendment could be removed again. The British government says the fight over the amendment “is holding back both the creative and tech sectors and needs to be resolved by new legislation,” writes The Guardian. \nFrom the letter:\n\nWe will lose an immense growth opportunity if we give our work away at the behest of a handful of powerful overseas tech companies, and with it our future income, the UK’s position as a creative powerhouse, and any hope that the technology of daily life will embody the values and laws of the United Kingdom.\n\nAlso signed by many media companies, music publishers, and arts organizations, the letter insists that the amendments “will spur a dynamic licensing market that will enhance the role of human creativity in the UK, positioning us as a key player in the global AI supply chain.”\nCompanies like OpenAI and Meta have been accused in court of using copyrighted material without permission to train their models. Baroness Beeban Kidron, who tabled the amendment, writes that although the UK’s creative industries welcome creative advancements enabled by AI, “…how AI is developed and who it benefits are two of the most important questions of our time.”  \n“My lords,” The Guardian quotes Kidron as saying yesterday, “it is an assault on the British economy and it is happening at scale to a sector worth £120bn to the UK, an industry that is central to the industrial strategy and of enormous cultural import.”"
  },
  {
    "title": "The wireless GameCube controller for Switch 2 is available to preorder now",
    "url": "https://www.theverge.com/tech/666302/gamecube-switch-2-nintendo-preorder-buy",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-05-13T17:16:44-04:00",
    "published_datetime": "2025-05-13T22:16:44",
    "summary": "\n\n\n\nThe wireless GameCube controller that’s for use exclusively with the Nintendo Switch 2 can now be pre-ordered by those who have a Switch Online account. The controller costs $64.99, and is currently limited to one per account. That limitation has allowed it to remain in stock for a few hours already today. For those who’ve bought one, you’ll get it on Switch 2’s launch date, which is June 5th.\nDemand is high, so it’s likely that you’ll need to hang out in a waiting room for 30 minutes or so before you’re let in to buy one. So, don’t navigate away.\nWhile GameCube controller support on the original Switch is nothing new (made possible thanks to the GameCube controller plug-to-USB adapter, or with newer third-party USB versions based on the original controller’s design), game support for the new wireless version is quite a bit more limited. It won’t be compatible with Switch backwards compatible titles that work on the Switch 2, including Super Smash Bros. Ultimate, or at least support hasn’t been confirmed yet. Instead, its use is limited to the GameCube games that are coming to Switch Online’s Expansion Pack tier, which at launch will include The Legend of Zelda: The Wind Waker, Soulcalibur 2, and more. \nThis GameCube controller has USB-C charging, and comes with the C button that’s used to summon GameChat features. Just a reminder: GameChat will be free to use for all Nintendo Switch 2 owners through March 31st, 2026.",
    "content": "\n\n\n\nThe wireless GameCube controller that’s for use exclusively with the Nintendo Switch 2 can now be pre-ordered by those who have a Switch Online account. The controller costs $64.99, and is currently limited to one per account. That limitation has allowed it to remain in stock for a few hours already today. For those who’ve bought one, you’ll get it on Switch 2’s launch date, which is June 5th.\nDemand is high, so it’s likely that you’ll need to hang out in a waiting room for 30 minutes or so before you’re let in to buy one. So, don’t navigate away.\nWhile GameCube controller support on the original Switch is nothing new (made possible thanks to the GameCube controller plug-to-USB adapter, or with newer third-party USB versions based on the original controller’s design), game support for the new wireless version is quite a bit more limited. It won’t be compatible with Switch backwards compatible titles that work on the Switch 2, including Super Smash Bros. Ultimate, or at least support hasn’t been confirmed yet. Instead, its use is limited to the GameCube games that are coming to Switch Online’s Expansion Pack tier, which at launch will include The Legend of Zelda: The Wind Waker, Soulcalibur 2, and more. \nThis GameCube controller has USB-C charging, and comes with the C button that’s used to summon GameChat features. Just a reminder: GameChat will be free to use for all Nintendo Switch 2 owners through March 31st, 2026."
  },
  {
    "title": "Republicans push for a decadelong ban on states regulating AI",
    "url": "https://www.theverge.com/news/666288/republican-ai-state-regulation-ban-10-years",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-05-13T17:10:51-04:00",
    "published_datetime": "2025-05-13T22:10:51",
    "summary": "\n\n\n\nRepublicans want to stop states from regulating AI. On Sunday, a Republican-led House committee submitted a budget reconciliation bill that proposes blocking states from enforcing “any law or regulation” targeting an exceptionally broad range of automated computing systems for 10 years after the law is enacted — a move that would stall efforts to regulate everything from AI chatbots to online search results. \nDemocrats are calling the new provision a “giant gift” to Big Tech, and organizations that promote AI oversight, like Americans for Responsible Innovation (ARI), say it could have “catastrophic consequences” for the public. It’s a gift companies like OpenAI have recently been seeking in Washington, aiming to avoid a slew of pending and active state laws. The budget reconciliation process allows lawmakers to fast-track bills related to government spending by requiring only a majority in the Senate rather than 60 votes to pass. \nThis bill, introduced by House Committee on Energy and Commerce Chairman Brett Guthrie (R-KY), would prevent states from imposing “legal impediments” — or restrictions to design, performance, civil liability, and documentation — on AI models and “automated decision” systems. It defines the latter category as “any computational process derived from machine learning, statistical modeling, data analytics, or artificial intelligence that issues a simplified output, including a score, classification, or recommendation, to materially influence or replace human decision making.”\nThat means the 10-year moratorium could extend well beyond AI. Travis Hall, the director for state engagement at the Center for Democracy & Technology, tells The Verge that the automated decision systems described in the bill “permeate digital services, from search results and mapping directions, to health diagnoses and risk analyses for sentencing decisions.”\nDuring the 2025 legislative session, states have proposed over 500 laws that Hall says this bill could “unequivocally block.” They focus on everything from chatbot safety for minors to deepfake restrictions and disclosures for the use of AI in political ads. If the bill passes, the handful of states that have successfully passed AI laws may also see their efforts go to waste. \n“The move to ban AI safeguards is a giveaway to Big Tech that will come back to bite us.”\nLast year, California Gov. Gavin Newsom signed a law preventing companies from using a performer’s AI-generated likeness without permission. Tennessee also adopted legislation with similar protections, while Utah has enacted a rule requiring certain businesses to disclose when customers are interacting with AI. Colorado’s AI law, which goes into effect next year, will require companies developing “high-risk” AI systems to protect customers from “algorithmic discrimination.”\nCalifornia also came close to enacting the landmark AI safety law SB 1047, which would have imposed security restrictions and legal liability on AI companies based in the state, like OpenAI, Anthropic, Google, and Meta. OpenAI opposed the bill, saying AI regulation should take place at the federal level instead of having a “patchwork” of state laws that could make it more difficult to comply. Gov. Newsom vetoed the bill last September, and OpenAI has made it clear it wants to avoid having state laws “bogging down innovation” in the future.\nWith so little AI regulation at the federal level, it’s been left up to the states to decide how to deal with AI. Even before the rise of generative AI, state legislators were grappling with how to fight algorithmic discrimination — including machine learning-based systems that display race or gender bias — in areas like housing and criminal justice. Efforts to combat this, too, would likely be hampered by the Republicans’ proposal.\nDemocrats have slammed the provision’s inclusion in the reconciliation bill, with Rep. Jan Schakowsky (D-IL) saying the 10-year ban will “allow AI companies to ignore consumer privacy protections, let deepfakes spread, and allow companies to profile and deceive consumers using AI.” In a statement published to X, Sen. Ed Markey (D-MA) said the proposal “will lead to a Dark Age for the environment, our children, and marginalized communities.”\nThe nonprofit organization Americans for Responsible Innovation (ARI) compared the potential ban to the government’s failure to properly regulate social media. “Lawmakers stalled on social media safeguards for a decade and we are still dealing with the fallout,” ARI president Brad Carson said in a statement. “Now apply those same harms to technology moving as fast as AI… Ultimately, the move to ban AI safeguards is a giveaway to Big Tech that will come back to bite us.”\nThis provision could hit a roadblock in the Senate, as ARI notes that the Byrd rule says reconciliation bills can only focus on fiscal issues. Still, it’s troubling to see Republican lawmakers push to block oversight of a new technology that’s being integrated into almost everything.",
    "content": "\n\n\n\nRepublicans want to stop states from regulating AI. On Sunday, a Republican-led House committee submitted a budget reconciliation bill that proposes blocking states from enforcing “any law or regulation” targeting an exceptionally broad range of automated computing systems for 10 years after the law is enacted — a move that would stall efforts to regulate everything from AI chatbots to online search results. \nDemocrats are calling the new provision a “giant gift” to Big Tech, and organizations that promote AI oversight, like Americans for Responsible Innovation (ARI), say it could have “catastrophic consequences” for the public. It’s a gift companies like OpenAI have recently been seeking in Washington, aiming to avoid a slew of pending and active state laws. The budget reconciliation process allows lawmakers to fast-track bills related to government spending by requiring only a majority in the Senate rather than 60 votes to pass. \nThis bill, introduced by House Committee on Energy and Commerce Chairman Brett Guthrie (R-KY), would prevent states from imposing “legal impediments” — or restrictions to design, performance, civil liability, and documentation — on AI models and “automated decision” systems. It defines the latter category as “any computational process derived from machine learning, statistical modeling, data analytics, or artificial intelligence that issues a simplified output, including a score, classification, or recommendation, to materially influence or replace human decision making.”\nThat means the 10-year moratorium could extend well beyond AI. Travis Hall, the director for state engagement at the Center for Democracy & Technology, tells The Verge that the automated decision systems described in the bill “permeate digital services, from search results and mapping directions, to health diagnoses and risk analyses for sentencing decisions.”\nDuring the 2025 legislative session, states have proposed over 500 laws that Hall says this bill could “unequivocally block.” They focus on everything from chatbot safety for minors to deepfake restrictions and disclosures for the use of AI in political ads. If the bill passes, the handful of states that have successfully passed AI laws may also see their efforts go to waste. \n“The move to ban AI safeguards is a giveaway to Big Tech that will come back to bite us.”\nLast year, California Gov. Gavin Newsom signed a law preventing companies from using a performer’s AI-generated likeness without permission. Tennessee also adopted legislation with similar protections, while Utah has enacted a rule requiring certain businesses to disclose when customers are interacting with AI. Colorado’s AI law, which goes into effect next year, will require companies developing “high-risk” AI systems to protect customers from “algorithmic discrimination.”\nCalifornia also came close to enacting the landmark AI safety law SB 1047, which would have imposed security restrictions and legal liability on AI companies based in the state, like OpenAI, Anthropic, Google, and Meta. OpenAI opposed the bill, saying AI regulation should take place at the federal level instead of having a “patchwork” of state laws that could make it more difficult to comply. Gov. Newsom vetoed the bill last September, and OpenAI has made it clear it wants to avoid having state laws “bogging down innovation” in the future.\nWith so little AI regulation at the federal level, it’s been left up to the states to decide how to deal with AI. Even before the rise of generative AI, state legislators were grappling with how to fight algorithmic discrimination — including machine learning-based systems that display race or gender bias — in areas like housing and criminal justice. Efforts to combat this, too, would likely be hampered by the Republicans’ proposal.\nDemocrats have slammed the provision’s inclusion in the reconciliation bill, with Rep. Jan Schakowsky (D-IL) saying the 10-year ban will “allow AI companies to ignore consumer privacy protections, let deepfakes spread, and allow companies to profile and deceive consumers using AI.” In a statement published to X, Sen. Ed Markey (D-MA) said the proposal “will lead to a Dark Age for the environment, our children, and marginalized communities.”\nThe nonprofit organization Americans for Responsible Innovation (ARI) compared the potential ban to the government’s failure to properly regulate social media. “Lawmakers stalled on social media safeguards for a decade and we are still dealing with the fallout,” ARI president Brad Carson said in a statement. “Now apply those same harms to technology moving as fast as AI… Ultimately, the move to ban AI safeguards is a giveaway to Big Tech that will come back to bite us.”\nThis provision could hit a roadblock in the Senate, as ARI notes that the Byrd rule says reconciliation bills can only focus on fiscal issues. Still, it’s troubling to see Republican lawmakers push to block oversight of a new technology that’s being integrated into almost everything."
  },
  {
    "title": "The best robot vacuum and mop to buy right now",
    "url": "https://www.theverge.com/tech/625409/best-robot-vacuum-mops",
    "source": "The Verge",
    "category": "technology",
    "published": "2025-05-13T16:05:26-04:00",
    "published_datetime": "2025-05-13T21:05:26",
    "summary": "\n\n\n\nRobot vacuums that can both mop and sweep your floors have improved significantly in recent years. While they are still not as effective as good ol’ manual labor, if you run them regularly, they will help keep your floors cleaner with much less effort on your part.\nThe difference is that newer “combo” robot vacuum and mop models are designed to actually scrub your floors. The first robot vacuums that could also “mop” simply slapped a thin, flat microfiber pad on the bot that kind of Swiffer-ed your floor. Basically, all this was good for was getting up fine dirt that the vacuum left behind.\nA robot vacuum with a real mopping system will make your life easier \nNewer models now come with vibrating or oscillating mop pads, and some even have roller mops. Most models have onboard water tanks to keep the mops wet while in use, and many can wash and dry their mops in their charging docks, which also automatically empty and refill their water tanks, meaning less work for you.\nWhile most robot vacuums today come with some sort of mopping feature, this guide focuses on those that excel at mopping. If you’re more interested in the best vacuum, check out my guide to floor sweeping bots. \nThe downside to these combo bots with serious mopping chops is that they tend to be bigger and heavier and need more frequent intervention than regular vacuum bots. Water equals gunk, and cleaning their giant multifunction docks, even the self-cleaning ones, can be an icky job. You also have to empty and refill their tanks about once a week. \nMopping bots also need to return to their docks more frequently than robot vacuums in order to refill their onboard water tanks. This means they’ll take longer to clean your floors than a dedicated vacuuming model, but they are doing two jobs at once. Robot mops with roller mops will self-clean as they work, negating this issue, but these models are also the largest and bulkiest, as they carry a bigger water tank on board. \nCombo bots can mop and vacuum simultaneously, but for especially dirty floors, it’s best to have the option to vacuum first and then mop. A mop-only mode is also good, as you can send the bot to clean up a wet spill without it sucking up water — something they’re not designed to do, yet.\nIf you have a lot of hardwood or tile floors and constantly struggle with muddy paw prints or the general dirtiness of life with multiple pets, people, and kids, a good robot vacuum and mop combo will definitely make your life easier. \n\n\nBest robot vacuum and mopBest budget robot vacuum and mopBest midrange robot vacuum and mopBest robot vacuum and mop for a mix of hard floors and rugsBest robot vacuum and mop for hardwood floorsBest robot vacuum and mop for tile floorsBest robot vacuum and mop with a plumbing hookupHow I test robot vacuumsWhat I’m currently testing and what’s coming next\n\n\n\nA multifunction charging dock\nThis is a charging base that empties the robot’s bin, washes and dries the bot’s mops, and empties and refills its water tank. This is essential if you want to be as hands-free as possible when mopping your floor. Some offer hot water washing and drying options that will keep your pads cleaner for longer. But you’ll want to throw them in the wash eventually. A dock that can self-clean the washboard (the area where it cleans the mops) is a nice upgrade, as you won’t have to do it yourself as often.\n\n\nBig tanks (or a plumbing hookup)\nThe bigger the clean and dirty water tanks on the dock, the less often you’ll have to refill them. If the dock can connect directly to the plumbing, even better; it’s a more complicated install, but makes for a more hands-off experience long term.\n\n\nBetter mops\nMop type matters. The main options are circular and spinning, flat and vibrating, or rolling and self-cleaning. Rolling (like the beater bar on a vacuum cleaner) is my favorite because it does a better job of getting floors really clean. The greater surface area of a roller mop, combined with the self-cleaning function — the vac sprays water onto the mop as it runs — makes it a more effective option than flat or spinning mops in most cases. However, oscillating mops that can extend outwards are better at getting into grout between tiles, along baseboards, and under low furniture. \n\n\nMops that lift or drop\nIf you have low-pile rugs and carpet, mop pads that the robot can lift up (by at least 10 mm) should prevent your carpets from getting damp when the robot rolls over them. However, robots that can remove the mop pads entirely before vacuuming carpets are a good option, especially if you have high-pile rugs.\n\n\nDecent mop pressure and speed\nSpecs around mop pressure and rotation speed are similar to those for suction power on the vacuum; they matter to some extent, but what’s more important is how effective the pads are. The higher the pressure, the more effective it should be on tougher stains. The higher the rotations per minute (RPMs), the more friction the stain has to deal with. It’s hard to judge pressure, as several manufacturers don’t list it and those that do use different measurements, but 12 Newtons, roughly 2.2 pounds of downward pressure, is very good.\n\n\nA usable app\nA well-laid-out app is key. It should let you choose which rooms to clean, and in what order. Generally, you want a mopping bot to clean the dirtiest room last (think bathroom or hallway) to avoid cross-contamination. I also look for the option to mop only, in addition to mop and vacuum, or vacuum then mop, and, of course, vacuum only.\n\n\nBest robot vacuum and mop\nMultifunction Dock: Yes, auto empty (3L) and drain/refill (4L dirty, 4L clean) / Mop style: Roller / Mop washing: Yes, hot water and hot air drying / Mop pressure: 4,000Pa at 200 RPM / Mop lift: Yes, 10mm /  Edge cleaning: Yes, mop extension / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 18,000Pa / Vacuum brush style: Single rubber/bristle / Works with: Amazon Alexa, Google Home, Siri Shortcuts, Matter support promised\nEcovacs’ Deebot X8 Pro Omni is a welcome return to form for Ecovacs’ flagship line. Its new tower-less lidar navigation system did a much better job of mapping and navigating than the previous flagship, the Deebot X2 Omni, which was constantly getting lost in my tests. However, the most notable thing about the X8 is the Ozmo Roller Mop. \nThis is the best roller mopping bot I’ve tested, thanks mostly to the Ozmo’s ability to extend outwards to clean along baseboards and furniture. This is a unique feature on a roller mop (for now) that makes up for the mop’s relatively short length (both the Eufy S1 and Switchbot S10 have longer roller mops). At $1,299, the X8 is also one of the less expensive flagship models (though the new X9 Pro Omni retails for $1599.99).\n\n\nThe X8 did an excellent job on my milk, OJ, and dried ketchup tests, absorbing the small spills with one or two passes. It covered the floors evenly, without leaving any streaks or gaps, something that I’ve seen happen with spinning mop pads. When it comes across an edge — be it a baseboard, furniture like a chair or table leg, or any obstacle — it extends out its mop to the right to clean as close as possible. It did an excellent job getting the grime up from the stools around my kitchen counter, something most other bots struggle to do.\nThis is the best roller mopping bot I’ve tested\nThe self-cleaning brush system kept the bot from smearing any spills it encountered. As it’s cleaning, a scraper squeegees off the dirty water and 16 nozzles spray it with fresh water and solution, if you use it. As with most high-end mopping bots, the dock has the option of auto-dispensing cleaning solution.\nThe X8 was the best vacuuming robot among the serious combo bots I tested, outperforming my Cheerio and oatmeal tests and doing a good job on rugs (when it could reach them). However, its vacuum has a relatively small, single rubber roller brush, which is less effective than Roborock’s and Roomba’s dual roller brush models (which include the S8 MaxV Ultra and the 10 Max).\n\n\nThe X8 uses lidar and a 3D camera for mapping; the latter also facilitates its obstacle detection, which is very good — it easily navigated fake dog turds and cables while sucking up oatmeal and Cheerios. It’s much better at navigating than the X2, but it did occasionally get itself trapped, including when it went under a chair that was too low for it to get out from. The top of the robot was fairly scratched up after just one week of use. (Worth noting, Ecovacs suffered a hack last year in which bad actors could access the camera and microphone on the X2)\nThe X8’s multifunction dock is much smaller than the X2’s and has some nice rose gold accents. Its water tanks are integrated into the dock and supereasy to remove to empty and refill — there’s no lid to mess with, you just lift up and go. The X8 doesn’t self-clean its washboard, however, and while it’s removable to make it easier to clean, I still had to get on my knees and scrub its base station after just a week of use.\nIt easily navigated fake dog turds and cables while sucking up oatmeal and Cheerios\nThe downside of roller mop bots is that they are big and heavy: the X8 weighs a whopping 12 pounds. Despite an ability to lift itself up to clear thresholds, the X8 isn’t as agile as smaller, lighter robot vacs. It struggled with the combo challenge of a large, tasseled, high-pile rug and spindly chair leg. Very few robot vacs tackle that one well, but it got stuck on the chair leg and sucked up the rug tassels. I ended up setting a keep-out zone so it could complete its job.\nThe integrated nature of the roller mop means the bot can’t remove it when it goes to vacuum carpet, as some mopping bots with pads can. It can lift it, but only 10mm, which isn’t going to work for the fluffiest rugs. The X8 does have carpet sensors, and you can choose to avoid them automatically, pass over them, or vacuum only. But its best carpet feature is the option to have it vacuum the carpets first, then mop everywhere else. \nOverall, the Deebot X8 is a stellar vacuum mop combo for anyone seeking a robot that will thoroughly scrub and sweep their floors. With high-end features at a decent price, the X8’s roller mop, slick navigation, and excellent obstacle avoidance will get the job done.\nBest budget robot vacuum and mop\nMultifunction Dock: No – just auto empty / Mop style: Vibrating pad / Mop washing: No / Mop pressure: 6N pressure, vibrates 3000 times a minute / Mop lift: Yes, 5mm / Edge cleaning: No / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 6,000Pa / Vacuum brush style: Dual rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nThe Roborock S8 is a great vacuum featuring AI-powered obstacle detection, dual rubber roller brushes, and 6,000Pa of suction. These are all features you won’t find on most budget bots, and combined, they mean the S8 does a good job vacuuming hard floors and carpets. Then, its flat mop, which vibrates 3,000 times a second, is very effective at scrubbing hard floors. \nUnlike most robot vacuums in this guide, the S8 won’t automatically fill its water tank or wash its mop; you will have to do that work manually. However, it does have an extra-large onboard water tank, again a feature you won’t find on cheaper mopping bots, which means the mop gets sufficiently wet to be effective.\nThe S8 wasn’t designed as a budget bot; in fact, it was Roborock’s flagship model in 2023, but buying an older model like this can save you a lot of money while still doing a good job. Once $750 for the robot alone, now you can often find it for well under $500, and that’s with its auto-empty dock.\n\n\n\n\n\n\n\n\n\nOne of my favorite features of the S8 is that it can be set to mop only, and it does an excellent job, moving in a tighter “Z” pattern and going over the floors twice. It also has a slow option for a more thorough cleaning. I liked to send it out to vacuum everywhere first, then recharge and go out again to mop, which resulted in sparklingly clean floors. It does take a long time, though, and it doesn’t have any edge cleaning options, so it won’t mop as well along baseboards or under low furniture as the more expensive models.\nAnother great feature at this price is carpet sensing — the S8 can raise its mops a few millimeters to avoid dampening your carpets. Most other budget mopping bots require you to remove the mop pads when vacuuming carpet or set keep-out zones around your rugs. However, the mop-raising feature can only clear low-pile rugs, so I had to set no-mopping zones around my plush floor coverings.\nThe S8 requires a fair amount of hands-on time since you have to refill its reservoir manually and wash the mopping pads (you can throw them in the washing machine). But if you’re good with a little more manual labor in exchange for cleaner floors, the S8 is a great option.\nRead more of my Roborock S8 review.\nBest midrange robot vacuum and mop\nMultifunction Dock: Yes, auto empty (2.5L) and drain/refill (2.7L dirty, 3L clean) / Mop style: Dual spinning pads / Mop washing: Yes, hot air drying / Mop pressure: 2.2 lbs at 180 RPM / Mop lift: Yes, 12 mm / Edge cleaning: Yes, swinging motion / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 8,000Pa / Vacuum brush style: Single rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nThe Eufy X10 Pro Omni is an excellent mop vacuum hybrid with a full multifunction dock. Unlike the Roborock S8, it can wash its mop, drain, and refill its water tank. It’s also the cheapest model to offer dual spinning mop pads, and it has very good obstacle detection for this price range. \nHowever, the X10 has just 8,000Pa suction, no hot water washing, and smaller water tanks. While it has most of the same functions as the top-of-the-line mopping bots, it’s not quite as effective at any of them. Which is sort of the definition of “midrange.”\nAn edge-hugging mode makes the robot swing its behind into the baseboards to help mop edges, but this is less effective than mop extension found on the more expensive models. With its squarish shape, it gets into corners better than most of the round bots, but its 12mm mop pad lift over carpet wasn’t effective, resulting in its pads getting hung up in a few places.\n\n\n\n\n\n\n\n\nThe Eufy performed very well in my mopping tests, eradicating dried stains with its 2.2 pounds of downward pressure. Thanks to an onboard water reservoir, it didn’t have to head home to fill up as frequently as some bots do. It also has heated mop drying to help prevent the base from getting stinky — a first in this price range. \nThe X10 has great object recognition, allowing it to suck up Cheerios and piles of oatmeal while deftly navigating fake dog turds and cables. However, its navigation sometimes got screwy; it would go into a corner and stay there for a while, trying to figure itself out.\nRead more of my Eufy X10 review.\nBest robot vacuum and mop for a mix of hard floors and rugs\nMultifunction Dock: Yes, auto empty (3L) and drain/refill (4L dirty, 4.5L clean) / Mop style: Dual spinning pads / Mop washing: Yes, hot water and hot air drying / Mop pressure: Unknown  / Mop lift: Yes, 10.5 mm / Edge cleaning: Yes, mop extension Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 12,000Pa / Vacuum brush style: Single, rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nIf you have a lot of fluffy rugs or carpets as well as hard floors, the Dreame X40 Ultra is the best robot vacuum for you. It’s not quite as effective as a mop or vacuum as the Ecovacs Deebot X8, but it’s better suited for high-pile carpet and rugs because it can automatically drop and reattach its mopping pads during vacuuming, eliminating the risk of getting your rugs wet or stained. The Ecovacs X8 can only raise its mop 10mm, not remove it, so it struggles on high-pile carpets.\nAlong with dropping its pads, the X40 can also extend and swing them to get under your cabinets and consoles. The X8 can extend to an edge, but won’t get under those low cabinets or furniture. I watched the X40 spread its mops wide apart and swing behind my TV console, allowing it to access the dust wedged a good inch under it.\nHowever, because the X40 features dual spinning mop pads rather than a self-cleaning roller mop, it requires more frequent returns to clean the mops, which means it takes longer to clean your home. The X40’s spinning pads are effective at scrubbing your floors, but I found the X8’s roller mop to be better overall and more consistent.\n\n\n\n\n\n\n\nThe X40 can clean its washboard and features AI-powered smart dirt detection, which uses its cameras to identify spills, such as milk, or particularly dirty areas. When it spots something, it slows down and performs a more thorough cleaning. It also has an option to just mop. These are features the Ecovacs X8 doesn’t offer.\nDreame recently released the X50 Ultra, which adds 20,000Pa suction power and the ability to climb over higher thresholds. I’m currently testing this model.\nRead more of my Dream X40 Ultra review.\nBest robot vacuum and mop for hardwood floors\nMultifunction Dock: Yes, auto empty (2.5L) and drain/refill (2L dirty, 3L clean) / Mop style: Roller / Mop washing: Yes, warm water and hot air drying / Mop pressure: 10N, 170 RPM / Mop lift: Yes, 12mm /  Edge cleaning: No Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 8,000Pa / Vacuum brush style: Rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nIf you have mostly hardwood floors, the Eufy Omni S1 Pro is an excellent option. With its sleek, high-tech design and a long 11.4-inch roller mop, this product did an excellent job of keeping the hardwood floors of my main living area spotless. \nI found the Eufy’s longer roller mop to be slightly more effective than the Deebot X8’s, mopping evenly and getting up more dirt on its first pass. While there is no mop extension of edge mopping, its square shape does help it get into corners, and its dual spinning side brushes help pull in debris.\n\nHowever, its vacuuming prowess is middling; this really is a dedicated mopping robot. With just 8,000Pa suction power and a small rubber brush, it did a decent job of getting up debris, but left several flakes of oatmeal, thanks to its side brushes spinning the debris out beyond the bot’s reach. Its obstacle avoidance is also fairly average; it dodged larger items but struggled with cables. \nThe S1’s omni station is quite eye-catching, with a tall, futuristic design, and clear water tanks with glowing lights inside — although it might be considered an eyesore, depending on your style. Usefully, everything you need to interact with is located at the top, so there’s no need to bend down: a touchscreen display provides controls and the clean and dirty water tanks are easy to remove. \nIf you have tile or scraped wood floors, a bot with oscillating mop pads will be better at getting into the crevices\nWhile it has a mop lift of 12mm (which is higher than the X8’s), it really struggled on my high-pile carpets, to the point where I had to set keep-out zones around them. \nLike the X8, the S1 self-cleans the mop with water jets as it’s working, and you can set how frequently it returns to the base station for a thorough clean with warm water before continuing to mop. It will also dry the mop with hot air, which is effective, if noisy.\n\n\nNeither the X8 nor the S1 have self-cleaning washboards, something Dreame offers. This is where the dock automatically washes the mopping tray in the dock – Dreame’s uses little wipers that go back and forth. It still needs to be cleaned eventually, but it does help keep the ick at bay for longer. \nThe S1 station’s debris filter got grungy fast and required manual cleaning, although this is fairly straightforward. After a month of use, I also had to disassemble the scraper and filter inside the bot, as well as remove the roller mop. This is something you’ll need to do for all mopping bots, but the Eufy’s was the most involved process, requiring me to disassemble multiple parts.\nIn my testing, I found that roller mops are great for most hardwood floors, but if you have lots of tile or scraped wood floors with grooves and nooks and crannies, a bot with oscillating mop pads will be better, as these do a better job of getting into crevices such as grout lines. \nBest robot vacuum and mop for tile floors\nMultifunction Dock: Yes, auto, empty (2.5L) and drain/refill (4.1L dirty, 4.5L clean) / Mop style: Dual triangular spinning pads / Mop washing: Yes, hot air drying / Mop Pressure: 2.6lbs at 180 RPM / Mop lift: Yes, 12mm / Edge cleaning: Yes, robot swing and fluffer / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 12,000Pa / Vacuum brush style: Single, conical rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcut\nNarwal’s latest flagship mopping bot, the Freo Z Ultra, combines everything I loved about the Freo X Ultra, and adds better vacuuming, better object avoidance, an auto-empty dock (a first for Narwal), and a fluffy side brush to polish your baseboards. It also now comes in gray (white robot vacuums are not a good idea, unless you like cleaning your robot vacuum).\nWith its dual, triangular spinning mop pads (the unique shape helps avoid missing spots), the Freo Z is a great choice for homes with lots of hard floors, and especially tile. The oscillating mop pads are slightly better than roller mops at getting into grout lines and other crevices found on natural surfaces. The Freo Z’s downward pressure of 2.6 lbs meant it did a great job of scrubbing up dried-on debris, excelling in my dried ketchup test, even getting the red gunk up from tile grout.\n\n\nLike the Deebot X8, the Freo Z can recognize various floor materials, including tile, hardwood, and marble, and clean in the direction of the flooring, such as along the wood grain. Unlike the X8, it automatically adjusts pressure and “mopping humidity” based on the floor type, using higher humidity on tile floors than on wood floors, which can be impacted by excessive moisture. The Freo Z also self-cleans its station and has a removable tray, making maintenance easier.\nThe Freo Z is remarkably quiet, making it a great option for running in a bedroom\nVacuuming is much better than the Freo X, with the Z boasting 12,000Pa. While that’s not as high as the X8, the Freo Z is remarkably quiet, making it a great option for running in a primary bedroom suite where you may have a tile bathroom combined with carpet. \nAs with the X8, the Narwal doesn’t deal well with high-pile rugs, as there’s still only a 12 mm mop lift and no automatic mop removal. However, you can set it to perform one of four actions when it encounters a carpet: sidestep, cross it without cleaning, power boost to clean the carpet more effectively, or regular cleaning.\nThe obstacle detection is vastly improved and very good. A dual camera system allows the bot to not only see objects but uses AI to identify what they are and “decide” how to clean them. The best use of this I saw in testing is when there was a large puddle of water and it automatically switched to mop-only so as not to suck up liquid.\nSimilarly, Narwal’s dirt detect feature is very good. The bot goes back and forth over a stain or dirty area to ensure it’s clean. \n\n\nMy two biggest gripes with the Freo Z are that it uses a lot of water; it doesn’t have an onboard water tank, so it has to return frequently to refill — and could only clean my 800 square foot area once before I needed to refill the main tank in the dock. By comparison, the X8’s tank only needed refilling after three runs.  \nAdditionally, its app can be frustrating. It’s not easy to navigate, gets hung up between screens, and frequently disconnects from the robot. However, unlike the X8, the Narwal has controls on top of the station to start a clean, and once I had programmed a schedule, I didn’t find myself needing to use the app much at all. \nThe fluffy sidebrush feels more of a novelty than a necessity and doesn’t really seem to do much. Also, at this price, it would be nice if the Narwal offered a self-cleaning washboard. However, its washboard is removable, which makes it easier to clean manually.\nBest robot vacuum and mop with a plumbing hookup\nMultifunction Dock: Yes, auto, empty (4L) and drain/refill (two separate devices) / Mop style: Roller / Mop washing: Yes (during use), hot air drying / Mop Pressure: 2.2lbs at 300 RPM / Mop lift: Yes, 7mm /  Edge cleaning: No / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 6,500Pa / Vacuum brush style: Single rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcut, Matter\nThe SwitchBot S10 is a multitasking robot that hooks into your plumbing for a virtually hands-free sweeping and mopping experience. It’s one of the best robot mops I’ve tested, thanks to its self-cleaning roller mop and the fact that I never had to empty or fill its water tanks. These two features meant I could set it and forget it and have clean floors for weeks.\nMy other favorite feature of the S10 is its dual docking system. Its main dock is a charging / auto-empty dock, and there’s a separate battery-powered dock water station that you can put in a different room. This battery-powered dock is what makes the S10 the best plumbing hookup option, as it gives you much more flexibility with placement. Roborock, Dreame, and Narwal also have plumbing hookup docks, but they require power (I’ve not tested either of those yet).\n\n\n\n\n\n\n\n\n\nWhile the SwitchBot is a decent vacuum, it’s not the best. Its relatively paltry 6,500Pa of suction power is low compared to the competition, but the bot’s weight did help the rubber roller brush dig into the carpet and get up most of the cat hair.\nS10 frequently got stuck on clothes left on my floor and bath mats — which are the bane of most mopping bots\nOther downsides include the AI obstacle avoidance, which isn’t great. The S10 frequently got stuck on clothes left on my floor and bath mats, its battery life is short, and it lacks high-end features like dirt detection. There is also no edge cleaning function, meaning it didn’t do a great job along baseboards and around furniture.\nSwitchBot recently announced the SwitchBot S20 Pro, slated to launch this summer. The upgrade addresses some of my issues with the S10, including adding an extendable roller mop and side brush to add edge cleaning, as well as 15,000Pa. It also comes with the option of two all-in-one auto-empty base stations: one with a regular water tank you manually refill, or one that can hook into your plumbing. But it will also work with the battery-powered water station. I plan on testing this soon.\nRead my full SwitchBot S10 review.\nHow I test robot vacuums\nI’ve been testing robot vacuums for 6 years and have tested over 60 models. I write The Verge’s Best robot vacuum buying guide and the Best budget robot vacuum guide, and for this guide, I tested 15 different mopping robots.\nTo evaluate the bots, I ran each regularly for at least a week and measured their progress, evaluating how clean the floor stays, how well they navigate, how often I had to refill the tanks, how well the auto-empty function worked, and how easy the app was to use.\nI run them in my kitchen, where I have hardwood floors, and in a large bathroom with a white tile floor — one that looks filthy just a day after being cleaned. For specific tests, I deploy a wet and dry challenge. The wet challenge features dried-on OJ and ketchup, plus fresh spills of milk, water, and some kind of sauce. For the dry challenge, I place cereal (usually Cheerios) and oatmeal (a really tough one to clean). I evaluate how well the bots deal with mopping the stains and vacuuming the debris.Finally, I test their obstacle detection by running them through an obstacle course featuring common robot trip-ups, including fake dog poop, cables, socks, and tricky chair legs.\nWhat I’m currently testing and what’s coming next\n\n\nRoborock’s Saros 10 ($1,599.99) and Saros 10R ($1,599.99) are upgrades to my pick for the best overall robot vacuum, the S8 MaxV Ultra. Both can automatically remove their mop pads when not needed, which is a new option for Roborock. One uses dual spinning mops, the other a flat vibrating pad.\nRoborock also recently announced the $2,599 Saros Z70, the first mass-produced robovac to feature a robotic arm that can pick up objects like socks and tissues. It has dual spinning mop pads that it can automatically remove. Roborock’s cheaper Qrevo Curv ($1,599.99) also has dual spinning mop pads (which you have to remove) and can raise itself to clear thresholds up to 40mm. The company’s $1,399.99 Qrevo Slim offers similar functions but features a new navigation system and lacks a lidar tower, allowing it to fit under low furniture.\niRobot’s new Roomba lineup features two models with dual spinning mopping pads and auto-wash docks. The new Roomba 505 also offers heated mop drying, a feature the higher-end Roomba Combo 10 Max lacks.\nThe Narwal Flow sports the brand’s first roller mop, which can also extend. It claims to be able to tackle thick, fluffy carpets with a deep carpet boost mode and is scheduled to arrive this June.\nThe Matic is a $1,095 robot vacuum that doesn’t need a cloud connection to work and can suck up wet spills as well as dry. Here’s some video of it in action.\nEureka’s $1,099.99 J20 features a very wide roller mop but only 8,000Pa suction. The new J15 Max Ultra ($1,299), coming this spring, can accurately spot liquids and automatically rotate its body to tackle wet spills with its dual spinning mopping pads. It’s an upgrade to the J15 Pro Ultra ($999.99), which can identify colored liquids but not clear or white ones.\nAs mentioned above, Ecovacs recently released a successor to the Deebot X8 Pro Omni, aptly called the X9 Pro Omni ($1,599.99 $1,299.99). It sports a roller mop like the X8 Pro, but the big difference is that the new model is designed to optimize airflow from intake to exhaust rather than relying solely on suction power. The upgrade could lead to better deep-cleaning, though we haven’t put it through its paces yet.\nThe Dreame X50 Ultra ($1,699.99) features a “motorized swing arm” that functions like a leg, enabling the robovac to climb over transitions up to 6cm tall. Otherwise, it’s a lot like the X40 Ultra in this guide, only with higher suction power and a retractable lidar tower.\nThe Switchbot S20 Pro is the successor to the S10 and scheduled to launch this summer. It features an extendable roller mop and side brush, as well as 15,000Pa of suction power, more than twice that of the S10.\nSharkNinja’s PowerDetect NeverTouch Pro 2-in-1 robot vacuum mop ($999.99) can lift itself up as high as 20mm to get over rugs and transitions. Its automatic empty /wash / dry cleaning station doesn’t require bags.\nPriced at $999.99, Eufy’s new Robot Vacuum Omni E28 is a self-emptying, self-refilling, and self-washing robot vacuum with a rolling mop that can go over tough stains a second time if needed. The charging dock also includes a built-in deep cleaner that sprays water to tackle stains before sucking the mess into a separate wastewater tank.\n\nPhotography by Jennifer Pattison Tuohy / The Verge\nUpdate, May 13th: Added Eufy’s Robot Vacuum Omni E28, mentioned the Ecovacs X9 Pro Omni, and adjusted prices / availability. Sheena Vasani also contributed to this post.\n",
    "content": "\n\n\n\nRobot vacuums that can both mop and sweep your floors have improved significantly in recent years. While they are still not as effective as good ol’ manual labor, if you run them regularly, they will help keep your floors cleaner with much less effort on your part.\nThe difference is that newer “combo” robot vacuum and mop models are designed to actually scrub your floors. The first robot vacuums that could also “mop” simply slapped a thin, flat microfiber pad on the bot that kind of Swiffer-ed your floor. Basically, all this was good for was getting up fine dirt that the vacuum left behind.\nA robot vacuum with a real mopping system will make your life easier \nNewer models now come with vibrating or oscillating mop pads, and some even have roller mops. Most models have onboard water tanks to keep the mops wet while in use, and many can wash and dry their mops in their charging docks, which also automatically empty and refill their water tanks, meaning less work for you.\nWhile most robot vacuums today come with some sort of mopping feature, this guide focuses on those that excel at mopping. If you’re more interested in the best vacuum, check out my guide to floor sweeping bots. \nThe downside to these combo bots with serious mopping chops is that they tend to be bigger and heavier and need more frequent intervention than regular vacuum bots. Water equals gunk, and cleaning their giant multifunction docks, even the self-cleaning ones, can be an icky job. You also have to empty and refill their tanks about once a week. \nMopping bots also need to return to their docks more frequently than robot vacuums in order to refill their onboard water tanks. This means they’ll take longer to clean your floors than a dedicated vacuuming model, but they are doing two jobs at once. Robot mops with roller mops will self-clean as they work, negating this issue, but these models are also the largest and bulkiest, as they carry a bigger water tank on board. \nCombo bots can mop and vacuum simultaneously, but for especially dirty floors, it’s best to have the option to vacuum first and then mop. A mop-only mode is also good, as you can send the bot to clean up a wet spill without it sucking up water — something they’re not designed to do, yet.\nIf you have a lot of hardwood or tile floors and constantly struggle with muddy paw prints or the general dirtiness of life with multiple pets, people, and kids, a good robot vacuum and mop combo will definitely make your life easier. \n\n\nBest robot vacuum and mopBest budget robot vacuum and mopBest midrange robot vacuum and mopBest robot vacuum and mop for a mix of hard floors and rugsBest robot vacuum and mop for hardwood floorsBest robot vacuum and mop for tile floorsBest robot vacuum and mop with a plumbing hookupHow I test robot vacuumsWhat I’m currently testing and what’s coming next\n\n\n\nA multifunction charging dock\nThis is a charging base that empties the robot’s bin, washes and dries the bot’s mops, and empties and refills its water tank. This is essential if you want to be as hands-free as possible when mopping your floor. Some offer hot water washing and drying options that will keep your pads cleaner for longer. But you’ll want to throw them in the wash eventually. A dock that can self-clean the washboard (the area where it cleans the mops) is a nice upgrade, as you won’t have to do it yourself as often.\n\n\nBig tanks (or a plumbing hookup)\nThe bigger the clean and dirty water tanks on the dock, the less often you’ll have to refill them. If the dock can connect directly to the plumbing, even better; it’s a more complicated install, but makes for a more hands-off experience long term.\n\n\nBetter mops\nMop type matters. The main options are circular and spinning, flat and vibrating, or rolling and self-cleaning. Rolling (like the beater bar on a vacuum cleaner) is my favorite because it does a better job of getting floors really clean. The greater surface area of a roller mop, combined with the self-cleaning function — the vac sprays water onto the mop as it runs — makes it a more effective option than flat or spinning mops in most cases. However, oscillating mops that can extend outwards are better at getting into grout between tiles, along baseboards, and under low furniture. \n\n\nMops that lift or drop\nIf you have low-pile rugs and carpet, mop pads that the robot can lift up (by at least 10 mm) should prevent your carpets from getting damp when the robot rolls over them. However, robots that can remove the mop pads entirely before vacuuming carpets are a good option, especially if you have high-pile rugs.\n\n\nDecent mop pressure and speed\nSpecs around mop pressure and rotation speed are similar to those for suction power on the vacuum; they matter to some extent, but what’s more important is how effective the pads are. The higher the pressure, the more effective it should be on tougher stains. The higher the rotations per minute (RPMs), the more friction the stain has to deal with. It’s hard to judge pressure, as several manufacturers don’t list it and those that do use different measurements, but 12 Newtons, roughly 2.2 pounds of downward pressure, is very good.\n\n\nA usable app\nA well-laid-out app is key. It should let you choose which rooms to clean, and in what order. Generally, you want a mopping bot to clean the dirtiest room last (think bathroom or hallway) to avoid cross-contamination. I also look for the option to mop only, in addition to mop and vacuum, or vacuum then mop, and, of course, vacuum only.\n\n\nBest robot vacuum and mop\nMultifunction Dock: Yes, auto empty (3L) and drain/refill (4L dirty, 4L clean) / Mop style: Roller / Mop washing: Yes, hot water and hot air drying / Mop pressure: 4,000Pa at 200 RPM / Mop lift: Yes, 10mm /  Edge cleaning: Yes, mop extension / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 18,000Pa / Vacuum brush style: Single rubber/bristle / Works with: Amazon Alexa, Google Home, Siri Shortcuts, Matter support promised\nEcovacs’ Deebot X8 Pro Omni is a welcome return to form for Ecovacs’ flagship line. Its new tower-less lidar navigation system did a much better job of mapping and navigating than the previous flagship, the Deebot X2 Omni, which was constantly getting lost in my tests. However, the most notable thing about the X8 is the Ozmo Roller Mop. \nThis is the best roller mopping bot I’ve tested, thanks mostly to the Ozmo’s ability to extend outwards to clean along baseboards and furniture. This is a unique feature on a roller mop (for now) that makes up for the mop’s relatively short length (both the Eufy S1 and Switchbot S10 have longer roller mops). At $1,299, the X8 is also one of the less expensive flagship models (though the new X9 Pro Omni retails for $1599.99).\n\n\nThe X8 did an excellent job on my milk, OJ, and dried ketchup tests, absorbing the small spills with one or two passes. It covered the floors evenly, without leaving any streaks or gaps, something that I’ve seen happen with spinning mop pads. When it comes across an edge — be it a baseboard, furniture like a chair or table leg, or any obstacle — it extends out its mop to the right to clean as close as possible. It did an excellent job getting the grime up from the stools around my kitchen counter, something most other bots struggle to do.\nThis is the best roller mopping bot I’ve tested\nThe self-cleaning brush system kept the bot from smearing any spills it encountered. As it’s cleaning, a scraper squeegees off the dirty water and 16 nozzles spray it with fresh water and solution, if you use it. As with most high-end mopping bots, the dock has the option of auto-dispensing cleaning solution.\nThe X8 was the best vacuuming robot among the serious combo bots I tested, outperforming my Cheerio and oatmeal tests and doing a good job on rugs (when it could reach them). However, its vacuum has a relatively small, single rubber roller brush, which is less effective than Roborock’s and Roomba’s dual roller brush models (which include the S8 MaxV Ultra and the 10 Max).\n\n\nThe X8 uses lidar and a 3D camera for mapping; the latter also facilitates its obstacle detection, which is very good — it easily navigated fake dog turds and cables while sucking up oatmeal and Cheerios. It’s much better at navigating than the X2, but it did occasionally get itself trapped, including when it went under a chair that was too low for it to get out from. The top of the robot was fairly scratched up after just one week of use. (Worth noting, Ecovacs suffered a hack last year in which bad actors could access the camera and microphone on the X2)\nThe X8’s multifunction dock is much smaller than the X2’s and has some nice rose gold accents. Its water tanks are integrated into the dock and supereasy to remove to empty and refill — there’s no lid to mess with, you just lift up and go. The X8 doesn’t self-clean its washboard, however, and while it’s removable to make it easier to clean, I still had to get on my knees and scrub its base station after just a week of use.\nIt easily navigated fake dog turds and cables while sucking up oatmeal and Cheerios\nThe downside of roller mop bots is that they are big and heavy: the X8 weighs a whopping 12 pounds. Despite an ability to lift itself up to clear thresholds, the X8 isn’t as agile as smaller, lighter robot vacs. It struggled with the combo challenge of a large, tasseled, high-pile rug and spindly chair leg. Very few robot vacs tackle that one well, but it got stuck on the chair leg and sucked up the rug tassels. I ended up setting a keep-out zone so it could complete its job.\nThe integrated nature of the roller mop means the bot can’t remove it when it goes to vacuum carpet, as some mopping bots with pads can. It can lift it, but only 10mm, which isn’t going to work for the fluffiest rugs. The X8 does have carpet sensors, and you can choose to avoid them automatically, pass over them, or vacuum only. But its best carpet feature is the option to have it vacuum the carpets first, then mop everywhere else. \nOverall, the Deebot X8 is a stellar vacuum mop combo for anyone seeking a robot that will thoroughly scrub and sweep their floors. With high-end features at a decent price, the X8’s roller mop, slick navigation, and excellent obstacle avoidance will get the job done.\nBest budget robot vacuum and mop\nMultifunction Dock: No – just auto empty / Mop style: Vibrating pad / Mop washing: No / Mop pressure: 6N pressure, vibrates 3000 times a minute / Mop lift: Yes, 5mm / Edge cleaning: No / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 6,000Pa / Vacuum brush style: Dual rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nThe Roborock S8 is a great vacuum featuring AI-powered obstacle detection, dual rubber roller brushes, and 6,000Pa of suction. These are all features you won’t find on most budget bots, and combined, they mean the S8 does a good job vacuuming hard floors and carpets. Then, its flat mop, which vibrates 3,000 times a second, is very effective at scrubbing hard floors. \nUnlike most robot vacuums in this guide, the S8 won’t automatically fill its water tank or wash its mop; you will have to do that work manually. However, it does have an extra-large onboard water tank, again a feature you won’t find on cheaper mopping bots, which means the mop gets sufficiently wet to be effective.\nThe S8 wasn’t designed as a budget bot; in fact, it was Roborock’s flagship model in 2023, but buying an older model like this can save you a lot of money while still doing a good job. Once $750 for the robot alone, now you can often find it for well under $500, and that’s with its auto-empty dock.\n\n\n\n\n\n\n\n\n\nOne of my favorite features of the S8 is that it can be set to mop only, and it does an excellent job, moving in a tighter “Z” pattern and going over the floors twice. It also has a slow option for a more thorough cleaning. I liked to send it out to vacuum everywhere first, then recharge and go out again to mop, which resulted in sparklingly clean floors. It does take a long time, though, and it doesn’t have any edge cleaning options, so it won’t mop as well along baseboards or under low furniture as the more expensive models.\nAnother great feature at this price is carpet sensing — the S8 can raise its mops a few millimeters to avoid dampening your carpets. Most other budget mopping bots require you to remove the mop pads when vacuuming carpet or set keep-out zones around your rugs. However, the mop-raising feature can only clear low-pile rugs, so I had to set no-mopping zones around my plush floor coverings.\nThe S8 requires a fair amount of hands-on time since you have to refill its reservoir manually and wash the mopping pads (you can throw them in the washing machine). But if you’re good with a little more manual labor in exchange for cleaner floors, the S8 is a great option.\nRead more of my Roborock S8 review.\nBest midrange robot vacuum and mop\nMultifunction Dock: Yes, auto empty (2.5L) and drain/refill (2.7L dirty, 3L clean) / Mop style: Dual spinning pads / Mop washing: Yes, hot air drying / Mop pressure: 2.2 lbs at 180 RPM / Mop lift: Yes, 12 mm / Edge cleaning: Yes, swinging motion / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 8,000Pa / Vacuum brush style: Single rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nThe Eufy X10 Pro Omni is an excellent mop vacuum hybrid with a full multifunction dock. Unlike the Roborock S8, it can wash its mop, drain, and refill its water tank. It’s also the cheapest model to offer dual spinning mop pads, and it has very good obstacle detection for this price range. \nHowever, the X10 has just 8,000Pa suction, no hot water washing, and smaller water tanks. While it has most of the same functions as the top-of-the-line mopping bots, it’s not quite as effective at any of them. Which is sort of the definition of “midrange.”\nAn edge-hugging mode makes the robot swing its behind into the baseboards to help mop edges, but this is less effective than mop extension found on the more expensive models. With its squarish shape, it gets into corners better than most of the round bots, but its 12mm mop pad lift over carpet wasn’t effective, resulting in its pads getting hung up in a few places.\n\n\n\n\n\n\n\n\nThe Eufy performed very well in my mopping tests, eradicating dried stains with its 2.2 pounds of downward pressure. Thanks to an onboard water reservoir, it didn’t have to head home to fill up as frequently as some bots do. It also has heated mop drying to help prevent the base from getting stinky — a first in this price range. \nThe X10 has great object recognition, allowing it to suck up Cheerios and piles of oatmeal while deftly navigating fake dog turds and cables. However, its navigation sometimes got screwy; it would go into a corner and stay there for a while, trying to figure itself out.\nRead more of my Eufy X10 review.\nBest robot vacuum and mop for a mix of hard floors and rugs\nMultifunction Dock: Yes, auto empty (3L) and drain/refill (4L dirty, 4.5L clean) / Mop style: Dual spinning pads / Mop washing: Yes, hot water and hot air drying / Mop pressure: Unknown  / Mop lift: Yes, 10.5 mm / Edge cleaning: Yes, mop extension Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 12,000Pa / Vacuum brush style: Single, rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nIf you have a lot of fluffy rugs or carpets as well as hard floors, the Dreame X40 Ultra is the best robot vacuum for you. It’s not quite as effective as a mop or vacuum as the Ecovacs Deebot X8, but it’s better suited for high-pile carpet and rugs because it can automatically drop and reattach its mopping pads during vacuuming, eliminating the risk of getting your rugs wet or stained. The Ecovacs X8 can only raise its mop 10mm, not remove it, so it struggles on high-pile carpets.\nAlong with dropping its pads, the X40 can also extend and swing them to get under your cabinets and consoles. The X8 can extend to an edge, but won’t get under those low cabinets or furniture. I watched the X40 spread its mops wide apart and swing behind my TV console, allowing it to access the dust wedged a good inch under it.\nHowever, because the X40 features dual spinning mop pads rather than a self-cleaning roller mop, it requires more frequent returns to clean the mops, which means it takes longer to clean your home. The X40’s spinning pads are effective at scrubbing your floors, but I found the X8’s roller mop to be better overall and more consistent.\n\n\n\n\n\n\n\nThe X40 can clean its washboard and features AI-powered smart dirt detection, which uses its cameras to identify spills, such as milk, or particularly dirty areas. When it spots something, it slows down and performs a more thorough cleaning. It also has an option to just mop. These are features the Ecovacs X8 doesn’t offer.\nDreame recently released the X50 Ultra, which adds 20,000Pa suction power and the ability to climb over higher thresholds. I’m currently testing this model.\nRead more of my Dream X40 Ultra review.\nBest robot vacuum and mop for hardwood floors\nMultifunction Dock: Yes, auto empty (2.5L) and drain/refill (2L dirty, 3L clean) / Mop style: Roller / Mop washing: Yes, warm water and hot air drying / Mop pressure: 10N, 170 RPM / Mop lift: Yes, 12mm /  Edge cleaning: No Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 8,000Pa / Vacuum brush style: Rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nIf you have mostly hardwood floors, the Eufy Omni S1 Pro is an excellent option. With its sleek, high-tech design and a long 11.4-inch roller mop, this product did an excellent job of keeping the hardwood floors of my main living area spotless. \nI found the Eufy’s longer roller mop to be slightly more effective than the Deebot X8’s, mopping evenly and getting up more dirt on its first pass. While there is no mop extension of edge mopping, its square shape does help it get into corners, and its dual spinning side brushes help pull in debris.\n\nHowever, its vacuuming prowess is middling; this really is a dedicated mopping robot. With just 8,000Pa suction power and a small rubber brush, it did a decent job of getting up debris, but left several flakes of oatmeal, thanks to its side brushes spinning the debris out beyond the bot’s reach. Its obstacle avoidance is also fairly average; it dodged larger items but struggled with cables. \nThe S1’s omni station is quite eye-catching, with a tall, futuristic design, and clear water tanks with glowing lights inside — although it might be considered an eyesore, depending on your style. Usefully, everything you need to interact with is located at the top, so there’s no need to bend down: a touchscreen display provides controls and the clean and dirty water tanks are easy to remove. \nIf you have tile or scraped wood floors, a bot with oscillating mop pads will be better at getting into the crevices\nWhile it has a mop lift of 12mm (which is higher than the X8’s), it really struggled on my high-pile carpets, to the point where I had to set keep-out zones around them. \nLike the X8, the S1 self-cleans the mop with water jets as it’s working, and you can set how frequently it returns to the base station for a thorough clean with warm water before continuing to mop. It will also dry the mop with hot air, which is effective, if noisy.\n\n\nNeither the X8 nor the S1 have self-cleaning washboards, something Dreame offers. This is where the dock automatically washes the mopping tray in the dock – Dreame’s uses little wipers that go back and forth. It still needs to be cleaned eventually, but it does help keep the ick at bay for longer. \nThe S1 station’s debris filter got grungy fast and required manual cleaning, although this is fairly straightforward. After a month of use, I also had to disassemble the scraper and filter inside the bot, as well as remove the roller mop. This is something you’ll need to do for all mopping bots, but the Eufy’s was the most involved process, requiring me to disassemble multiple parts.\nIn my testing, I found that roller mops are great for most hardwood floors, but if you have lots of tile or scraped wood floors with grooves and nooks and crannies, a bot with oscillating mop pads will be better, as these do a better job of getting into crevices such as grout lines. \nBest robot vacuum and mop for tile floors\nMultifunction Dock: Yes, auto, empty (2.5L) and drain/refill (4.1L dirty, 4.5L clean) / Mop style: Dual triangular spinning pads / Mop washing: Yes, hot air drying / Mop Pressure: 2.6lbs at 180 RPM / Mop lift: Yes, 12mm / Edge cleaning: Yes, robot swing and fluffer / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 12,000Pa / Vacuum brush style: Single, conical rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcut\nNarwal’s latest flagship mopping bot, the Freo Z Ultra, combines everything I loved about the Freo X Ultra, and adds better vacuuming, better object avoidance, an auto-empty dock (a first for Narwal), and a fluffy side brush to polish your baseboards. It also now comes in gray (white robot vacuums are not a good idea, unless you like cleaning your robot vacuum).\nWith its dual, triangular spinning mop pads (the unique shape helps avoid missing spots), the Freo Z is a great choice for homes with lots of hard floors, and especially tile. The oscillating mop pads are slightly better than roller mops at getting into grout lines and other crevices found on natural surfaces. The Freo Z’s downward pressure of 2.6 lbs meant it did a great job of scrubbing up dried-on debris, excelling in my dried ketchup test, even getting the red gunk up from tile grout.\n\n\nLike the Deebot X8, the Freo Z can recognize various floor materials, including tile, hardwood, and marble, and clean in the direction of the flooring, such as along the wood grain. Unlike the X8, it automatically adjusts pressure and “mopping humidity” based on the floor type, using higher humidity on tile floors than on wood floors, which can be impacted by excessive moisture. The Freo Z also self-cleans its station and has a removable tray, making maintenance easier.\nThe Freo Z is remarkably quiet, making it a great option for running in a bedroom\nVacuuming is much better than the Freo X, with the Z boasting 12,000Pa. While that’s not as high as the X8, the Freo Z is remarkably quiet, making it a great option for running in a primary bedroom suite where you may have a tile bathroom combined with carpet. \nAs with the X8, the Narwal doesn’t deal well with high-pile rugs, as there’s still only a 12 mm mop lift and no automatic mop removal. However, you can set it to perform one of four actions when it encounters a carpet: sidestep, cross it without cleaning, power boost to clean the carpet more effectively, or regular cleaning.\nThe obstacle detection is vastly improved and very good. A dual camera system allows the bot to not only see objects but uses AI to identify what they are and “decide” how to clean them. The best use of this I saw in testing is when there was a large puddle of water and it automatically switched to mop-only so as not to suck up liquid.\nSimilarly, Narwal’s dirt detect feature is very good. The bot goes back and forth over a stain or dirty area to ensure it’s clean. \n\n\nMy two biggest gripes with the Freo Z are that it uses a lot of water; it doesn’t have an onboard water tank, so it has to return frequently to refill — and could only clean my 800 square foot area once before I needed to refill the main tank in the dock. By comparison, the X8’s tank only needed refilling after three runs.  \nAdditionally, its app can be frustrating. It’s not easy to navigate, gets hung up between screens, and frequently disconnects from the robot. However, unlike the X8, the Narwal has controls on top of the station to start a clean, and once I had programmed a schedule, I didn’t find myself needing to use the app much at all. \nThe fluffy sidebrush feels more of a novelty than a necessity and doesn’t really seem to do much. Also, at this price, it would be nice if the Narwal offered a self-cleaning washboard. However, its washboard is removable, which makes it easier to clean manually.\nBest robot vacuum and mop with a plumbing hookup\nMultifunction Dock: Yes, auto, empty (4L) and drain/refill (two separate devices) / Mop style: Roller / Mop washing: Yes (during use), hot air drying / Mop Pressure: 2.2lbs at 300 RPM / Mop lift: Yes, 7mm /  Edge cleaning: No / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 6,500Pa / Vacuum brush style: Single rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcut, Matter\nThe SwitchBot S10 is a multitasking robot that hooks into your plumbing for a virtually hands-free sweeping and mopping experience. It’s one of the best robot mops I’ve tested, thanks to its self-cleaning roller mop and the fact that I never had to empty or fill its water tanks. These two features meant I could set it and forget it and have clean floors for weeks.\nMy other favorite feature of the S10 is its dual docking system. Its main dock is a charging / auto-empty dock, and there’s a separate battery-powered dock water station that you can put in a different room. This battery-powered dock is what makes the S10 the best plumbing hookup option, as it gives you much more flexibility with placement. Roborock, Dreame, and Narwal also have plumbing hookup docks, but they require power (I’ve not tested either of those yet).\n\n\n\n\n\n\n\n\n\nWhile the SwitchBot is a decent vacuum, it’s not the best. Its relatively paltry 6,500Pa of suction power is low compared to the competition, but the bot’s weight did help the rubber roller brush dig into the carpet and get up most of the cat hair.\nS10 frequently got stuck on clothes left on my floor and bath mats — which are the bane of most mopping bots\nOther downsides include the AI obstacle avoidance, which isn’t great. The S10 frequently got stuck on clothes left on my floor and bath mats, its battery life is short, and it lacks high-end features like dirt detection. There is also no edge cleaning function, meaning it didn’t do a great job along baseboards and around furniture.\nSwitchBot recently announced the SwitchBot S20 Pro, slated to launch this summer. The upgrade addresses some of my issues with the S10, including adding an extendable roller mop and side brush to add edge cleaning, as well as 15,000Pa. It also comes with the option of two all-in-one auto-empty base stations: one with a regular water tank you manually refill, or one that can hook into your plumbing. But it will also work with the battery-powered water station. I plan on testing this soon.\nRead my full SwitchBot S10 review.\nHow I test robot vacuums\nI’ve been testing robot vacuums for 6 years and have tested over 60 models. I write The Verge’s Best robot vacuum buying guide and the Best budget robot vacuum guide, and for this guide, I tested 15 different mopping robots.\nTo evaluate the bots, I ran each regularly for at least a week and measured their progress, evaluating how clean the floor stays, how well they navigate, how often I had to refill the tanks, how well the auto-empty function worked, and how easy the app was to use.\nI run them in my kitchen, where I have hardwood floors, and in a large bathroom with a white tile floor — one that looks filthy just a day after being cleaned. For specific tests, I deploy a wet and dry challenge. The wet challenge features dried-on OJ and ketchup, plus fresh spills of milk, water, and some kind of sauce. For the dry challenge, I place cereal (usually Cheerios) and oatmeal (a really tough one to clean). I evaluate how well the bots deal with mopping the stains and vacuuming the debris.Finally, I test their obstacle detection by running them through an obstacle course featuring common robot trip-ups, including fake dog poop, cables, socks, and tricky chair legs.\nWhat I’m currently testing and what’s coming next\n\n\nRoborock’s Saros 10 ($1,599.99) and Saros 10R ($1,599.99) are upgrades to my pick for the best overall robot vacuum, the S8 MaxV Ultra. Both can automatically remove their mop pads when not needed, which is a new option for Roborock. One uses dual spinning mops, the other a flat vibrating pad.\nRoborock also recently announced the $2,599 Saros Z70, the first mass-produced robovac to feature a robotic arm that can pick up objects like socks and tissues. It has dual spinning mop pads that it can automatically remove. Roborock’s cheaper Qrevo Curv ($1,599.99) also has dual spinning mop pads (which you have to remove) and can raise itself to clear thresholds up to 40mm. The company’s $1,399.99 Qrevo Slim offers similar functions but features a new navigation system and lacks a lidar tower, allowing it to fit under low furniture.\niRobot’s new Roomba lineup features two models with dual spinning mopping pads and auto-wash docks. The new Roomba 505 also offers heated mop drying, a feature the higher-end Roomba Combo 10 Max lacks.\nThe Narwal Flow sports the brand’s first roller mop, which can also extend. It claims to be able to tackle thick, fluffy carpets with a deep carpet boost mode and is scheduled to arrive this June.\nThe Matic is a $1,095 robot vacuum that doesn’t need a cloud connection to work and can suck up wet spills as well as dry. Here’s some video of it in action.\nEureka’s $1,099.99 J20 features a very wide roller mop but only 8,000Pa suction. The new J15 Max Ultra ($1,299), coming this spring, can accurately spot liquids and automatically rotate its body to tackle wet spills with its dual spinning mopping pads. It’s an upgrade to the J15 Pro Ultra ($999.99), which can identify colored liquids but not clear or white ones.\nAs mentioned above, Ecovacs recently released a successor to the Deebot X8 Pro Omni, aptly called the X9 Pro Omni ($1,599.99 $1,299.99). It sports a roller mop like the X8 Pro, but the big difference is that the new model is designed to optimize airflow from intake to exhaust rather than relying solely on suction power. The upgrade could lead to better deep-cleaning, though we haven’t put it through its paces yet.\nThe Dreame X50 Ultra ($1,699.99) features a “motorized swing arm” that functions like a leg, enabling the robovac to climb over transitions up to 6cm tall. Otherwise, it’s a lot like the X40 Ultra in this guide, only with higher suction power and a retractable lidar tower.\nThe Switchbot S20 Pro is the successor to the S10 and scheduled to launch this summer. It features an extendable roller mop and side brush, as well as 15,000Pa of suction power, more than twice that of the S10.\nSharkNinja’s PowerDetect NeverTouch Pro 2-in-1 robot vacuum mop ($999.99) can lift itself up as high as 20mm to get over rugs and transitions. Its automatic empty /wash / dry cleaning station doesn’t require bags.\nPriced at $999.99, Eufy’s new Robot Vacuum Omni E28 is a self-emptying, self-refilling, and self-washing robot vacuum with a rolling mop that can go over tough stains a second time if needed. The charging dock also includes a built-in deep cleaner that sprays water to tackle stains before sucking the mess into a separate wastewater tank.\n\nPhotography by Jennifer Pattison Tuohy / The Verge\nUpdate, May 13th: Added Eufy’s Robot Vacuum Omni E28, mentioned the Ecovacs X9 Pro Omni, and adjusted prices / availability. Sheena Vasani also contributed to this post.\n"
  }
]