[
  {
    "id": 4,
    "articles": [
      {
        "title": "The best robot vacuum and mop to buy right now",
        "url": "https://www.theverge.com/tech/625409/best-robot-vacuum-mops",
        "source": "The Verge",
        "category": "technology",
        "published": "2025-05-13T16:05:26-04:00",
        "published_datetime": "2025-05-13T21:05:26",
        "summary": "\n\n\n\nRobot vacuums that can both mop and sweep your floors have improved significantly in recent years. While they are still not as effective as good ol’ manual labor, if you run them regularly, they will help keep your floors cleaner with much less effort on your part.\nThe difference is that newer “combo” robot vacuum and mop models are designed to actually scrub your floors. The first robot vacuums that could also “mop” simply slapped a thin, flat microfiber pad on the bot that kind of Swiffer-ed your floor. Basically, all this was good for was getting up fine dirt that the vacuum left behind.\nA robot vacuum with a real mopping system will make your life easier \nNewer models now come with vibrating or oscillating mop pads, and some even have roller mops. Most models have onboard water tanks to keep the mops wet while in use, and many can wash and dry their mops in their charging docks, which also automatically empty and refill their water tanks, meaning less work for you.\nWhile most robot vacuums today come with some sort of mopping feature, this guide focuses on those that excel at mopping. If you’re more interested in the best vacuum, check out my guide to floor sweeping bots. \nThe downside to these combo bots with serious mopping chops is that they tend to be bigger and heavier and need more frequent intervention than regular vacuum bots. Water equals gunk, and cleaning their giant multifunction docks, even the self-cleaning ones, can be an icky job. You also have to empty and refill their tanks about once a week. \nMopping bots also need to return to their docks more frequently than robot vacuums in order to refill their onboard water tanks. This means they’ll take longer to clean your floors than a dedicated vacuuming model, but they are doing two jobs at once. Robot mops with roller mops will self-clean as they work, negating this issue, but these models are also the largest and bulkiest, as they carry a bigger water tank on board. \nCombo bots can mop and vacuum simultaneously, but for especially dirty floors, it’s best to have the option to vacuum first and then mop. A mop-only mode is also good, as you can send the bot to clean up a wet spill without it sucking up water — something they’re not designed to do, yet.\nIf you have a lot of hardwood or tile floors and constantly struggle with muddy paw prints or the general dirtiness of life with multiple pets, people, and kids, a good robot vacuum and mop combo will definitely make your life easier. \n\n\nBest robot vacuum and mopBest budget robot vacuum and mopBest midrange robot vacuum and mopBest robot vacuum and mop for a mix of hard floors and rugsBest robot vacuum and mop for hardwood floorsBest robot vacuum and mop for tile floorsBest robot vacuum and mop with a plumbing hookupHow I test robot vacuumsWhat I’m currently testing and what’s coming next\n\n\n\nA multifunction charging dock\nThis is a charging base that empties the robot’s bin, washes and dries the bot’s mops, and empties and refills its water tank. This is essential if you want to be as hands-free as possible when mopping your floor. Some offer hot water washing and drying options that will keep your pads cleaner for longer. But you’ll want to throw them in the wash eventually. A dock that can self-clean the washboard (the area where it cleans the mops) is a nice upgrade, as you won’t have to do it yourself as often.\n\n\nBig tanks (or a plumbing hookup)\nThe bigger the clean and dirty water tanks on the dock, the less often you’ll have to refill them. If the dock can connect directly to the plumbing, even better; it’s a more complicated install, but makes for a more hands-off experience long term.\n\n\nBetter mops\nMop type matters. The main options are circular and spinning, flat and vibrating, or rolling and self-cleaning. Rolling (like the beater bar on a vacuum cleaner) is my favorite because it does a better job of getting floors really clean. The greater surface area of a roller mop, combined with the self-cleaning function — the vac sprays water onto the mop as it runs — makes it a more effective option than flat or spinning mops in most cases. However, oscillating mops that can extend outwards are better at getting into grout between tiles, along baseboards, and under low furniture. \n\n\nMops that lift or drop\nIf you have low-pile rugs and carpet, mop pads that the robot can lift up (by at least 10 mm) should prevent your carpets from getting damp when the robot rolls over them. However, robots that can remove the mop pads entirely before vacuuming carpets are a good option, especially if you have high-pile rugs.\n\n\nDecent mop pressure and speed\nSpecs around mop pressure and rotation speed are similar to those for suction power on the vacuum; they matter to some extent, but what’s more important is how effective the pads are. The higher the pressure, the more effective it should be on tougher stains. The higher the rotations per minute (RPMs), the more friction the stain has to deal with. It’s hard to judge pressure, as several manufacturers don’t list it and those that do use different measurements, but 12 Newtons, roughly 2.2 pounds of downward pressure, is very good.\n\n\nA usable app\nA well-laid-out app is key. It should let you choose which rooms to clean, and in what order. Generally, you want a mopping bot to clean the dirtiest room last (think bathroom or hallway) to avoid cross-contamination. I also look for the option to mop only, in addition to mop and vacuum, or vacuum then mop, and, of course, vacuum only.\n\n\nBest robot vacuum and mop\nMultifunction Dock: Yes, auto empty (3L) and drain/refill (4L dirty, 4L clean) / Mop style: Roller / Mop washing: Yes, hot water and hot air drying / Mop pressure: 4,000Pa at 200 RPM / Mop lift: Yes, 10mm /  Edge cleaning: Yes, mop extension / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 18,000Pa / Vacuum brush style: Single rubber/bristle / Works with: Amazon Alexa, Google Home, Siri Shortcuts, Matter support promised\nEcovacs’ Deebot X8 Pro Omni is a welcome return to form for Ecovacs’ flagship line. Its new tower-less lidar navigation system did a much better job of mapping and navigating than the previous flagship, the Deebot X2 Omni, which was constantly getting lost in my tests. However, the most notable thing about the X8 is the Ozmo Roller Mop. \nThis is the best roller mopping bot I’ve tested, thanks mostly to the Ozmo’s ability to extend outwards to clean along baseboards and furniture. This is a unique feature on a roller mop (for now) that makes up for the mop’s relatively short length (both the Eufy S1 and Switchbot S10 have longer roller mops). At $1,299, the X8 is also one of the less expensive flagship models (though the new X9 Pro Omni retails for $1599.99).\n\n\nThe X8 did an excellent job on my milk, OJ, and dried ketchup tests, absorbing the small spills with one or two passes. It covered the floors evenly, without leaving any streaks or gaps, something that I’ve seen happen with spinning mop pads. When it comes across an edge — be it a baseboard, furniture like a chair or table leg, or any obstacle — it extends out its mop to the right to clean as close as possible. It did an excellent job getting the grime up from the stools around my kitchen counter, something most other bots struggle to do.\nThis is the best roller mopping bot I’ve tested\nThe self-cleaning brush system kept the bot from smearing any spills it encountered. As it’s cleaning, a scraper squeegees off the dirty water and 16 nozzles spray it with fresh water and solution, if you use it. As with most high-end mopping bots, the dock has the option of auto-dispensing cleaning solution.\nThe X8 was the best vacuuming robot among the serious combo bots I tested, outperforming my Cheerio and oatmeal tests and doing a good job on rugs (when it could reach them). However, its vacuum has a relatively small, single rubber roller brush, which is less effective than Roborock’s and Roomba’s dual roller brush models (which include the S8 MaxV Ultra and the 10 Max).\n\n\nThe X8 uses lidar and a 3D camera for mapping; the latter also facilitates its obstacle detection, which is very good — it easily navigated fake dog turds and cables while sucking up oatmeal and Cheerios. It’s much better at navigating than the X2, but it did occasionally get itself trapped, including when it went under a chair that was too low for it to get out from. The top of the robot was fairly scratched up after just one week of use. (Worth noting, Ecovacs suffered a hack last year in which bad actors could access the camera and microphone on the X2)\nThe X8’s multifunction dock is much smaller than the X2’s and has some nice rose gold accents. Its water tanks are integrated into the dock and supereasy to remove to empty and refill — there’s no lid to mess with, you just lift up and go. The X8 doesn’t self-clean its washboard, however, and while it’s removable to make it easier to clean, I still had to get on my knees and scrub its base station after just a week of use.\nIt easily navigated fake dog turds and cables while sucking up oatmeal and Cheerios\nThe downside of roller mop bots is that they are big and heavy: the X8 weighs a whopping 12 pounds. Despite an ability to lift itself up to clear thresholds, the X8 isn’t as agile as smaller, lighter robot vacs. It struggled with the combo challenge of a large, tasseled, high-pile rug and spindly chair leg. Very few robot vacs tackle that one well, but it got stuck on the chair leg and sucked up the rug tassels. I ended up setting a keep-out zone so it could complete its job.\nThe integrated nature of the roller mop means the bot can’t remove it when it goes to vacuum carpet, as some mopping bots with pads can. It can lift it, but only 10mm, which isn’t going to work for the fluffiest rugs. The X8 does have carpet sensors, and you can choose to avoid them automatically, pass over them, or vacuum only. But its best carpet feature is the option to have it vacuum the carpets first, then mop everywhere else. \nOverall, the Deebot X8 is a stellar vacuum mop combo for anyone seeking a robot that will thoroughly scrub and sweep their floors. With high-end features at a decent price, the X8’s roller mop, slick navigation, and excellent obstacle avoidance will get the job done.\nBest budget robot vacuum and mop\nMultifunction Dock: No – just auto empty / Mop style: Vibrating pad / Mop washing: No / Mop pressure: 6N pressure, vibrates 3000 times a minute / Mop lift: Yes, 5mm / Edge cleaning: No / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 6,000Pa / Vacuum brush style: Dual rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nThe Roborock S8 is a great vacuum featuring AI-powered obstacle detection, dual rubber roller brushes, and 6,000Pa of suction. These are all features you won’t find on most budget bots, and combined, they mean the S8 does a good job vacuuming hard floors and carpets. Then, its flat mop, which vibrates 3,000 times a second, is very effective at scrubbing hard floors. \nUnlike most robot vacuums in this guide, the S8 won’t automatically fill its water tank or wash its mop; you will have to do that work manually. However, it does have an extra-large onboard water tank, again a feature you won’t find on cheaper mopping bots, which means the mop gets sufficiently wet to be effective.\nThe S8 wasn’t designed as a budget bot; in fact, it was Roborock’s flagship model in 2023, but buying an older model like this can save you a lot of money while still doing a good job. Once $750 for the robot alone, now you can often find it for well under $500, and that’s with its auto-empty dock.\n\n\n\n\n\n\n\n\n\nOne of my favorite features of the S8 is that it can be set to mop only, and it does an excellent job, moving in a tighter “Z” pattern and going over the floors twice. It also has a slow option for a more thorough cleaning. I liked to send it out to vacuum everywhere first, then recharge and go out again to mop, which resulted in sparklingly clean floors. It does take a long time, though, and it doesn’t have any edge cleaning options, so it won’t mop as well along baseboards or under low furniture as the more expensive models.\nAnother great feature at this price is carpet sensing — the S8 can raise its mops a few millimeters to avoid dampening your carpets. Most other budget mopping bots require you to remove the mop pads when vacuuming carpet or set keep-out zones around your rugs. However, the mop-raising feature can only clear low-pile rugs, so I had to set no-mopping zones around my plush floor coverings.\nThe S8 requires a fair amount of hands-on time since you have to refill its reservoir manually and wash the mopping pads (you can throw them in the washing machine). But if you’re good with a little more manual labor in exchange for cleaner floors, the S8 is a great option.\nRead more of my Roborock S8 review.\nBest midrange robot vacuum and mop\nMultifunction Dock: Yes, auto empty (2.5L) and drain/refill (2.7L dirty, 3L clean) / Mop style: Dual spinning pads / Mop washing: Yes, hot air drying / Mop pressure: 2.2 lbs at 180 RPM / Mop lift: Yes, 12 mm / Edge cleaning: Yes, swinging motion / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 8,000Pa / Vacuum brush style: Single rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nThe Eufy X10 Pro Omni is an excellent mop vacuum hybrid with a full multifunction dock. Unlike the Roborock S8, it can wash its mop, drain, and refill its water tank. It’s also the cheapest model to offer dual spinning mop pads, and it has very good obstacle detection for this price range. \nHowever, the X10 has just 8,000Pa suction, no hot water washing, and smaller water tanks. While it has most of the same functions as the top-of-the-line mopping bots, it’s not quite as effective at any of them. Which is sort of the definition of “midrange.”\nAn edge-hugging mode makes the robot swing its behind into the baseboards to help mop edges, but this is less effective than mop extension found on the more expensive models. With its squarish shape, it gets into corners better than most of the round bots, but its 12mm mop pad lift over carpet wasn’t effective, resulting in its pads getting hung up in a few places.\n\n\n\n\n\n\n\n\nThe Eufy performed very well in my mopping tests, eradicating dried stains with its 2.2 pounds of downward pressure. Thanks to an onboard water reservoir, it didn’t have to head home to fill up as frequently as some bots do. It also has heated mop drying to help prevent the base from getting stinky — a first in this price range. \nThe X10 has great object recognition, allowing it to suck up Cheerios and piles of oatmeal while deftly navigating fake dog turds and cables. However, its navigation sometimes got screwy; it would go into a corner and stay there for a while, trying to figure itself out.\nRead more of my Eufy X10 review.\nBest robot vacuum and mop for a mix of hard floors and rugs\nMultifunction Dock: Yes, auto empty (3L) and drain/refill (4L dirty, 4.5L clean) / Mop style: Dual spinning pads / Mop washing: Yes, hot water and hot air drying / Mop pressure: Unknown  / Mop lift: Yes, 10.5 mm / Edge cleaning: Yes, mop extension Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 12,000Pa / Vacuum brush style: Single, rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nIf you have a lot of fluffy rugs or carpets as well as hard floors, the Dreame X40 Ultra is the best robot vacuum for you. It’s not quite as effective as a mop or vacuum as the Ecovacs Deebot X8, but it’s better suited for high-pile carpet and rugs because it can automatically drop and reattach its mopping pads during vacuuming, eliminating the risk of getting your rugs wet or stained. The Ecovacs X8 can only raise its mop 10mm, not remove it, so it struggles on high-pile carpets.\nAlong with dropping its pads, the X40 can also extend and swing them to get under your cabinets and consoles. The X8 can extend to an edge, but won’t get under those low cabinets or furniture. I watched the X40 spread its mops wide apart and swing behind my TV console, allowing it to access the dust wedged a good inch under it.\nHowever, because the X40 features dual spinning mop pads rather than a self-cleaning roller mop, it requires more frequent returns to clean the mops, which means it takes longer to clean your home. The X40’s spinning pads are effective at scrubbing your floors, but I found the X8’s roller mop to be better overall and more consistent.\n\n\n\n\n\n\n\nThe X40 can clean its washboard and features AI-powered smart dirt detection, which uses its cameras to identify spills, such as milk, or particularly dirty areas. When it spots something, it slows down and performs a more thorough cleaning. It also has an option to just mop. These are features the Ecovacs X8 doesn’t offer.\nDreame recently released the X50 Ultra, which adds 20,000Pa suction power and the ability to climb over higher thresholds. I’m currently testing this model.\nRead more of my Dream X40 Ultra review.\nBest robot vacuum and mop for hardwood floors\nMultifunction Dock: Yes, auto empty (2.5L) and drain/refill (2L dirty, 3L clean) / Mop style: Roller / Mop washing: Yes, warm water and hot air drying / Mop pressure: 10N, 170 RPM / Mop lift: Yes, 12mm /  Edge cleaning: No Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 8,000Pa / Vacuum brush style: Rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nIf you have mostly hardwood floors, the Eufy Omni S1 Pro is an excellent option. With its sleek, high-tech design and a long 11.4-inch roller mop, this product did an excellent job of keeping the hardwood floors of my main living area spotless. \nI found the Eufy’s longer roller mop to be slightly more effective than the Deebot X8’s, mopping evenly and getting up more dirt on its first pass. While there is no mop extension of edge mopping, its square shape does help it get into corners, and its dual spinning side brushes help pull in debris.\n\nHowever, its vacuuming prowess is middling; this really is a dedicated mopping robot. With just 8,000Pa suction power and a small rubber brush, it did a decent job of getting up debris, but left several flakes of oatmeal, thanks to its side brushes spinning the debris out beyond the bot’s reach. Its obstacle avoidance is also fairly average; it dodged larger items but struggled with cables. \nThe S1’s omni station is quite eye-catching, with a tall, futuristic design, and clear water tanks with glowing lights inside — although it might be considered an eyesore, depending on your style. Usefully, everything you need to interact with is located at the top, so there’s no need to bend down: a touchscreen display provides controls and the clean and dirty water tanks are easy to remove. \nIf you have tile or scraped wood floors, a bot with oscillating mop pads will be better at getting into the crevices\nWhile it has a mop lift of 12mm (which is higher than the X8’s), it really struggled on my high-pile carpets, to the point where I had to set keep-out zones around them. \nLike the X8, the S1 self-cleans the mop with water jets as it’s working, and you can set how frequently it returns to the base station for a thorough clean with warm water before continuing to mop. It will also dry the mop with hot air, which is effective, if noisy.\n\n\nNeither the X8 nor the S1 have self-cleaning washboards, something Dreame offers. This is where the dock automatically washes the mopping tray in the dock – Dreame’s uses little wipers that go back and forth. It still needs to be cleaned eventually, but it does help keep the ick at bay for longer. \nThe S1 station’s debris filter got grungy fast and required manual cleaning, although this is fairly straightforward. After a month of use, I also had to disassemble the scraper and filter inside the bot, as well as remove the roller mop. This is something you’ll need to do for all mopping bots, but the Eufy’s was the most involved process, requiring me to disassemble multiple parts.\nIn my testing, I found that roller mops are great for most hardwood floors, but if you have lots of tile or scraped wood floors with grooves and nooks and crannies, a bot with oscillating mop pads will be better, as these do a better job of getting into crevices such as grout lines. \nBest robot vacuum and mop for tile floors\nMultifunction Dock: Yes, auto, empty (2.5L) and drain/refill (4.1L dirty, 4.5L clean) / Mop style: Dual triangular spinning pads / Mop washing: Yes, hot air drying / Mop Pressure: 2.6lbs at 180 RPM / Mop lift: Yes, 12mm / Edge cleaning: Yes, robot swing and fluffer / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 12,000Pa / Vacuum brush style: Single, conical rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcut\nNarwal’s latest flagship mopping bot, the Freo Z Ultra, combines everything I loved about the Freo X Ultra, and adds better vacuuming, better object avoidance, an auto-empty dock (a first for Narwal), and a fluffy side brush to polish your baseboards. It also now comes in gray (white robot vacuums are not a good idea, unless you like cleaning your robot vacuum).\nWith its dual, triangular spinning mop pads (the unique shape helps avoid missing spots), the Freo Z is a great choice for homes with lots of hard floors, and especially tile. The oscillating mop pads are slightly better than roller mops at getting into grout lines and other crevices found on natural surfaces. The Freo Z’s downward pressure of 2.6 lbs meant it did a great job of scrubbing up dried-on debris, excelling in my dried ketchup test, even getting the red gunk up from tile grout.\n\n\nLike the Deebot X8, the Freo Z can recognize various floor materials, including tile, hardwood, and marble, and clean in the direction of the flooring, such as along the wood grain. Unlike the X8, it automatically adjusts pressure and “mopping humidity” based on the floor type, using higher humidity on tile floors than on wood floors, which can be impacted by excessive moisture. The Freo Z also self-cleans its station and has a removable tray, making maintenance easier.\nThe Freo Z is remarkably quiet, making it a great option for running in a bedroom\nVacuuming is much better than the Freo X, with the Z boasting 12,000Pa. While that’s not as high as the X8, the Freo Z is remarkably quiet, making it a great option for running in a primary bedroom suite where you may have a tile bathroom combined with carpet. \nAs with the X8, the Narwal doesn’t deal well with high-pile rugs, as there’s still only a 12 mm mop lift and no automatic mop removal. However, you can set it to perform one of four actions when it encounters a carpet: sidestep, cross it without cleaning, power boost to clean the carpet more effectively, or regular cleaning.\nThe obstacle detection is vastly improved and very good. A dual camera system allows the bot to not only see objects but uses AI to identify what they are and “decide” how to clean them. The best use of this I saw in testing is when there was a large puddle of water and it automatically switched to mop-only so as not to suck up liquid.\nSimilarly, Narwal’s dirt detect feature is very good. The bot goes back and forth over a stain or dirty area to ensure it’s clean. \n\n\nMy two biggest gripes with the Freo Z are that it uses a lot of water; it doesn’t have an onboard water tank, so it has to return frequently to refill — and could only clean my 800 square foot area once before I needed to refill the main tank in the dock. By comparison, the X8’s tank only needed refilling after three runs.  \nAdditionally, its app can be frustrating. It’s not easy to navigate, gets hung up between screens, and frequently disconnects from the robot. However, unlike the X8, the Narwal has controls on top of the station to start a clean, and once I had programmed a schedule, I didn’t find myself needing to use the app much at all. \nThe fluffy sidebrush feels more of a novelty than a necessity and doesn’t really seem to do much. Also, at this price, it would be nice if the Narwal offered a self-cleaning washboard. However, its washboard is removable, which makes it easier to clean manually.\nBest robot vacuum and mop with a plumbing hookup\nMultifunction Dock: Yes, auto, empty (4L) and drain/refill (two separate devices) / Mop style: Roller / Mop washing: Yes (during use), hot air drying / Mop Pressure: 2.2lbs at 300 RPM / Mop lift: Yes, 7mm /  Edge cleaning: No / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 6,500Pa / Vacuum brush style: Single rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcut, Matter\nThe SwitchBot S10 is a multitasking robot that hooks into your plumbing for a virtually hands-free sweeping and mopping experience. It’s one of the best robot mops I’ve tested, thanks to its self-cleaning roller mop and the fact that I never had to empty or fill its water tanks. These two features meant I could set it and forget it and have clean floors for weeks.\nMy other favorite feature of the S10 is its dual docking system. Its main dock is a charging / auto-empty dock, and there’s a separate battery-powered dock water station that you can put in a different room. This battery-powered dock is what makes the S10 the best plumbing hookup option, as it gives you much more flexibility with placement. Roborock, Dreame, and Narwal also have plumbing hookup docks, but they require power (I’ve not tested either of those yet).\n\n\n\n\n\n\n\n\n\nWhile the SwitchBot is a decent vacuum, it’s not the best. Its relatively paltry 6,500Pa of suction power is low compared to the competition, but the bot’s weight did help the rubber roller brush dig into the carpet and get up most of the cat hair.\nS10 frequently got stuck on clothes left on my floor and bath mats — which are the bane of most mopping bots\nOther downsides include the AI obstacle avoidance, which isn’t great. The S10 frequently got stuck on clothes left on my floor and bath mats, its battery life is short, and it lacks high-end features like dirt detection. There is also no edge cleaning function, meaning it didn’t do a great job along baseboards and around furniture.\nSwitchBot recently announced the SwitchBot S20 Pro, slated to launch this summer. The upgrade addresses some of my issues with the S10, including adding an extendable roller mop and side brush to add edge cleaning, as well as 15,000Pa. It also comes with the option of two all-in-one auto-empty base stations: one with a regular water tank you manually refill, or one that can hook into your plumbing. But it will also work with the battery-powered water station. I plan on testing this soon.\nRead my full SwitchBot S10 review.\nHow I test robot vacuums\nI’ve been testing robot vacuums for 6 years and have tested over 60 models. I write The Verge’s Best robot vacuum buying guide and the Best budget robot vacuum guide, and for this guide, I tested 15 different mopping robots.\nTo evaluate the bots, I ran each regularly for at least a week and measured their progress, evaluating how clean the floor stays, how well they navigate, how often I had to refill the tanks, how well the auto-empty function worked, and how easy the app was to use.\nI run them in my kitchen, where I have hardwood floors, and in a large bathroom with a white tile floor — one that looks filthy just a day after being cleaned. For specific tests, I deploy a wet and dry challenge. The wet challenge features dried-on OJ and ketchup, plus fresh spills of milk, water, and some kind of sauce. For the dry challenge, I place cereal (usually Cheerios) and oatmeal (a really tough one to clean). I evaluate how well the bots deal with mopping the stains and vacuuming the debris.Finally, I test their obstacle detection by running them through an obstacle course featuring common robot trip-ups, including fake dog poop, cables, socks, and tricky chair legs.\nWhat I’m currently testing and what’s coming next\n\n\nRoborock’s Saros 10 ($1,599.99) and Saros 10R ($1,599.99) are upgrades to my pick for the best overall robot vacuum, the S8 MaxV Ultra. Both can automatically remove their mop pads when not needed, which is a new option for Roborock. One uses dual spinning mops, the other a flat vibrating pad.\nRoborock also recently announced the $2,599 Saros Z70, the first mass-produced robovac to feature a robotic arm that can pick up objects like socks and tissues. It has dual spinning mop pads that it can automatically remove. Roborock’s cheaper Qrevo Curv ($1,599.99) also has dual spinning mop pads (which you have to remove) and can raise itself to clear thresholds up to 40mm. The company’s $1,399.99 Qrevo Slim offers similar functions but features a new navigation system and lacks a lidar tower, allowing it to fit under low furniture.\niRobot’s new Roomba lineup features two models with dual spinning mopping pads and auto-wash docks. The new Roomba 505 also offers heated mop drying, a feature the higher-end Roomba Combo 10 Max lacks.\nThe Narwal Flow sports the brand’s first roller mop, which can also extend. It claims to be able to tackle thick, fluffy carpets with a deep carpet boost mode and is scheduled to arrive this June.\nThe Matic is a $1,095 robot vacuum that doesn’t need a cloud connection to work and can suck up wet spills as well as dry. Here’s some video of it in action.\nEureka’s $1,099.99 J20 features a very wide roller mop but only 8,000Pa suction. The new J15 Max Ultra ($1,299), coming this spring, can accurately spot liquids and automatically rotate its body to tackle wet spills with its dual spinning mopping pads. It’s an upgrade to the J15 Pro Ultra ($999.99), which can identify colored liquids but not clear or white ones.\nAs mentioned above, Ecovacs recently released a successor to the Deebot X8 Pro Omni, aptly called the X9 Pro Omni ($1,599.99 $1,299.99). It sports a roller mop like the X8 Pro, but the big difference is that the new model is designed to optimize airflow from intake to exhaust rather than relying solely on suction power. The upgrade could lead to better deep-cleaning, though we haven’t put it through its paces yet.\nThe Dreame X50 Ultra ($1,699.99) features a “motorized swing arm” that functions like a leg, enabling the robovac to climb over transitions up to 6cm tall. Otherwise, it’s a lot like the X40 Ultra in this guide, only with higher suction power and a retractable lidar tower.\nThe Switchbot S20 Pro is the successor to the S10 and scheduled to launch this summer. It features an extendable roller mop and side brush, as well as 15,000Pa of suction power, more than twice that of the S10.\nSharkNinja’s PowerDetect NeverTouch Pro 2-in-1 robot vacuum mop ($999.99) can lift itself up as high as 20mm to get over rugs and transitions. Its automatic empty /wash / dry cleaning station doesn’t require bags.\nPriced at $999.99, Eufy’s new Robot Vacuum Omni E28 is a self-emptying, self-refilling, and self-washing robot vacuum with a rolling mop that can go over tough stains a second time if needed. The charging dock also includes a built-in deep cleaner that sprays water to tackle stains before sucking the mess into a separate wastewater tank.\n\nPhotography by Jennifer Pattison Tuohy / The Verge\nUpdate, May 13th: Added Eufy’s Robot Vacuum Omni E28, mentioned the Ecovacs X9 Pro Omni, and adjusted prices / availability. Sheena Vasani also contributed to this post.\n",
        "content": "\n\n\n\nRobot vacuums that can both mop and sweep your floors have improved significantly in recent years. While they are still not as effective as good ol’ manual labor, if you run them regularly, they will help keep your floors cleaner with much less effort on your part.\nThe difference is that newer “combo” robot vacuum and mop models are designed to actually scrub your floors. The first robot vacuums that could also “mop” simply slapped a thin, flat microfiber pad on the bot that kind of Swiffer-ed your floor. Basically, all this was good for was getting up fine dirt that the vacuum left behind.\nA robot vacuum with a real mopping system will make your life easier \nNewer models now come with vibrating or oscillating mop pads, and some even have roller mops. Most models have onboard water tanks to keep the mops wet while in use, and many can wash and dry their mops in their charging docks, which also automatically empty and refill their water tanks, meaning less work for you.\nWhile most robot vacuums today come with some sort of mopping feature, this guide focuses on those that excel at mopping. If you’re more interested in the best vacuum, check out my guide to floor sweeping bots. \nThe downside to these combo bots with serious mopping chops is that they tend to be bigger and heavier and need more frequent intervention than regular vacuum bots. Water equals gunk, and cleaning their giant multifunction docks, even the self-cleaning ones, can be an icky job. You also have to empty and refill their tanks about once a week. \nMopping bots also need to return to their docks more frequently than robot vacuums in order to refill their onboard water tanks. This means they’ll take longer to clean your floors than a dedicated vacuuming model, but they are doing two jobs at once. Robot mops with roller mops will self-clean as they work, negating this issue, but these models are also the largest and bulkiest, as they carry a bigger water tank on board. \nCombo bots can mop and vacuum simultaneously, but for especially dirty floors, it’s best to have the option to vacuum first and then mop. A mop-only mode is also good, as you can send the bot to clean up a wet spill without it sucking up water — something they’re not designed to do, yet.\nIf you have a lot of hardwood or tile floors and constantly struggle with muddy paw prints or the general dirtiness of life with multiple pets, people, and kids, a good robot vacuum and mop combo will definitely make your life easier. \n\n\nBest robot vacuum and mopBest budget robot vacuum and mopBest midrange robot vacuum and mopBest robot vacuum and mop for a mix of hard floors and rugsBest robot vacuum and mop for hardwood floorsBest robot vacuum and mop for tile floorsBest robot vacuum and mop with a plumbing hookupHow I test robot vacuumsWhat I’m currently testing and what’s coming next\n\n\n\nA multifunction charging dock\nThis is a charging base that empties the robot’s bin, washes and dries the bot’s mops, and empties and refills its water tank. This is essential if you want to be as hands-free as possible when mopping your floor. Some offer hot water washing and drying options that will keep your pads cleaner for longer. But you’ll want to throw them in the wash eventually. A dock that can self-clean the washboard (the area where it cleans the mops) is a nice upgrade, as you won’t have to do it yourself as often.\n\n\nBig tanks (or a plumbing hookup)\nThe bigger the clean and dirty water tanks on the dock, the less often you’ll have to refill them. If the dock can connect directly to the plumbing, even better; it’s a more complicated install, but makes for a more hands-off experience long term.\n\n\nBetter mops\nMop type matters. The main options are circular and spinning, flat and vibrating, or rolling and self-cleaning. Rolling (like the beater bar on a vacuum cleaner) is my favorite because it does a better job of getting floors really clean. The greater surface area of a roller mop, combined with the self-cleaning function — the vac sprays water onto the mop as it runs — makes it a more effective option than flat or spinning mops in most cases. However, oscillating mops that can extend outwards are better at getting into grout between tiles, along baseboards, and under low furniture. \n\n\nMops that lift or drop\nIf you have low-pile rugs and carpet, mop pads that the robot can lift up (by at least 10 mm) should prevent your carpets from getting damp when the robot rolls over them. However, robots that can remove the mop pads entirely before vacuuming carpets are a good option, especially if you have high-pile rugs.\n\n\nDecent mop pressure and speed\nSpecs around mop pressure and rotation speed are similar to those for suction power on the vacuum; they matter to some extent, but what’s more important is how effective the pads are. The higher the pressure, the more effective it should be on tougher stains. The higher the rotations per minute (RPMs), the more friction the stain has to deal with. It’s hard to judge pressure, as several manufacturers don’t list it and those that do use different measurements, but 12 Newtons, roughly 2.2 pounds of downward pressure, is very good.\n\n\nA usable app\nA well-laid-out app is key. It should let you choose which rooms to clean, and in what order. Generally, you want a mopping bot to clean the dirtiest room last (think bathroom or hallway) to avoid cross-contamination. I also look for the option to mop only, in addition to mop and vacuum, or vacuum then mop, and, of course, vacuum only.\n\n\nBest robot vacuum and mop\nMultifunction Dock: Yes, auto empty (3L) and drain/refill (4L dirty, 4L clean) / Mop style: Roller / Mop washing: Yes, hot water and hot air drying / Mop pressure: 4,000Pa at 200 RPM / Mop lift: Yes, 10mm /  Edge cleaning: Yes, mop extension / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 18,000Pa / Vacuum brush style: Single rubber/bristle / Works with: Amazon Alexa, Google Home, Siri Shortcuts, Matter support promised\nEcovacs’ Deebot X8 Pro Omni is a welcome return to form for Ecovacs’ flagship line. Its new tower-less lidar navigation system did a much better job of mapping and navigating than the previous flagship, the Deebot X2 Omni, which was constantly getting lost in my tests. However, the most notable thing about the X8 is the Ozmo Roller Mop. \nThis is the best roller mopping bot I’ve tested, thanks mostly to the Ozmo’s ability to extend outwards to clean along baseboards and furniture. This is a unique feature on a roller mop (for now) that makes up for the mop’s relatively short length (both the Eufy S1 and Switchbot S10 have longer roller mops). At $1,299, the X8 is also one of the less expensive flagship models (though the new X9 Pro Omni retails for $1599.99).\n\n\nThe X8 did an excellent job on my milk, OJ, and dried ketchup tests, absorbing the small spills with one or two passes. It covered the floors evenly, without leaving any streaks or gaps, something that I’ve seen happen with spinning mop pads. When it comes across an edge — be it a baseboard, furniture like a chair or table leg, or any obstacle — it extends out its mop to the right to clean as close as possible. It did an excellent job getting the grime up from the stools around my kitchen counter, something most other bots struggle to do.\nThis is the best roller mopping bot I’ve tested\nThe self-cleaning brush system kept the bot from smearing any spills it encountered. As it’s cleaning, a scraper squeegees off the dirty water and 16 nozzles spray it with fresh water and solution, if you use it. As with most high-end mopping bots, the dock has the option of auto-dispensing cleaning solution.\nThe X8 was the best vacuuming robot among the serious combo bots I tested, outperforming my Cheerio and oatmeal tests and doing a good job on rugs (when it could reach them). However, its vacuum has a relatively small, single rubber roller brush, which is less effective than Roborock’s and Roomba’s dual roller brush models (which include the S8 MaxV Ultra and the 10 Max).\n\n\nThe X8 uses lidar and a 3D camera for mapping; the latter also facilitates its obstacle detection, which is very good — it easily navigated fake dog turds and cables while sucking up oatmeal and Cheerios. It’s much better at navigating than the X2, but it did occasionally get itself trapped, including when it went under a chair that was too low for it to get out from. The top of the robot was fairly scratched up after just one week of use. (Worth noting, Ecovacs suffered a hack last year in which bad actors could access the camera and microphone on the X2)\nThe X8’s multifunction dock is much smaller than the X2’s and has some nice rose gold accents. Its water tanks are integrated into the dock and supereasy to remove to empty and refill — there’s no lid to mess with, you just lift up and go. The X8 doesn’t self-clean its washboard, however, and while it’s removable to make it easier to clean, I still had to get on my knees and scrub its base station after just a week of use.\nIt easily navigated fake dog turds and cables while sucking up oatmeal and Cheerios\nThe downside of roller mop bots is that they are big and heavy: the X8 weighs a whopping 12 pounds. Despite an ability to lift itself up to clear thresholds, the X8 isn’t as agile as smaller, lighter robot vacs. It struggled with the combo challenge of a large, tasseled, high-pile rug and spindly chair leg. Very few robot vacs tackle that one well, but it got stuck on the chair leg and sucked up the rug tassels. I ended up setting a keep-out zone so it could complete its job.\nThe integrated nature of the roller mop means the bot can’t remove it when it goes to vacuum carpet, as some mopping bots with pads can. It can lift it, but only 10mm, which isn’t going to work for the fluffiest rugs. The X8 does have carpet sensors, and you can choose to avoid them automatically, pass over them, or vacuum only. But its best carpet feature is the option to have it vacuum the carpets first, then mop everywhere else. \nOverall, the Deebot X8 is a stellar vacuum mop combo for anyone seeking a robot that will thoroughly scrub and sweep their floors. With high-end features at a decent price, the X8’s roller mop, slick navigation, and excellent obstacle avoidance will get the job done.\nBest budget robot vacuum and mop\nMultifunction Dock: No – just auto empty / Mop style: Vibrating pad / Mop washing: No / Mop pressure: 6N pressure, vibrates 3000 times a minute / Mop lift: Yes, 5mm / Edge cleaning: No / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 6,000Pa / Vacuum brush style: Dual rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nThe Roborock S8 is a great vacuum featuring AI-powered obstacle detection, dual rubber roller brushes, and 6,000Pa of suction. These are all features you won’t find on most budget bots, and combined, they mean the S8 does a good job vacuuming hard floors and carpets. Then, its flat mop, which vibrates 3,000 times a second, is very effective at scrubbing hard floors. \nUnlike most robot vacuums in this guide, the S8 won’t automatically fill its water tank or wash its mop; you will have to do that work manually. However, it does have an extra-large onboard water tank, again a feature you won’t find on cheaper mopping bots, which means the mop gets sufficiently wet to be effective.\nThe S8 wasn’t designed as a budget bot; in fact, it was Roborock’s flagship model in 2023, but buying an older model like this can save you a lot of money while still doing a good job. Once $750 for the robot alone, now you can often find it for well under $500, and that’s with its auto-empty dock.\n\n\n\n\n\n\n\n\n\nOne of my favorite features of the S8 is that it can be set to mop only, and it does an excellent job, moving in a tighter “Z” pattern and going over the floors twice. It also has a slow option for a more thorough cleaning. I liked to send it out to vacuum everywhere first, then recharge and go out again to mop, which resulted in sparklingly clean floors. It does take a long time, though, and it doesn’t have any edge cleaning options, so it won’t mop as well along baseboards or under low furniture as the more expensive models.\nAnother great feature at this price is carpet sensing — the S8 can raise its mops a few millimeters to avoid dampening your carpets. Most other budget mopping bots require you to remove the mop pads when vacuuming carpet or set keep-out zones around your rugs. However, the mop-raising feature can only clear low-pile rugs, so I had to set no-mopping zones around my plush floor coverings.\nThe S8 requires a fair amount of hands-on time since you have to refill its reservoir manually and wash the mopping pads (you can throw them in the washing machine). But if you’re good with a little more manual labor in exchange for cleaner floors, the S8 is a great option.\nRead more of my Roborock S8 review.\nBest midrange robot vacuum and mop\nMultifunction Dock: Yes, auto empty (2.5L) and drain/refill (2.7L dirty, 3L clean) / Mop style: Dual spinning pads / Mop washing: Yes, hot air drying / Mop pressure: 2.2 lbs at 180 RPM / Mop lift: Yes, 12 mm / Edge cleaning: Yes, swinging motion / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 8,000Pa / Vacuum brush style: Single rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nThe Eufy X10 Pro Omni is an excellent mop vacuum hybrid with a full multifunction dock. Unlike the Roborock S8, it can wash its mop, drain, and refill its water tank. It’s also the cheapest model to offer dual spinning mop pads, and it has very good obstacle detection for this price range. \nHowever, the X10 has just 8,000Pa suction, no hot water washing, and smaller water tanks. While it has most of the same functions as the top-of-the-line mopping bots, it’s not quite as effective at any of them. Which is sort of the definition of “midrange.”\nAn edge-hugging mode makes the robot swing its behind into the baseboards to help mop edges, but this is less effective than mop extension found on the more expensive models. With its squarish shape, it gets into corners better than most of the round bots, but its 12mm mop pad lift over carpet wasn’t effective, resulting in its pads getting hung up in a few places.\n\n\n\n\n\n\n\n\nThe Eufy performed very well in my mopping tests, eradicating dried stains with its 2.2 pounds of downward pressure. Thanks to an onboard water reservoir, it didn’t have to head home to fill up as frequently as some bots do. It also has heated mop drying to help prevent the base from getting stinky — a first in this price range. \nThe X10 has great object recognition, allowing it to suck up Cheerios and piles of oatmeal while deftly navigating fake dog turds and cables. However, its navigation sometimes got screwy; it would go into a corner and stay there for a while, trying to figure itself out.\nRead more of my Eufy X10 review.\nBest robot vacuum and mop for a mix of hard floors and rugs\nMultifunction Dock: Yes, auto empty (3L) and drain/refill (4L dirty, 4.5L clean) / Mop style: Dual spinning pads / Mop washing: Yes, hot water and hot air drying / Mop pressure: Unknown  / Mop lift: Yes, 10.5 mm / Edge cleaning: Yes, mop extension Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 12,000Pa / Vacuum brush style: Single, rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nIf you have a lot of fluffy rugs or carpets as well as hard floors, the Dreame X40 Ultra is the best robot vacuum for you. It’s not quite as effective as a mop or vacuum as the Ecovacs Deebot X8, but it’s better suited for high-pile carpet and rugs because it can automatically drop and reattach its mopping pads during vacuuming, eliminating the risk of getting your rugs wet or stained. The Ecovacs X8 can only raise its mop 10mm, not remove it, so it struggles on high-pile carpets.\nAlong with dropping its pads, the X40 can also extend and swing them to get under your cabinets and consoles. The X8 can extend to an edge, but won’t get under those low cabinets or furniture. I watched the X40 spread its mops wide apart and swing behind my TV console, allowing it to access the dust wedged a good inch under it.\nHowever, because the X40 features dual spinning mop pads rather than a self-cleaning roller mop, it requires more frequent returns to clean the mops, which means it takes longer to clean your home. The X40’s spinning pads are effective at scrubbing your floors, but I found the X8’s roller mop to be better overall and more consistent.\n\n\n\n\n\n\n\nThe X40 can clean its washboard and features AI-powered smart dirt detection, which uses its cameras to identify spills, such as milk, or particularly dirty areas. When it spots something, it slows down and performs a more thorough cleaning. It also has an option to just mop. These are features the Ecovacs X8 doesn’t offer.\nDreame recently released the X50 Ultra, which adds 20,000Pa suction power and the ability to climb over higher thresholds. I’m currently testing this model.\nRead more of my Dream X40 Ultra review.\nBest robot vacuum and mop for hardwood floors\nMultifunction Dock: Yes, auto empty (2.5L) and drain/refill (2L dirty, 3L clean) / Mop style: Roller / Mop washing: Yes, warm water and hot air drying / Mop pressure: 10N, 170 RPM / Mop lift: Yes, 12mm /  Edge cleaning: No Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 8,000Pa / Vacuum brush style: Rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nIf you have mostly hardwood floors, the Eufy Omni S1 Pro is an excellent option. With its sleek, high-tech design and a long 11.4-inch roller mop, this product did an excellent job of keeping the hardwood floors of my main living area spotless. \nI found the Eufy’s longer roller mop to be slightly more effective than the Deebot X8’s, mopping evenly and getting up more dirt on its first pass. While there is no mop extension of edge mopping, its square shape does help it get into corners, and its dual spinning side brushes help pull in debris.\n\nHowever, its vacuuming prowess is middling; this really is a dedicated mopping robot. With just 8,000Pa suction power and a small rubber brush, it did a decent job of getting up debris, but left several flakes of oatmeal, thanks to its side brushes spinning the debris out beyond the bot’s reach. Its obstacle avoidance is also fairly average; it dodged larger items but struggled with cables. \nThe S1’s omni station is quite eye-catching, with a tall, futuristic design, and clear water tanks with glowing lights inside — although it might be considered an eyesore, depending on your style. Usefully, everything you need to interact with is located at the top, so there’s no need to bend down: a touchscreen display provides controls and the clean and dirty water tanks are easy to remove. \nIf you have tile or scraped wood floors, a bot with oscillating mop pads will be better at getting into the crevices\nWhile it has a mop lift of 12mm (which is higher than the X8’s), it really struggled on my high-pile carpets, to the point where I had to set keep-out zones around them. \nLike the X8, the S1 self-cleans the mop with water jets as it’s working, and you can set how frequently it returns to the base station for a thorough clean with warm water before continuing to mop. It will also dry the mop with hot air, which is effective, if noisy.\n\n\nNeither the X8 nor the S1 have self-cleaning washboards, something Dreame offers. This is where the dock automatically washes the mopping tray in the dock – Dreame’s uses little wipers that go back and forth. It still needs to be cleaned eventually, but it does help keep the ick at bay for longer. \nThe S1 station’s debris filter got grungy fast and required manual cleaning, although this is fairly straightforward. After a month of use, I also had to disassemble the scraper and filter inside the bot, as well as remove the roller mop. This is something you’ll need to do for all mopping bots, but the Eufy’s was the most involved process, requiring me to disassemble multiple parts.\nIn my testing, I found that roller mops are great for most hardwood floors, but if you have lots of tile or scraped wood floors with grooves and nooks and crannies, a bot with oscillating mop pads will be better, as these do a better job of getting into crevices such as grout lines. \nBest robot vacuum and mop for tile floors\nMultifunction Dock: Yes, auto, empty (2.5L) and drain/refill (4.1L dirty, 4.5L clean) / Mop style: Dual triangular spinning pads / Mop washing: Yes, hot air drying / Mop Pressure: 2.6lbs at 180 RPM / Mop lift: Yes, 12mm / Edge cleaning: Yes, robot swing and fluffer / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 12,000Pa / Vacuum brush style: Single, conical rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcut\nNarwal’s latest flagship mopping bot, the Freo Z Ultra, combines everything I loved about the Freo X Ultra, and adds better vacuuming, better object avoidance, an auto-empty dock (a first for Narwal), and a fluffy side brush to polish your baseboards. It also now comes in gray (white robot vacuums are not a good idea, unless you like cleaning your robot vacuum).\nWith its dual, triangular spinning mop pads (the unique shape helps avoid missing spots), the Freo Z is a great choice for homes with lots of hard floors, and especially tile. The oscillating mop pads are slightly better than roller mops at getting into grout lines and other crevices found on natural surfaces. The Freo Z’s downward pressure of 2.6 lbs meant it did a great job of scrubbing up dried-on debris, excelling in my dried ketchup test, even getting the red gunk up from tile grout.\n\n\nLike the Deebot X8, the Freo Z can recognize various floor materials, including tile, hardwood, and marble, and clean in the direction of the flooring, such as along the wood grain. Unlike the X8, it automatically adjusts pressure and “mopping humidity” based on the floor type, using higher humidity on tile floors than on wood floors, which can be impacted by excessive moisture. The Freo Z also self-cleans its station and has a removable tray, making maintenance easier.\nThe Freo Z is remarkably quiet, making it a great option for running in a bedroom\nVacuuming is much better than the Freo X, with the Z boasting 12,000Pa. While that’s not as high as the X8, the Freo Z is remarkably quiet, making it a great option for running in a primary bedroom suite where you may have a tile bathroom combined with carpet. \nAs with the X8, the Narwal doesn’t deal well with high-pile rugs, as there’s still only a 12 mm mop lift and no automatic mop removal. However, you can set it to perform one of four actions when it encounters a carpet: sidestep, cross it without cleaning, power boost to clean the carpet more effectively, or regular cleaning.\nThe obstacle detection is vastly improved and very good. A dual camera system allows the bot to not only see objects but uses AI to identify what they are and “decide” how to clean them. The best use of this I saw in testing is when there was a large puddle of water and it automatically switched to mop-only so as not to suck up liquid.\nSimilarly, Narwal’s dirt detect feature is very good. The bot goes back and forth over a stain or dirty area to ensure it’s clean. \n\n\nMy two biggest gripes with the Freo Z are that it uses a lot of water; it doesn’t have an onboard water tank, so it has to return frequently to refill — and could only clean my 800 square foot area once before I needed to refill the main tank in the dock. By comparison, the X8’s tank only needed refilling after three runs.  \nAdditionally, its app can be frustrating. It’s not easy to navigate, gets hung up between screens, and frequently disconnects from the robot. However, unlike the X8, the Narwal has controls on top of the station to start a clean, and once I had programmed a schedule, I didn’t find myself needing to use the app much at all. \nThe fluffy sidebrush feels more of a novelty than a necessity and doesn’t really seem to do much. Also, at this price, it would be nice if the Narwal offered a self-cleaning washboard. However, its washboard is removable, which makes it easier to clean manually.\nBest robot vacuum and mop with a plumbing hookup\nMultifunction Dock: Yes, auto, empty (4L) and drain/refill (two separate devices) / Mop style: Roller / Mop washing: Yes (during use), hot air drying / Mop Pressure: 2.2lbs at 300 RPM / Mop lift: Yes, 7mm /  Edge cleaning: No / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 6,500Pa / Vacuum brush style: Single rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcut, Matter\nThe SwitchBot S10 is a multitasking robot that hooks into your plumbing for a virtually hands-free sweeping and mopping experience. It’s one of the best robot mops I’ve tested, thanks to its self-cleaning roller mop and the fact that I never had to empty or fill its water tanks. These two features meant I could set it and forget it and have clean floors for weeks.\nMy other favorite feature of the S10 is its dual docking system. Its main dock is a charging / auto-empty dock, and there’s a separate battery-powered dock water station that you can put in a different room. This battery-powered dock is what makes the S10 the best plumbing hookup option, as it gives you much more flexibility with placement. Roborock, Dreame, and Narwal also have plumbing hookup docks, but they require power (I’ve not tested either of those yet).\n\n\n\n\n\n\n\n\n\nWhile the SwitchBot is a decent vacuum, it’s not the best. Its relatively paltry 6,500Pa of suction power is low compared to the competition, but the bot’s weight did help the rubber roller brush dig into the carpet and get up most of the cat hair.\nS10 frequently got stuck on clothes left on my floor and bath mats — which are the bane of most mopping bots\nOther downsides include the AI obstacle avoidance, which isn’t great. The S10 frequently got stuck on clothes left on my floor and bath mats, its battery life is short, and it lacks high-end features like dirt detection. There is also no edge cleaning function, meaning it didn’t do a great job along baseboards and around furniture.\nSwitchBot recently announced the SwitchBot S20 Pro, slated to launch this summer. The upgrade addresses some of my issues with the S10, including adding an extendable roller mop and side brush to add edge cleaning, as well as 15,000Pa. It also comes with the option of two all-in-one auto-empty base stations: one with a regular water tank you manually refill, or one that can hook into your plumbing. But it will also work with the battery-powered water station. I plan on testing this soon.\nRead my full SwitchBot S10 review.\nHow I test robot vacuums\nI’ve been testing robot vacuums for 6 years and have tested over 60 models. I write The Verge’s Best robot vacuum buying guide and the Best budget robot vacuum guide, and for this guide, I tested 15 different mopping robots.\nTo evaluate the bots, I ran each regularly for at least a week and measured their progress, evaluating how clean the floor stays, how well they navigate, how often I had to refill the tanks, how well the auto-empty function worked, and how easy the app was to use.\nI run them in my kitchen, where I have hardwood floors, and in a large bathroom with a white tile floor — one that looks filthy just a day after being cleaned. For specific tests, I deploy a wet and dry challenge. The wet challenge features dried-on OJ and ketchup, plus fresh spills of milk, water, and some kind of sauce. For the dry challenge, I place cereal (usually Cheerios) and oatmeal (a really tough one to clean). I evaluate how well the bots deal with mopping the stains and vacuuming the debris.Finally, I test their obstacle detection by running them through an obstacle course featuring common robot trip-ups, including fake dog poop, cables, socks, and tricky chair legs.\nWhat I’m currently testing and what’s coming next\n\n\nRoborock’s Saros 10 ($1,599.99) and Saros 10R ($1,599.99) are upgrades to my pick for the best overall robot vacuum, the S8 MaxV Ultra. Both can automatically remove their mop pads when not needed, which is a new option for Roborock. One uses dual spinning mops, the other a flat vibrating pad.\nRoborock also recently announced the $2,599 Saros Z70, the first mass-produced robovac to feature a robotic arm that can pick up objects like socks and tissues. It has dual spinning mop pads that it can automatically remove. Roborock’s cheaper Qrevo Curv ($1,599.99) also has dual spinning mop pads (which you have to remove) and can raise itself to clear thresholds up to 40mm. The company’s $1,399.99 Qrevo Slim offers similar functions but features a new navigation system and lacks a lidar tower, allowing it to fit under low furniture.\niRobot’s new Roomba lineup features two models with dual spinning mopping pads and auto-wash docks. The new Roomba 505 also offers heated mop drying, a feature the higher-end Roomba Combo 10 Max lacks.\nThe Narwal Flow sports the brand’s first roller mop, which can also extend. It claims to be able to tackle thick, fluffy carpets with a deep carpet boost mode and is scheduled to arrive this June.\nThe Matic is a $1,095 robot vacuum that doesn’t need a cloud connection to work and can suck up wet spills as well as dry. Here’s some video of it in action.\nEureka’s $1,099.99 J20 features a very wide roller mop but only 8,000Pa suction. The new J15 Max Ultra ($1,299), coming this spring, can accurately spot liquids and automatically rotate its body to tackle wet spills with its dual spinning mopping pads. It’s an upgrade to the J15 Pro Ultra ($999.99), which can identify colored liquids but not clear or white ones.\nAs mentioned above, Ecovacs recently released a successor to the Deebot X8 Pro Omni, aptly called the X9 Pro Omni ($1,599.99 $1,299.99). It sports a roller mop like the X8 Pro, but the big difference is that the new model is designed to optimize airflow from intake to exhaust rather than relying solely on suction power. The upgrade could lead to better deep-cleaning, though we haven’t put it through its paces yet.\nThe Dreame X50 Ultra ($1,699.99) features a “motorized swing arm” that functions like a leg, enabling the robovac to climb over transitions up to 6cm tall. Otherwise, it’s a lot like the X40 Ultra in this guide, only with higher suction power and a retractable lidar tower.\nThe Switchbot S20 Pro is the successor to the S10 and scheduled to launch this summer. It features an extendable roller mop and side brush, as well as 15,000Pa of suction power, more than twice that of the S10.\nSharkNinja’s PowerDetect NeverTouch Pro 2-in-1 robot vacuum mop ($999.99) can lift itself up as high as 20mm to get over rugs and transitions. Its automatic empty /wash / dry cleaning station doesn’t require bags.\nPriced at $999.99, Eufy’s new Robot Vacuum Omni E28 is a self-emptying, self-refilling, and self-washing robot vacuum with a rolling mop that can go over tough stains a second time if needed. The charging dock also includes a built-in deep cleaner that sprays water to tackle stains before sucking the mess into a separate wastewater tank.\n\nPhotography by Jennifer Pattison Tuohy / The Verge\nUpdate, May 13th: Added Eufy’s Robot Vacuum Omni E28, mentioned the Ecovacs X9 Pro Omni, and adjusted prices / availability. Sheena Vasani also contributed to this post.\n"
      },
      {
        "title": "The 45 Best Shows on Max (aka HBO Max) Right Now (May 2025)",
        "url": "https://www.wired.com/story/hbo-max-best-shows-to-stream-right-now/",
        "source": "Wired",
        "category": "technology",
        "published": "Tue, 13 May 2025 19:00:00 +0000",
        "published_datetime": "2025-05-13T20:00:00",
        "summary": "Conan O’Brien Must Go, The Last of Us, and The Rehearsal are just a few of the shows you need to be watching on Max this month.",
        "content": "Conan O’Brien Must Go, The Last of Us, and The Rehearsal are just a few of the shows you need to be watching on Max this month."
      },
      {
        "title": "Don't unwrap options: There are better ways (2024)",
        "url": "https://corrode.dev/blog/rust-option-handling-best-practices/",
        "source": "Hacker News",
        "category": "technology",
        "published": "Tue, 13 May 2025 17:58:27 +0000",
        "published_datetime": "2025-05-13T18:58:27",
        "summary": "Comments",
        "content": "Comments"
      },
      {
        "title": "Samsung reveals the super-slim Galaxy S25 Edge with a laughably small battery",
        "url": "https://arstechnica.com/gadgets/2025/05/form-over-function-samsung-unveils-the-super-slim-galaxy-s25-edge/",
        "source": "Ars Technica",
        "category": "technology",
        "published": "Tue, 13 May 2025 15:14:43 +0000",
        "published_datetime": "2025-05-13T16:14:43",
        "summary": "Samsung released its Galaxy S25 series earlier this year to generally favorable reviews. It also teased the perplexingly thin S25 Edge, and now that phone is a reality. You can preorder Samsung's thinnest smartphone-ever today, but you should know what you're getting into. This $1,099 smartphone is incredibly slim, at just 5.8 mm, but it also steps down in the camera department and packs an anemic battery that may struggle to last all day.\nThis is a big, flat phone featuring a 120 Hz 6.7-inch OLED at 1440×3120. Like the S25 Ultra, it has a titanium frame with Gorilla Glass Victus 2 on the back. The front has Gorilla Glass Ceramic 2 for improved scratch protection. There's almost no bezel around the display—in fact, there's almost no phone around the display. The body is only 5.8 mm thick, a substantial reduction from the similarly sized S25+ at 7.3 mm. That's really this phone's claim to fame: It's really thin. Everything else (and we do mean everything) is secondary to that.\nCramming premium camera modules into a smartphone is an engineering challenge even when you're not trying to make the phone as slim as possible. Similar to foldables, there just isn't enough space in the S25 Edge for a full suite of Samsung cameras. Therefore, this phone only has two rear camera modules: a 200 MP primary shooter that appears identical to the S25 Ultra's and a meager 12 MP ultrawide. There's a 12 MP selfie camera on the front as well. There is no telephoto lens at all, which you get even on the base model S25.Read full article\nComments",
        "content": "Samsung released its Galaxy S25 series earlier this year to generally favorable reviews. It also teased the perplexingly thin S25 Edge, and now that phone is a reality. You can preorder Samsung's thinnest smartphone-ever today, but you should know what you're getting into. This $1,099 smartphone is incredibly slim, at just 5.8 mm, but it also steps down in the camera department and packs an anemic battery that may struggle to last all day.\nThis is a big, flat phone featuring a 120 Hz 6.7-inch OLED at 1440×3120. Like the S25 Ultra, it has a titanium frame with Gorilla Glass Victus 2 on the back. The front has Gorilla Glass Ceramic 2 for improved scratch protection. There's almost no bezel around the display—in fact, there's almost no phone around the display. The body is only 5.8 mm thick, a substantial reduction from the similarly sized S25+ at 7.3 mm. That's really this phone's claim to fame: It's really thin. Everything else (and we do mean everything) is secondary to that.\nCramming premium camera modules into a smartphone is an engineering challenge even when you're not trying to make the phone as slim as possible. Similar to foldables, there just isn't enough space in the S25 Edge for a full suite of Samsung cameras. Therefore, this phone only has two rear camera modules: a 200 MP primary shooter that appears identical to the S25 Ultra's and a meager 12 MP ultrawide. There's a 12 MP selfie camera on the front as well. There is no telephoto lens at all, which you get even on the base model S25.Read full article\nComments"
      },
      {
        "title": "8 Best Automatic Litter Boxes (2025), Tested and Reviewed",
        "url": "https://www.wired.com/gallery/the-best-automatic-cat-litter-boxes/",
        "source": "Wired",
        "category": "technology",
        "published": "Tue, 13 May 2025 13:38:00 +0000",
        "published_datetime": "2025-05-13T14:38:00",
        "summary": "With these high-tech automatic litter boxes, gone are the days of scooping and smells. Welcome to the future.",
        "content": "With these high-tech automatic litter boxes, gone are the days of scooping and smells. Welcome to the future."
      },
      {
        "title": "New attack can steal cryptocurrency by planting false memories in AI chatbots",
        "url": "https://arstechnica.com/security/2025/05/ai-agents-that-autonomously-trade-cryptocurrency-arent-ready-for-prime-time/",
        "source": "Ars Technica",
        "category": "technology",
        "published": "Tue, 13 May 2025 13:00:17 +0000",
        "published_datetime": "2025-05-13T14:00:17",
        "summary": "Imagine a world where AI-powered bots can buy or sell cryptocurrency, make investments, and execute software-defined contracts at the blink of an eye, depending on minute-to-minute currency prices, breaking news, or other market-moving events. Then imagine an adversary causing the bot to redirect payments to an account they control by doing nothing more than entering a few sentences into the bot’s prompt.\nThat’s the scenario depicted in recently released research that developed a working exploit against ElizaOS, a fledgling open source framework.\nElizaOS is a framework for creating agents that use large language models to perform various blockchain-based transactions on behalf of a user based on a set of predefined rules. It was introduced in October under the name Ai16z and was changed to its current name in January. The framework remains largely experimental, but champions of decentralized autonomous organizations (DAOs)—a model in which communities or companies are governed by decentralized computer programs running on blockchains—see it as a potential engine for jumpstarting the creation of agents that automatically navigate these so-called DAOs on behalf of end users.Read full article\nComments",
        "content": "Imagine a world where AI-powered bots can buy or sell cryptocurrency, make investments, and execute software-defined contracts at the blink of an eye, depending on minute-to-minute currency prices, breaking news, or other market-moving events. Then imagine an adversary causing the bot to redirect payments to an account they control by doing nothing more than entering a few sentences into the bot’s prompt.\nThat’s the scenario depicted in recently released research that developed a working exploit against ElizaOS, a fledgling open source framework.\nElizaOS is a framework for creating agents that use large language models to perform various blockchain-based transactions on behalf of a user based on a set of predefined rules. It was introduced in October under the name Ai16z and was changed to its current name in January. The framework remains largely experimental, but champions of decentralized autonomous organizations (DAOs)—a model in which communities or companies are governed by decentralized computer programs running on blockchains—see it as a potential engine for jumpstarting the creation of agents that automatically navigate these so-called DAOs on behalf of end users.Read full article\nComments"
      },
      {
        "title": "2025 Bentley Continental GT: Big power, big battery, big price",
        "url": "https://arstechnica.com/cars/2025/05/the-2025-bentley-continental-gt-the-highs-and-lows-of-borrowed-bits/",
        "source": "Ars Technica",
        "category": "technology",
        "published": "Tue, 13 May 2025 12:52:39 +0000",
        "published_datetime": "2025-05-13T13:52:39",
        "summary": "The new Bentley Continental GT was already an imposing figure before this one left the factory in Crewe clad in dark satin paint and devoid of the usual chrome. And under the bonnet—or hood, if you prefer—you'll no longer find 12 cylinders. Instead, there's now an all-new twin-turbo V8 plug-in hybrid powertrain that offers both continent-crushing amounts of power and torque, but also a big enough battery for a day's driving around town.\nWe covered the details of the new hybrid a bit after our brief drive in the prototype this time last year. At the time, we also shared that the new PHEV bits have been brought over from Porsche. There's quite a lot of Panamera DNA in the new Continental GT, as well as some recent Audi ancestry. Bentley is quite good at the engineering remix, though: Little more than a decade after it was founded by W.O., the brand belonged to Rolls-Royce, and so started a long history of parts-sharing.\nMind if I use that?\nRolls-Royce and Bentley went their separate ways in 2003. The unraveling started a few years earlier when the aerospace company that owned them decided to rationalize and get itself out of the car business. In 1997, it sold the rights to Rolls-Royce to BMW, or at least the rights to the name and logos. Volkswagen Group got the rest, including the factory in Crewe, and got to work on a new generation of Bentleys for a new century.Read full article\nComments",
        "content": "The new Bentley Continental GT was already an imposing figure before this one left the factory in Crewe clad in dark satin paint and devoid of the usual chrome. And under the bonnet—or hood, if you prefer—you'll no longer find 12 cylinders. Instead, there's now an all-new twin-turbo V8 plug-in hybrid powertrain that offers both continent-crushing amounts of power and torque, but also a big enough battery for a day's driving around town.\nWe covered the details of the new hybrid a bit after our brief drive in the prototype this time last year. At the time, we also shared that the new PHEV bits have been brought over from Porsche. There's quite a lot of Panamera DNA in the new Continental GT, as well as some recent Audi ancestry. Bentley is quite good at the engineering remix, though: Little more than a decade after it was founded by W.O., the brand belonged to Rolls-Royce, and so started a long history of parts-sharing.\nMind if I use that?\nRolls-Royce and Bentley went their separate ways in 2003. The unraveling started a few years earlier when the aerospace company that owned them decided to rationalize and get itself out of the car business. In 1997, it sold the rights to Rolls-Royce to BMW, or at least the rights to the name and logos. Volkswagen Group got the rest, including the factory in Crewe, and got to work on a new generation of Bentleys for a new century.Read full article\nComments"
      },
      {
        "title": "Sandisk unveils WD_Black SSDs that balance performance and power efficiency",
        "url": "https://venturebeat.com/games/sandisk-unveils-wd_black-ssds-that-balance-performance-and-power-efficiency/",
        "source": "VentureBeat",
        "category": "technology",
        "published": "Tue, 13 May 2025 12:00:00 +0000",
        "published_datetime": "2025-05-13T13:00:00",
        "summary": "Sandisk unveiled the WD_BLACK SN8100 NVMe SSD with PCIe Gen 5.0, a SSD with better performance for gaming, content creation and AI workloads.Read More",
        "content": "Sandisk unveiled the WD_BLACK SN8100 NVMe SSD with PCIe Gen 5.0, a SSD with better performance for gaming, content creation and AI workloads.Read More"
      },
      {
        "title": "One hundred and one rules of effective living",
        "url": "https://mitchhorowitz.substack.com/p/101-rules-of-effective-living",
        "source": "Hacker News",
        "category": "technology",
        "published": "Tue, 13 May 2025 11:41:42 +0000",
        "published_datetime": "2025-05-13T12:41:42",
        "summary": "Comments",
        "content": "Comments"
      },
      {
        "title": "Dutch scientists built a brainless soft robot that runs on air",
        "url": "https://arstechnica.com/science/2025/05/dutch-scientists-built-a-brainless-soft-robot-that-runs-on-air/",
        "source": "Ars Technica",
        "category": "technology",
        "published": "Tue, 13 May 2025 11:10:17 +0000",
        "published_datetime": "2025-05-13T12:10:17",
        "summary": "\nMost robots rely on complex control systems, AI-powered or otherwise, that govern their movement. These centralized electronic brains need time to react to changes in their environment and produce movements that are often awkwardly, well, robotic.\nIt doesn’t have to be that way. A team of Dutch scientists at the FOM Institute for Molecular and Atomic Physics (AMOLF) in Amsterdam built a new kind of robot that can run, go over obstacles, and even swim, all driven only by the flow of air. And it does all that with no brain at all.Read full article\nComments",
        "content": "\nMost robots rely on complex control systems, AI-powered or otherwise, that govern their movement. These centralized electronic brains need time to react to changes in their environment and produce movements that are often awkwardly, well, robotic.\nIt doesn’t have to be that way. A team of Dutch scientists at the FOM Institute for Molecular and Atomic Physics (AMOLF) in Amsterdam built a new kind of robot that can run, go over obstacles, and even swim, all driven only by the flow of air. And it does all that with no brain at all.Read full article\nComments"
      },
      {
        "title": "Best Heart Rate Monitors (2025), WIRED Tested and Reviewed",
        "url": "https://www.wired.com/gallery/best-heart-rate-monitors/",
        "source": "Wired",
        "category": "technology",
        "published": "Tue, 13 May 2025 11:02:00 +0000",
        "published_datetime": "2025-05-13T12:02:00",
        "summary": "These chest straps and watches will help you keep your finger on your pulse—and many other heart-related metrics.",
        "content": "These chest straps and watches will help you keep your finger on your pulse—and many other heart-related metrics."
      },
      {
        "title": "The 27 Best Amazon Pet Day Deals (2025)",
        "url": "https://www.wired.com/story/amazon-pet-day-deals/",
        "source": "Wired",
        "category": "technology",
        "published": "Tue, 13 May 2025 07:00:00 +0000",
        "published_datetime": "2025-05-13T08:00:00",
        "summary": "Amazon sale days just keep expanding. Here are the best deals on some of our favorite pet tech during Amazon Pet Day on May 13 and 14.",
        "content": "Amazon sale days just keep expanding. Here are the best deals on some of our favorite pet tech during Amazon Pet Day on May 13 and 14."
      },
      {
        "title": "Top KitchenAid Promo Codes and Coupons",
        "url": "https://www.wired.com/story/exclusive-kitchenaid-promo-code/",
        "source": "Wired",
        "category": "technology",
        "published": "Tue, 13 May 2025 05:00:00 +0000",
        "published_datetime": "2025-05-13T06:00:00",
        "summary": "Get $240 off select appliances, 15% off most regular-price items, free delivery, and other great savings today on WIRED.",
        "content": "Get $240 off select appliances, 15% off most regular-price items, free delivery, and other great savings today on WIRED."
      },
      {
        "title": "Samsung Galaxy S25 Edge: Specs, Features, Price, Release Date",
        "url": "https://www.wired.com/story/samsung-galaxy-s25-edge-price-features-release-date/",
        "source": "Wired",
        "category": "technology",
        "published": "Tue, 13 May 2025 00:00:00 +0000",
        "published_datetime": "2025-05-13T01:00:00",
        "summary": "The Galaxy S25 Edge begs the question: Do you want a thin phone or better battery life?",
        "content": "The Galaxy S25 Edge begs the question: Do you want a thin phone or better battery life?"
      }
    ],
    "article_count": 14,
    "dominant_terms": [
      "best",
      "better",
      "s25",
      "2025",
      "robot",
      "max",
      "edge",
      "amazon",
      "effective",
      "reviewed",
      "tested",
      "wired",
      "comments",
      "automatic",
      "rules",
      "price",
      "living",
      "galaxy",
      "phone",
      "power"
    ],
    "sentiment": {
      "compound": 0.6439714285714286,
      "positive": 0.17642857142857143,
      "negative": 0.016,
      "neutral": 0.8075,
      "overall": "positive"
    },
    "relevance_score": 0.9004029947768684,
    "suggested_title": "The best robot vacuum and mop to buy right now",
    "keywords": [
      "best",
      "better",
      "s25",
      "2025",
      "robot",
      "max",
      "edge",
      "amazon",
      "effective",
      "reviewed",
      "Shows",
      "HBO",
      "Right",
      "May",
      "Samsung"
    ],
    "summary": "Best robot vacuum and mop for tile floors\nMultifunction Dock: Yes, auto, empty (2.5L) and drain/refill (4.1L dirty, 4.5L clean) / Mop style: Dual triangular spinning pads / Mop washing: Yes, hot air drying / Mop Pressure: 2.6lbs at 180 RPM / Mop lift: Yes, 12mm / Edge cleaning: Yes, robot swing and fluffer / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 12,000Pa / Vacuum brush style: Single, conical rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcut\nNarwal’s latest flagship mopping bot, the Freo Z Ultra, combines everything I loved about the Freo X Ultra, and adds better vacuuming, better object avoidance, an auto-empty dock (a first for Narwal), and a fluffy side brush to polish your baseboards."
  },
  {
    "id": 0,
    "articles": [
      {
        "title": "Judge slams lawyers for &#8216;bogus AI-generated research&#8217;",
        "url": "https://www.theverge.com/news/666443/judge-slams-lawyers-ai-bogus-research",
        "source": "The Verge",
        "category": "technology",
        "published": "2025-05-13T18:22:47-04:00",
        "published_datetime": "2025-05-13T23:22:47",
        "summary": "\n\n\n\nA California judge slammed a pair of law firms for the undisclosed use of AI after he received a supplemental brief with “numerous false, inaccurate, and misleading legal citations and quotations.” In a ruling submitted last week, Judge Michael Wilner imposed $31,000 in sanctions against the law firms involved, saying “no reasonably competent attorney should out-source research and writing” to AI, as pointed out by law professors Eric Goldman and Blake Reid on Bluesky.\n“I read their brief, was persuaded (or at least intrigued) by the authorities that they cited, and looked up the decisions to learn more about them – only to find that they didn’t exist,” Judge Milner writes. “That’s scary. It almost led to the scarier outcome (from my perspective) of including those bogus materials in a judicial order.”\nAs noted in the filing, a plaintiff’s legal representative for a civil lawsuit against State Farm used AI to generate an outline for a supplemental brief. However, this outline contained “bogus AI-generated research” when it was sent to a separate law firm, K&L Gates, which added the information to a brief. “No attorney or staff member at either firm apparently cite-checked or otherwise reviewed that research before filing the brief,” Judge Milner writes.\nWhen Judge Milner reviewed the brief, he found that “at least two of the authorities cited do not exist at all.” After asking K&L Gates for clarification, the firm resubmitted the brief, which Judge Milner said contained “considerably more made-up citations and quotations beyond the two initial errors.” He then issued an Order to Show Cause, resulting in lawyers giving sworn statements that confirm the use of AI. The lawyer who created the outline admitted to using Google Gemini, as well as the AI legal research tools in Westlaw Precision with CoCounsel.\nThis isn’t the first time lawyers have been caught using AI in the courtroom. Former Trump lawyer Michael Cohen cited made-up court cases in a legal document after mistaking Google Gemini, then called Bard, as “a super-charged search engine” rather than an AI chatbot. A judge also found that lawyers suing a Colombian airline included a slew of phony cases generated by ChatGPT in their brief.\n“The initial, undisclosed use of AI products to generate the first draft of the brief was flat-out wrong,” Judge Milner writes. “And sending that material to other lawyers without disclosing its sketchy AI origins realistically put those professionals in harm’s way.”",
        "content": "\n\n\n\nA California judge slammed a pair of law firms for the undisclosed use of AI after he received a supplemental brief with “numerous false, inaccurate, and misleading legal citations and quotations.” In a ruling submitted last week, Judge Michael Wilner imposed $31,000 in sanctions against the law firms involved, saying “no reasonably competent attorney should out-source research and writing” to AI, as pointed out by law professors Eric Goldman and Blake Reid on Bluesky.\n“I read their brief, was persuaded (or at least intrigued) by the authorities that they cited, and looked up the decisions to learn more about them – only to find that they didn’t exist,” Judge Milner writes. “That’s scary. It almost led to the scarier outcome (from my perspective) of including those bogus materials in a judicial order.”\nAs noted in the filing, a plaintiff’s legal representative for a civil lawsuit against State Farm used AI to generate an outline for a supplemental brief. However, this outline contained “bogus AI-generated research” when it was sent to a separate law firm, K&L Gates, which added the information to a brief. “No attorney or staff member at either firm apparently cite-checked or otherwise reviewed that research before filing the brief,” Judge Milner writes.\nWhen Judge Milner reviewed the brief, he found that “at least two of the authorities cited do not exist at all.” After asking K&L Gates for clarification, the firm resubmitted the brief, which Judge Milner said contained “considerably more made-up citations and quotations beyond the two initial errors.” He then issued an Order to Show Cause, resulting in lawyers giving sworn statements that confirm the use of AI. The lawyer who created the outline admitted to using Google Gemini, as well as the AI legal research tools in Westlaw Precision with CoCounsel.\nThis isn’t the first time lawyers have been caught using AI in the courtroom. Former Trump lawyer Michael Cohen cited made-up court cases in a legal document after mistaking Google Gemini, then called Bard, as “a super-charged search engine” rather than an AI chatbot. A judge also found that lawyers suing a Colombian airline included a slew of phony cases generated by ChatGPT in their brief.\n“The initial, undisclosed use of AI products to generate the first draft of the brief was flat-out wrong,” Judge Milner writes. “And sending that material to other lawyers without disclosing its sketchy AI origins realistically put those professionals in harm’s way.”"
      },
      {
        "title": "What your tools miss at 2:13 AM: How gen AI attack chains exploit telemetry lag – Part 2",
        "url": "https://venturebeat.com/ai/what-your-tools-miss-at-213-am-how-gen-ai-attack-chains-exploit-telemetry-lag-part-2/",
        "source": "VentureBeat",
        "category": "technology",
        "published": "Tue, 13 May 2025 22:05:32 +0000",
        "published_datetime": "2025-05-13T23:05:32",
        "summary": "Explore a strategic 2025 roadmap for cybersecurity leaders to tackle GenAI, insider risks, and team burnout with actionable guidance.Read More",
        "content": "Explore a strategic 2025 roadmap for cybersecurity leaders to tackle GenAI, insider risks, and team burnout with actionable guidance.Read More"
      },
      {
        "title": "xAI’s promised safety report is MIA",
        "url": "https://techcrunch.com/2025/05/13/xais-promised-safety-report-is-mia/",
        "source": "TechCrunch",
        "category": "technology",
        "published": "Tue, 13 May 2025 22:02:17 +0000",
        "published_datetime": "2025-05-13T23:02:17",
        "summary": "Elon Musk’s AI company, xAI, has missed a self-imposed deadline to publish a finalized AI safety framework, as noted by watchdog group The Midas Project. xAI isn’t exactly known for its strong commitments to AI safety as it’s commonly understood. A recent report found that the company’s AI chatbot, Grok, would undress photos of women when […]",
        "content": "Elon Musk’s AI company, xAI, has missed a self-imposed deadline to publish a finalized AI safety framework, as noted by watchdog group The Midas Project. xAI isn’t exactly known for its strong commitments to AI safety as it’s commonly understood. A recent report found that the company’s AI chatbot, Grok, would undress photos of women when […]"
      },
      {
        "title": "Microsoft shares its process (and discarded ideas) for redone Windows 11 Start menu",
        "url": "https://arstechnica.com/gadgets/2025/05/microsoft-shares-its-process-and-discarded-ideas-for-redone-windows-11-start-menu/",
        "source": "Ars Technica",
        "category": "technology",
        "published": "Tue, 13 May 2025 20:44:34 +0000",
        "published_datetime": "2025-05-13T21:44:34",
        "summary": "Microsoft put a lot of focus on Windows 11's design when it released the operating system in 2021, making a clean break with the design language of Windows 10 (which had, itself, simply tweaked and adapted Windows 8's design language from 2012). Since then, Microsoft has continued to modify the software's design in bits and pieces, both for individual apps and for foundational UI elements like the Taskbar, system tray, and Windows Explorer.\nMicrosoft is currently testing a redesigned version of the Windows 11 Start menu, one that reuses most of the familiar elements from the current design but reorganizes them and gives users a few additional customization options. On its Microsoft Design blog today, the company walked through the new design and showed some of the ideas that were tried and discarded in the process.\n\n\n\n\n\n\n      This discarded Start menu design toyed with an almost Windows XP-ish left-hand sidebar, among other elements.\n\n              \n          Credit:\n\n          \n          Microsoft\n\n                  \n\n\n\n\n\n\n\n\n\n\n      Some designs brings to mind the full-screen Start experience of Windows 8.\n\n              \n          Credit:\n\n          \n          Microsoft\n\n                  \n\n\n\n\n\n\n\n\n\n\n      Another big design with acres of icons and more space dedicated to non-app-icons.\n\n              \n          Credit:\n\n          \n          Microsoft\n\n                  \n\n\n\n\n\n\n\n\n\n\n      This design included thumbnail previews for recently opened files.\n\n              \n          Credit:\n\n          \n          Microsoft\n\n                  \n\n\n\n\n\n\n\n\n\n\n      Another discarded Start menu design.\n\n              \n          Credit:\n\n          \n          Microsoft\n\n                  \n\n\n\n\nMicrosoft says it tested its menu designs with \"over 300 Windows 11 fans\" in unmoderated studies, \"and dozens more\" in \"live co-creation calls.\" These testers' behavior and reactions informed what Microsoft kept and what it discarded.Read full article\nComments",
        "content": "Microsoft put a lot of focus on Windows 11's design when it released the operating system in 2021, making a clean break with the design language of Windows 10 (which had, itself, simply tweaked and adapted Windows 8's design language from 2012). Since then, Microsoft has continued to modify the software's design in bits and pieces, both for individual apps and for foundational UI elements like the Taskbar, system tray, and Windows Explorer.\nMicrosoft is currently testing a redesigned version of the Windows 11 Start menu, one that reuses most of the familiar elements from the current design but reorganizes them and gives users a few additional customization options. On its Microsoft Design blog today, the company walked through the new design and showed some of the ideas that were tried and discarded in the process.\n\n\n\n\n\n\n      This discarded Start menu design toyed with an almost Windows XP-ish left-hand sidebar, among other elements.\n\n              \n          Credit:\n\n          \n          Microsoft\n\n                  \n\n\n\n\n\n\n\n\n\n\n      Some designs brings to mind the full-screen Start experience of Windows 8.\n\n              \n          Credit:\n\n          \n          Microsoft\n\n                  \n\n\n\n\n\n\n\n\n\n\n      Another big design with acres of icons and more space dedicated to non-app-icons.\n\n              \n          Credit:\n\n          \n          Microsoft\n\n                  \n\n\n\n\n\n\n\n\n\n\n      This design included thumbnail previews for recently opened files.\n\n              \n          Credit:\n\n          \n          Microsoft\n\n                  \n\n\n\n\n\n\n\n\n\n\n      Another discarded Start menu design.\n\n              \n          Credit:\n\n          \n          Microsoft\n\n                  \n\n\n\n\nMicrosoft says it tested its menu designs with \"over 300 Windows 11 fans\" in unmoderated studies, \"and dozens more\" in \"live co-creation calls.\" These testers' behavior and reactions informed what Microsoft kept and what it discarded.Read full article\nComments"
      },
      {
        "title": "Seven things we learned from WhatsApp vs. NSO Group spyware lawsuit",
        "url": "https://techcrunch.com/2025/05/13/seven-things-we-learned-from-whatsapp-vs-nso-group-spyware-lawsuit/",
        "source": "TechCrunch",
        "category": "technology",
        "published": "Tue, 13 May 2025 20:00:00 +0000",
        "published_datetime": "2025-05-13T21:00:00",
        "summary": "The landmark trial between WhatsApp and NSO Group unearthed several new revelations. We recap some of them here.",
        "content": "The landmark trial between WhatsApp and NSO Group unearthed several new revelations. We recap some of them here."
      },
      {
        "title": "AWS enters into ‘strategic partnership’ with Saudi Arabia-backed Humain",
        "url": "https://techcrunch.com/2025/05/13/aws-enters-into-strategic-partnership-with-saudi-arabia-backed-humain/",
        "source": "TechCrunch",
        "category": "technology",
        "published": "Tue, 13 May 2025 19:05:26 +0000",
        "published_datetime": "2025-05-13T20:05:26",
        "summary": "Amazon says it will work with Humain, the AI company recently launched by Saudi Arabia’s ruler, Mohammed bin Salman, to invest “$5 billion-plus” in a strategic partnership to build an “AI Zone” in Saudi Arabia. The AI Zone will include dedicated Amazon Web Services (AWS) AI infrastructure, servers, networks, and training and certification programs, according […]",
        "content": "Amazon says it will work with Humain, the AI company recently launched by Saudi Arabia’s ruler, Mohammed bin Salman, to invest “$5 billion-plus” in a strategic partnership to build an “AI Zone” in Saudi Arabia. The AI Zone will include dedicated Amazon Web Services (AWS) AI infrastructure, servers, networks, and training and certification programs, according […]"
      },
      {
        "title": "Tencent hires WizardLM team, a Microsoft AI group with an odd history",
        "url": "https://techcrunch.com/2025/05/13/tencent-hires-wizardlm-team-a-microsoft-ai-group-with-an-odd-history/",
        "source": "TechCrunch",
        "category": "technology",
        "published": "Tue, 13 May 2025 17:58:58 +0000",
        "published_datetime": "2025-05-13T18:58:58",
        "summary": "WizardLM, a Beijing-based Microsoft AI research group, appears to have joined Tencent, the Chinese company that owns WeChat and blockbuster games like PUBG Mobile. In a post on X on Tuesday, Can Xu, a senior AI researcher who led a number of projects within WizardLM, said that he and the team left Microsoft to join […]",
        "content": "WizardLM, a Beijing-based Microsoft AI research group, appears to have joined Tencent, the Chinese company that owns WeChat and blockbuster games like PUBG Mobile. In a post on X on Tuesday, Can Xu, a senior AI researcher who led a number of projects within WizardLM, said that he and the team left Microsoft to join […]"
      },
      {
        "title": "Show HN: HelixDB – Open-source vector-graph database for AI applications (Rust)",
        "url": "https://github.com/HelixDB/helix-db/",
        "source": "Hacker News",
        "category": "technology",
        "published": "Tue, 13 May 2025 17:26:38 +0000",
        "published_datetime": "2025-05-13T18:26:38",
        "summary": "Comments",
        "content": "Comments"
      },
      {
        "title": "Office apps on Windows 10 are no longer tied to its October 2025 end-of-support date",
        "url": "https://arstechnica.com/gadgets/2025/05/microsoft-extends-office-support-on-windows-10-through-2028/",
        "source": "Ars Technica",
        "category": "technology",
        "published": "Tue, 13 May 2025 15:24:58 +0000",
        "published_datetime": "2025-05-13T16:24:58",
        "summary": "For most users, Windows 10 will stop receiving security updates and other official support from Microsoft on October 14, 2025, about five months from today. Until recently, Microsoft had also said that users running the Microsoft Office apps on Windows 10 would also lose support on that date, whether they were using the continually updated Microsoft 365 versions of those apps or the buy-once-own-forever versions included in Office 2021 or Office 2024.\nMicrosoft has recently tweaked this policy, however (as seen by The Verge). Now, Windows 10 users of the Microsoft 365 apps will still be eligible to receive software updates and support through October of 2028, \"in the interest of maintaining your security while you upgrade to Windows 11.\" Microsoft is taking a similar approach to Windows Defender malware definitions, which will be offered to Windows 10 users \"through at least October 2028.\"\nThe policy is a change from a few months ago, when Microsoft insisted that Office apps running on Windows 10 would become officially unsupported on October 14. The perpetually licensed versions of Office will be supported in accordance with Microsoft's \"Fixed Lifecycle Policy,\" which guarantees support and security updates for a fixed number of years after a software product's initial release. For Office 2021, this means Windows 10 users will get support through October of 2026; for Office 2024, this should extend to October of 2029.Read full article\nComments",
        "content": "For most users, Windows 10 will stop receiving security updates and other official support from Microsoft on October 14, 2025, about five months from today. Until recently, Microsoft had also said that users running the Microsoft Office apps on Windows 10 would also lose support on that date, whether they were using the continually updated Microsoft 365 versions of those apps or the buy-once-own-forever versions included in Office 2021 or Office 2024.\nMicrosoft has recently tweaked this policy, however (as seen by The Verge). Now, Windows 10 users of the Microsoft 365 apps will still be eligible to receive software updates and support through October of 2028, \"in the interest of maintaining your security while you upgrade to Windows 11.\" Microsoft is taking a similar approach to Windows Defender malware definitions, which will be offered to Windows 10 users \"through at least October 2028.\"\nThe policy is a change from a few months ago, when Microsoft insisted that Office apps running on Windows 10 would become officially unsupported on October 14. The perpetually licensed versions of Office will be supported in accordance with Microsoft's \"Fixed Lifecycle Policy,\" which guarantees support and security updates for a fixed number of years after a software product's initial release. For Office 2021, this means Windows 10 users will get support through October of 2026; for Office 2024, this should extend to October of 2029.Read full article\nComments"
      },
      {
        "title": "An $8.4 Billion Chinese Hub for Crypto Crime Is Incorporated in Colorado",
        "url": "https://www.wired.com/story/xinbi-guarantee-crypto-scam-hub/",
        "source": "Wired",
        "category": "technology",
        "published": "Tue, 13 May 2025 14:00:00 +0000",
        "published_datetime": "2025-05-13T15:00:00",
        "summary": "Before a crackdown by Telegram, Xinbi Guarantee grew into one of the internet’s biggest markets for Chinese-speaking crypto scammers and money laundering. And all registered to a US address.",
        "content": "Before a crackdown by Telegram, Xinbi Guarantee grew into one of the internet’s biggest markets for Chinese-speaking crypto scammers and money laundering. And all registered to a US address."
      },
      {
        "title": "Sony Bravia Theater System 6 Review: Great Performance, Odd Design",
        "url": "https://www.wired.com/review/sony-bravia-theater-system-6/",
        "source": "Wired",
        "category": "technology",
        "published": "Tue, 13 May 2025 13:03:00 +0000",
        "published_datetime": "2025-05-13T14:03:00",
        "summary": "Sony’s unexpected 5.1 surround system provides rip-roaring fun in an old-school design.",
        "content": "Sony’s unexpected 5.1 surround system provides rip-roaring fun in an old-school design."
      },
      {
        "title": "A US court just put ownership of CRISPR back in play",
        "url": "https://www.technologyreview.com/2025/05/13/1116344/a-us-court-just-put-ownership-of-crispr-back-in-play/",
        "source": "MIT Technology Review",
        "category": "technology",
        "published": "Tue, 13 May 2025 08:00:00 +0000",
        "published_datetime": "2025-05-13T09:00:00",
        "summary": "The CRISPR patents are back in play.\nOn Monday, the US Court of Appeals for the Federal Circuit said scientists Jennifer Doudna and Emmanuelle Charpentier will get another chance to show they ought to own the key patents on what many consider the defining biotechnology invention of the 21st century. \nThe pair shared a 2020 Nobel Prize for developing the versatile gene-editing system, which is already being used to treat various genetic disorders, including sickle cell disease. \nBut when key US patent rights were granted in 2014 to researcher Feng Zhang of the Broad Institute of MIT and Harvard, the decision set off a bitter dispute in which hundreds of millions of dollars—as well as scientific bragging rights—are at stake.\nThe new decision is a boost for the Nobelists, who had previously faced a string of demoralizing reversals over the patent rights in both the US and Europe.\n“This goes to who was the first to invent, who has priority, and who is entitled to the broadest patents,” says Jacob Sherkow, a law professor at the University of Illinois. \nHe says there is now at least a chance that Doudna and Charpentier “could walk away as the clear winner.”\nThe CRISPR patent battle is among the most byzantine ever, putting the technology alongside the steam engine, the telephone, the lightbulb, and the laser among the most hotly contested inventions in history.\nIn 2012, Doudna and Charpentier were first to publish a description of a CRISPR gene editor that could be programmed to precisely cut DNA in a test tube. There’s no dispute about that.\nHowever, the patent fight relates to the use of CRISPR to edit inside animal cells—like those of human beings. That’s considered a distinct invention, and one both sides say they were first to come up with that very same year. \nIn patent law, this moment is known as conception—the instant a lightbulb appears over an inventor’s head, revealing a definite and workable plan for how an invention is going to function.\nIn 2022, a specialized body called the Patent Trial and Appeal Board, or PTAB, decided that Doudna and Charpentier hadn’t fully conceived the invention because they initially encountered trouble getting their editor to work in fish and other species. Indeed, they had so much trouble that Zhang scooped them with a 2013 publication demonstrating he could use CRISPR to edit human cells.\nThe Nobelists appealed the finding, and yesterday the appeals court vacated it, saying the patent board applied the wrong standard and needs to reconsider the case. \nAccording to the court, Doudna and Charpentier didn’t have to “know their invention would work” to get credit for conceiving it. What could matter more, the court said, is that it actually did work in the end. \nIn a statement, the University of California, Berkeley, applauded the call for a do-over.  \n“Today’s decision creates an opportunity for the PTAB to reevaluate the evidence under the correct legal standard and confirm what the rest of the world has recognized: that the Doudna and Charpentier team were the first to develop this groundbreaking technology for the world to share,” Jeff Lamken, one of Berkeley’s attorneys, said in the statement.\nThe Broad Institute posted a statement saying it is “confident” the appeals board “will again confirm Broad’s patents, because the underlying facts have not changed.”\nThe decision is likely to reopen the investigation into what was written in 13-year-old lab notebooks and whether Zhang based his research, in part, on what he learned from Doudna and Charpentier’s publications. \nThe case will now return to the patent board for a further look, although Sherkow says the court finding can also be appealed directly to the US Supreme Court. ",
        "content": "The CRISPR patents are back in play.\nOn Monday, the US Court of Appeals for the Federal Circuit said scientists Jennifer Doudna and Emmanuelle Charpentier will get another chance to show they ought to own the key patents on what many consider the defining biotechnology invention of the 21st century. \nThe pair shared a 2020 Nobel Prize for developing the versatile gene-editing system, which is already being used to treat various genetic disorders, including sickle cell disease. \nBut when key US patent rights were granted in 2014 to researcher Feng Zhang of the Broad Institute of MIT and Harvard, the decision set off a bitter dispute in which hundreds of millions of dollars—as well as scientific bragging rights—are at stake.\nThe new decision is a boost for the Nobelists, who had previously faced a string of demoralizing reversals over the patent rights in both the US and Europe.\n“This goes to who was the first to invent, who has priority, and who is entitled to the broadest patents,” says Jacob Sherkow, a law professor at the University of Illinois. \nHe says there is now at least a chance that Doudna and Charpentier “could walk away as the clear winner.”\nThe CRISPR patent battle is among the most byzantine ever, putting the technology alongside the steam engine, the telephone, the lightbulb, and the laser among the most hotly contested inventions in history.\nIn 2012, Doudna and Charpentier were first to publish a description of a CRISPR gene editor that could be programmed to precisely cut DNA in a test tube. There’s no dispute about that.\nHowever, the patent fight relates to the use of CRISPR to edit inside animal cells—like those of human beings. That’s considered a distinct invention, and one both sides say they were first to come up with that very same year. \nIn patent law, this moment is known as conception—the instant a lightbulb appears over an inventor’s head, revealing a definite and workable plan for how an invention is going to function.\nIn 2022, a specialized body called the Patent Trial and Appeal Board, or PTAB, decided that Doudna and Charpentier hadn’t fully conceived the invention because they initially encountered trouble getting their editor to work in fish and other species. Indeed, they had so much trouble that Zhang scooped them with a 2013 publication demonstrating he could use CRISPR to edit human cells.\nThe Nobelists appealed the finding, and yesterday the appeals court vacated it, saying the patent board applied the wrong standard and needs to reconsider the case. \nAccording to the court, Doudna and Charpentier didn’t have to “know their invention would work” to get credit for conceiving it. What could matter more, the court said, is that it actually did work in the end. \nIn a statement, the University of California, Berkeley, applauded the call for a do-over.  \n“Today’s decision creates an opportunity for the PTAB to reevaluate the evidence under the correct legal standard and confirm what the rest of the world has recognized: that the Doudna and Charpentier team were the first to develop this groundbreaking technology for the world to share,” Jeff Lamken, one of Berkeley’s attorneys, said in the statement.\nThe Broad Institute posted a statement saying it is “confident” the appeals board “will again confirm Broad’s patents, because the underlying facts have not changed.”\nThe decision is likely to reopen the investigation into what was written in 13-year-old lab notebooks and whether Zhang based his research, in part, on what he learned from Doudna and Charpentier’s publications. \nThe case will now return to the patent board for a further look, although Sherkow says the court finding can also be appealed directly to the US Supreme Court. "
      }
    ],
    "article_count": 12,
    "dominant_terms": [
      "ai",
      "microsoft",
      "group",
      "windows",
      "design",
      "strategic",
      "chinese",
      "team",
      "nso",
      "sony",
      "safety",
      "judge",
      "crypto",
      "applications",
      "odd",
      "company",
      "source",
      "hn",
      "graph",
      "brief"
    ],
    "sentiment": {
      "compound": 0.37194166666666667,
      "positive": 0.09658333333333334,
      "negative": 0.06225,
      "neutral": 0.8410833333333333,
      "overall": "positive"
    },
    "relevance_score": 0.8242536027623457,
    "suggested_title": "Judge slams lawyers for &#8216;bogus AI-generated research&#8217;",
    "keywords": [
      "ai",
      "microsoft",
      "group",
      "windows",
      "design",
      "strategic",
      "chinese",
      "team",
      "nso",
      "sony",
      "Judge",
      "AI-generated",
      "Part",
      "MIA",
      "Start"
    ],
    "summary": "Show HN: HelixDB – Open-source vector-graph database for AI applications (Rust) Tencent hires WizardLM team, a Microsoft AI group with an odd history WizardLM, a Beijing-based Microsoft AI research group, appears to have joined Tencent, the Chinese company that owns WeChat and blockbuster games like PUBG Mobile. Elon Musk’s AI company, xAI, has missed a self-imposed deadline to publish a finalized AI safety framework, as noted by watchdog group The Midas Project. \n\n\n\nA California judge slammed a pair of law firms for the undisclosed use of AI after he received a supplemental brief with “numerous false, inaccurate, and misleading legal citations and quotations.” In a ruling submitted last week, Judge Michael Wilner imposed $31,000 in sanctions against the law firms involved, saying “no reasonably competent attorney should out-source research and writing” to AI, as pointed out by law professors Eric Goldman and Blake Reid on Bluesky."
  },
  {
    "id": 2,
    "articles": [
      {
        "title": "Apple TV&#8217;s wireless audio sync now works with Dolby Atmos",
        "url": "https://www.theverge.com/news/666418/apple-tv-4k-dolby-atmos-wireless-audio-sync-tvos-update",
        "source": "The Verge",
        "category": "technology",
        "published": "2025-05-13T18:15:21-04:00",
        "published_datetime": "2025-05-13T23:15:21",
        "summary": "\n\n\n\nApple is pushing a new software update for Apple TV today that includes a useful feature for home theater setups: the ability to automatically calibrate the synchronization of Dolby Atmos surround sound audio with your speakers.\nThe new tvOS 18.5 update enhances Apple’s existing Wireless Audio Sync feature, introduced in 2019, that lets you use your iPhone’s microphone to calibrate audio sources with your home theater speakers. Now it can help you get your TV video synced up with Atmos audio over either AirPlay or Bluetooth by accounting for latency.\nAs pointed out by MacRumors, people have complained about Apple TV Dolby Atmos syncing issues with sound bars and other speakers on Reddit and on Apple’s community discussions page, but until now they couldn’t use Apple’s tool to try to fix things.\nAfter updating, you can calibrate your audio by going to Settings > Video and Audio > Wireless Audio Sync on your Apple TV, and following the steps from there.",
        "content": "\n\n\n\nApple is pushing a new software update for Apple TV today that includes a useful feature for home theater setups: the ability to automatically calibrate the synchronization of Dolby Atmos surround sound audio with your speakers.\nThe new tvOS 18.5 update enhances Apple’s existing Wireless Audio Sync feature, introduced in 2019, that lets you use your iPhone’s microphone to calibrate audio sources with your home theater speakers. Now it can help you get your TV video synced up with Atmos audio over either AirPlay or Bluetooth by accounting for latency.\nAs pointed out by MacRumors, people have complained about Apple TV Dolby Atmos syncing issues with sound bars and other speakers on Reddit and on Apple’s community discussions page, but until now they couldn’t use Apple’s tool to try to fix things.\nAfter updating, you can calibrate your audio by going to Settings > Video and Audio > Wireless Audio Sync on your Apple TV, and following the steps from there."
      },
      {
        "title": "Paul McCartney and Dua Lipa call on the UK to pass AI copyright transparency law",
        "url": "https://www.theverge.com/news/666379/paul-mccartney-dua-lipa-uk-ai-copyright-amendment-letter",
        "source": "The Verge",
        "category": "technology",
        "published": "2025-05-13T18:01:30-04:00",
        "published_datetime": "2025-05-13T23:01:30",
        "summary": "\n\nDua Lipa performs on May 12th in Spain. | ﻿Photo by Aldara Zarraoa/Redferns for ABA\n\nLast week, Paul McCartney, Dua Lipa, Ian McKellen, Elton John, and hundreds of others in the UK creative industry signed an open letter backing an effort to force AI firms to reveal the copyrighted works used to train their models.  They support an amendment to the UK’s Data (Use and Access) Bill proposed by letter organizer Beeban Kidron, adding the requirement, which the UK government has opposed.\nThe British House of Lords passed the amendment yesterday, 272 to 125, reports The Guardian, and now it’s going back to the House of Commons, where the amendment could be removed again. The British government says the fight over the amendment “is holding back both the creative and tech sectors and needs to be resolved by new legislation,” writes The Guardian. \nFrom the letter:\n\nWe will lose an immense growth opportunity if we give our work away at the behest of a handful of powerful overseas tech companies, and with it our future income, the UK’s position as a creative powerhouse, and any hope that the technology of daily life will embody the values and laws of the United Kingdom.\n\nAlso signed by many media companies, music publishers, and arts organizations, the letter insists that the amendments “will spur a dynamic licensing market that will enhance the role of human creativity in the UK, positioning us as a key player in the global AI supply chain.”\nCompanies like OpenAI and Meta have been accused in court of using copyrighted material without permission to train their models. Baroness Beeban Kidron, who tabled the amendment, writes that although the UK’s creative industries welcome creative advancements enabled by AI, “…how AI is developed and who it benefits are two of the most important questions of our time.”  \n“My lords,” The Guardian quotes Kidron as saying yesterday, “it is an assault on the British economy and it is happening at scale to a sector worth £120bn to the UK, an industry that is central to the industrial strategy and of enormous cultural import.”",
        "content": "\n\nDua Lipa performs on May 12th in Spain. | ﻿Photo by Aldara Zarraoa/Redferns for ABA\n\nLast week, Paul McCartney, Dua Lipa, Ian McKellen, Elton John, and hundreds of others in the UK creative industry signed an open letter backing an effort to force AI firms to reveal the copyrighted works used to train their models.  They support an amendment to the UK’s Data (Use and Access) Bill proposed by letter organizer Beeban Kidron, adding the requirement, which the UK government has opposed.\nThe British House of Lords passed the amendment yesterday, 272 to 125, reports The Guardian, and now it’s going back to the House of Commons, where the amendment could be removed again. The British government says the fight over the amendment “is holding back both the creative and tech sectors and needs to be resolved by new legislation,” writes The Guardian. \nFrom the letter:\n\nWe will lose an immense growth opportunity if we give our work away at the behest of a handful of powerful overseas tech companies, and with it our future income, the UK’s position as a creative powerhouse, and any hope that the technology of daily life will embody the values and laws of the United Kingdom.\n\nAlso signed by many media companies, music publishers, and arts organizations, the letter insists that the amendments “will spur a dynamic licensing market that will enhance the role of human creativity in the UK, positioning us as a key player in the global AI supply chain.”\nCompanies like OpenAI and Meta have been accused in court of using copyrighted material without permission to train their models. Baroness Beeban Kidron, who tabled the amendment, writes that although the UK’s creative industries welcome creative advancements enabled by AI, “…how AI is developed and who it benefits are two of the most important questions of our time.”  \n“My lords,” The Guardian quotes Kidron as saying yesterday, “it is an assault on the British economy and it is happening at scale to a sector worth £120bn to the UK, an industry that is central to the industrial strategy and of enormous cultural import.”"
      },
      {
        "title": "Republicans push for a decadelong ban on states regulating AI",
        "url": "https://www.theverge.com/news/666288/republican-ai-state-regulation-ban-10-years",
        "source": "The Verge",
        "category": "technology",
        "published": "2025-05-13T17:10:51-04:00",
        "published_datetime": "2025-05-13T22:10:51",
        "summary": "\n\n\n\nRepublicans want to stop states from regulating AI. On Sunday, a Republican-led House committee submitted a budget reconciliation bill that proposes blocking states from enforcing “any law or regulation” targeting an exceptionally broad range of automated computing systems for 10 years after the law is enacted — a move that would stall efforts to regulate everything from AI chatbots to online search results. \nDemocrats are calling the new provision a “giant gift” to Big Tech, and organizations that promote AI oversight, like Americans for Responsible Innovation (ARI), say it could have “catastrophic consequences” for the public. It’s a gift companies like OpenAI have recently been seeking in Washington, aiming to avoid a slew of pending and active state laws. The budget reconciliation process allows lawmakers to fast-track bills related to government spending by requiring only a majority in the Senate rather than 60 votes to pass. \nThis bill, introduced by House Committee on Energy and Commerce Chairman Brett Guthrie (R-KY), would prevent states from imposing “legal impediments” — or restrictions to design, performance, civil liability, and documentation — on AI models and “automated decision” systems. It defines the latter category as “any computational process derived from machine learning, statistical modeling, data analytics, or artificial intelligence that issues a simplified output, including a score, classification, or recommendation, to materially influence or replace human decision making.”\nThat means the 10-year moratorium could extend well beyond AI. Travis Hall, the director for state engagement at the Center for Democracy & Technology, tells The Verge that the automated decision systems described in the bill “permeate digital services, from search results and mapping directions, to health diagnoses and risk analyses for sentencing decisions.”\nDuring the 2025 legislative session, states have proposed over 500 laws that Hall says this bill could “unequivocally block.” They focus on everything from chatbot safety for minors to deepfake restrictions and disclosures for the use of AI in political ads. If the bill passes, the handful of states that have successfully passed AI laws may also see their efforts go to waste. \n“The move to ban AI safeguards is a giveaway to Big Tech that will come back to bite us.”\nLast year, California Gov. Gavin Newsom signed a law preventing companies from using a performer’s AI-generated likeness without permission. Tennessee also adopted legislation with similar protections, while Utah has enacted a rule requiring certain businesses to disclose when customers are interacting with AI. Colorado’s AI law, which goes into effect next year, will require companies developing “high-risk” AI systems to protect customers from “algorithmic discrimination.”\nCalifornia also came close to enacting the landmark AI safety law SB 1047, which would have imposed security restrictions and legal liability on AI companies based in the state, like OpenAI, Anthropic, Google, and Meta. OpenAI opposed the bill, saying AI regulation should take place at the federal level instead of having a “patchwork” of state laws that could make it more difficult to comply. Gov. Newsom vetoed the bill last September, and OpenAI has made it clear it wants to avoid having state laws “bogging down innovation” in the future.\nWith so little AI regulation at the federal level, it’s been left up to the states to decide how to deal with AI. Even before the rise of generative AI, state legislators were grappling with how to fight algorithmic discrimination — including machine learning-based systems that display race or gender bias — in areas like housing and criminal justice. Efforts to combat this, too, would likely be hampered by the Republicans’ proposal.\nDemocrats have slammed the provision’s inclusion in the reconciliation bill, with Rep. Jan Schakowsky (D-IL) saying the 10-year ban will “allow AI companies to ignore consumer privacy protections, let deepfakes spread, and allow companies to profile and deceive consumers using AI.” In a statement published to X, Sen. Ed Markey (D-MA) said the proposal “will lead to a Dark Age for the environment, our children, and marginalized communities.”\nThe nonprofit organization Americans for Responsible Innovation (ARI) compared the potential ban to the government’s failure to properly regulate social media. “Lawmakers stalled on social media safeguards for a decade and we are still dealing with the fallout,” ARI president Brad Carson said in a statement. “Now apply those same harms to technology moving as fast as AI… Ultimately, the move to ban AI safeguards is a giveaway to Big Tech that will come back to bite us.”\nThis provision could hit a roadblock in the Senate, as ARI notes that the Byrd rule says reconciliation bills can only focus on fiscal issues. Still, it’s troubling to see Republican lawmakers push to block oversight of a new technology that’s being integrated into almost everything.",
        "content": "\n\n\n\nRepublicans want to stop states from regulating AI. On Sunday, a Republican-led House committee submitted a budget reconciliation bill that proposes blocking states from enforcing “any law or regulation” targeting an exceptionally broad range of automated computing systems for 10 years after the law is enacted — a move that would stall efforts to regulate everything from AI chatbots to online search results. \nDemocrats are calling the new provision a “giant gift” to Big Tech, and organizations that promote AI oversight, like Americans for Responsible Innovation (ARI), say it could have “catastrophic consequences” for the public. It’s a gift companies like OpenAI have recently been seeking in Washington, aiming to avoid a slew of pending and active state laws. The budget reconciliation process allows lawmakers to fast-track bills related to government spending by requiring only a majority in the Senate rather than 60 votes to pass. \nThis bill, introduced by House Committee on Energy and Commerce Chairman Brett Guthrie (R-KY), would prevent states from imposing “legal impediments” — or restrictions to design, performance, civil liability, and documentation — on AI models and “automated decision” systems. It defines the latter category as “any computational process derived from machine learning, statistical modeling, data analytics, or artificial intelligence that issues a simplified output, including a score, classification, or recommendation, to materially influence or replace human decision making.”\nThat means the 10-year moratorium could extend well beyond AI. Travis Hall, the director for state engagement at the Center for Democracy & Technology, tells The Verge that the automated decision systems described in the bill “permeate digital services, from search results and mapping directions, to health diagnoses and risk analyses for sentencing decisions.”\nDuring the 2025 legislative session, states have proposed over 500 laws that Hall says this bill could “unequivocally block.” They focus on everything from chatbot safety for minors to deepfake restrictions and disclosures for the use of AI in political ads. If the bill passes, the handful of states that have successfully passed AI laws may also see their efforts go to waste. \n“The move to ban AI safeguards is a giveaway to Big Tech that will come back to bite us.”\nLast year, California Gov. Gavin Newsom signed a law preventing companies from using a performer’s AI-generated likeness without permission. Tennessee also adopted legislation with similar protections, while Utah has enacted a rule requiring certain businesses to disclose when customers are interacting with AI. Colorado’s AI law, which goes into effect next year, will require companies developing “high-risk” AI systems to protect customers from “algorithmic discrimination.”\nCalifornia also came close to enacting the landmark AI safety law SB 1047, which would have imposed security restrictions and legal liability on AI companies based in the state, like OpenAI, Anthropic, Google, and Meta. OpenAI opposed the bill, saying AI regulation should take place at the federal level instead of having a “patchwork” of state laws that could make it more difficult to comply. Gov. Newsom vetoed the bill last September, and OpenAI has made it clear it wants to avoid having state laws “bogging down innovation” in the future.\nWith so little AI regulation at the federal level, it’s been left up to the states to decide how to deal with AI. Even before the rise of generative AI, state legislators were grappling with how to fight algorithmic discrimination — including machine learning-based systems that display race or gender bias — in areas like housing and criminal justice. Efforts to combat this, too, would likely be hampered by the Republicans’ proposal.\nDemocrats have slammed the provision’s inclusion in the reconciliation bill, with Rep. Jan Schakowsky (D-IL) saying the 10-year ban will “allow AI companies to ignore consumer privacy protections, let deepfakes spread, and allow companies to profile and deceive consumers using AI.” In a statement published to X, Sen. Ed Markey (D-MA) said the proposal “will lead to a Dark Age for the environment, our children, and marginalized communities.”\nThe nonprofit organization Americans for Responsible Innovation (ARI) compared the potential ban to the government’s failure to properly regulate social media. “Lawmakers stalled on social media safeguards for a decade and we are still dealing with the fallout,” ARI president Brad Carson said in a statement. “Now apply those same harms to technology moving as fast as AI… Ultimately, the move to ban AI safeguards is a giveaway to Big Tech that will come back to bite us.”\nThis provision could hit a roadblock in the Senate, as ARI notes that the Byrd rule says reconciliation bills can only focus on fiscal issues. Still, it’s troubling to see Republican lawmakers push to block oversight of a new technology that’s being integrated into almost everything."
      },
      {
        "title": "TikTok will let you use an AI prompt to turn a photo into a video",
        "url": "https://www.theverge.com/news/666268/tiktok-ai-alive-prompt-photo-image-video",
        "source": "The Verge",
        "category": "technology",
        "published": "2025-05-13T15:50:23-04:00",
        "published_datetime": "2025-05-13T20:50:23",
        "summary": "\n\n\n\nTikTok has a new AI-powered tool called “AI Alive” that will let you turn photos into video with a prompt to describe what you want the video to look like. It’s a little different from other \nYou can access the tool from TikTok’s Story Camera, and it uses “intelligent editing tools that give anyone, regardless of editing experience, the ability to transform static images into captivating, short-form videos enhanced with movement, atmospheric and creative effects,” according to a blog post.\nI tested the tool with a few pictures from my camera roll. After picking the photo, I could enter a prompt; TikTok initially filled the prompt box with “make this photo come alive.” Uploading usually took a few minutes, though the videos themselves were just a few seconds long. It also failed to make a picture where I asked it to make a cat jump and have an anime style into an anime.\n\nTikTok says it has some safety measures in place for the videos. “To help prevent people from creating content that violates our policies, moderation technology reviews the uploaded photo and written AI generation prompt as well as the AI Alive video before it’s shown to the creator,” TikTok says in the blog post. “A final safety check happens once a creator decides to post to their Story.” The video will also be labeled as AI-generated and will have C2PA metadata embedded.\nLet’s hope this tool doesn’t add in brand new people, like what has happened with TikTok’s AI “sway dance” filter.",
        "content": "\n\n\n\nTikTok has a new AI-powered tool called “AI Alive” that will let you turn photos into video with a prompt to describe what you want the video to look like. It’s a little different from other \nYou can access the tool from TikTok’s Story Camera, and it uses “intelligent editing tools that give anyone, regardless of editing experience, the ability to transform static images into captivating, short-form videos enhanced with movement, atmospheric and creative effects,” according to a blog post.\nI tested the tool with a few pictures from my camera roll. After picking the photo, I could enter a prompt; TikTok initially filled the prompt box with “make this photo come alive.” Uploading usually took a few minutes, though the videos themselves were just a few seconds long. It also failed to make a picture where I asked it to make a cat jump and have an anime style into an anime.\n\nTikTok says it has some safety measures in place for the videos. “To help prevent people from creating content that violates our policies, moderation technology reviews the uploaded photo and written AI generation prompt as well as the AI Alive video before it’s shown to the creator,” TikTok says in the blog post. “A final safety check happens once a creator decides to post to their Story.” The video will also be labeled as AI-generated and will have C2PA metadata embedded.\nLet’s hope this tool doesn’t add in brand new people, like what has happened with TikTok’s AI “sway dance” filter."
      },
      {
        "title": "TikTok launches TikTok AI Alive, a new image-to-video tool",
        "url": "https://techcrunch.com/2025/05/13/tiktok-launches-tiktok-ai-alive-a-new-image-to-video-tool/",
        "source": "TechCrunch",
        "category": "technology",
        "published": "Tue, 13 May 2025 17:56:34 +0000",
        "published_datetime": "2025-05-13T18:56:34",
        "summary": "TikTok is launching its first image-to-video AI feature, the company announced on Tuesday. The new feature is called “TikTok AI Alive” and allows users to turn static photos into videos within TikTok Stories. The feature is only accessible via TikTok’s Story Camera and uses AI to create short-form videos with “movement, atmospheric and creative effects,” […]",
        "content": "TikTok is launching its first image-to-video AI feature, the company announced on Tuesday. The new feature is called “TikTok AI Alive” and allows users to turn static photos into videos within TikTok Stories. The feature is only accessible via TikTok’s Story Camera and uses AI to create short-form videos with “movement, atmospheric and creative effects,” […]"
      },
      {
        "title": "GOP sneaks decade-long AI regulation ban into spending bill",
        "url": "https://arstechnica.com/ai/2025/05/gop-sneaks-decade-long-ai-regulation-ban-into-spending-bill/",
        "source": "Ars Technica",
        "category": "technology",
        "published": "Tue, 13 May 2025 14:58:26 +0000",
        "published_datetime": "2025-05-13T15:58:26",
        "summary": "On Sunday night, House Republicans added language to the Budget Reconciliation bill that would block all state and local governments from regulating AI for 10 years, 404 Media reports. The provision, introduced by Representative Brett Guthrie of Kentucky, states that \"no State or political subdivision thereof may enforce any law or regulation regulating artificial intelligence models, artificial intelligence systems, or automated decision systems during the 10 year period beginning on the date of the enactment of this Act.\"\nThe broad wording of the proposal would prevent states from enforcing both existing and proposed laws designed to protect citizens from AI systems. For example, California's recent law requiring health care providers to disclose when they use generative AI to communicate with patients would potentially become unenforceable. New York's 2021 law mandating bias audits for AI tools used in hiring decisions would also be affected, 404 Media notes. The measure would also halt legislation set to take effect in 2026 in California that requires AI developers to publicly document the data used to train their models.\nThe ban could also restrict how states allocate federal funding for AI programs. States currently control how they use federal dollars and can direct funding toward AI initiatives that may conflict with the administration's technology priorities. The Education Department's AI programs represent one example where states might pursue different approaches than those favored by the White House and its tech industry allies.Read full article\nComments",
        "content": "On Sunday night, House Republicans added language to the Budget Reconciliation bill that would block all state and local governments from regulating AI for 10 years, 404 Media reports. The provision, introduced by Representative Brett Guthrie of Kentucky, states that \"no State or political subdivision thereof may enforce any law or regulation regulating artificial intelligence models, artificial intelligence systems, or automated decision systems during the 10 year period beginning on the date of the enactment of this Act.\"\nThe broad wording of the proposal would prevent states from enforcing both existing and proposed laws designed to protect citizens from AI systems. For example, California's recent law requiring health care providers to disclose when they use generative AI to communicate with patients would potentially become unenforceable. New York's 2021 law mandating bias audits for AI tools used in hiring decisions would also be affected, 404 Media notes. The measure would also halt legislation set to take effect in 2026 in California that requires AI developers to publicly document the data used to train their models.\nThe ban could also restrict how states allocate federal funding for AI programs. States currently control how they use federal dollars and can direct funding toward AI initiatives that may conflict with the administration's technology priorities. The Education Department's AI programs represent one example where states might pursue different approaches than those favored by the White House and its tech industry allies.Read full article\nComments"
      },
      {
        "title": "Welcome to the age of paranoia as deepfakes and scams abound",
        "url": "https://arstechnica.com/ai/2025/05/welcome-to-the-age-of-paranoia-as-deepfakes-and-scams-abound/",
        "source": "Ars Technica",
        "category": "technology",
        "published": "Tue, 13 May 2025 13:23:23 +0000",
        "published_datetime": "2025-05-13T14:23:23",
        "summary": "These days, when Nicole Yelland receives a meeting request from someone she doesn’t already know, she conducts a multistep background check before deciding whether to accept. Yelland, who works in public relations for a Detroit-based nonprofit, says she’ll run the person’s information through Spokeo, a personal data aggregator that she pays a monthly subscription fee to use. If the contact claims to speak Spanish, Yelland says, she will casually test their ability to understand and translate trickier phrases. If something doesn’t quite seem right, she’ll ask the person to join a Microsoft Teams call—with their camera on.\nIf Yelland sounds paranoid, that’s because she is. In January, before she started her current nonprofit role, Yelland says, she got roped into an elaborate scam targeting job seekers. “Now, I do the whole verification rigamarole any time someone reaches out to me,” she tells WIRED.\nDigital imposter scams aren’t new; messaging platforms, social media sites, and dating apps have long been rife with fakery. In a time when remote work and distributed teams have become commonplace, professional communications channels are no longer safe, either. The same artificial intelligence tools that tech companies promise will boost worker productivity are also making it easier for criminals and fraudsters to construct fake personas in seconds.Read full article\nComments",
        "content": "These days, when Nicole Yelland receives a meeting request from someone she doesn’t already know, she conducts a multistep background check before deciding whether to accept. Yelland, who works in public relations for a Detroit-based nonprofit, says she’ll run the person’s information through Spokeo, a personal data aggregator that she pays a monthly subscription fee to use. If the contact claims to speak Spanish, Yelland says, she will casually test their ability to understand and translate trickier phrases. If something doesn’t quite seem right, she’ll ask the person to join a Microsoft Teams call—with their camera on.\nIf Yelland sounds paranoid, that’s because she is. In January, before she started her current nonprofit role, Yelland says, she got roped into an elaborate scam targeting job seekers. “Now, I do the whole verification rigamarole any time someone reaches out to me,” she tells WIRED.\nDigital imposter scams aren’t new; messaging platforms, social media sites, and dating apps have long been rife with fakery. In a time when remote work and distributed teams have become commonplace, professional communications channels are no longer safe, either. The same artificial intelligence tools that tech companies promise will boost worker productivity are also making it easier for criminals and fraudsters to construct fake personas in seconds.Read full article\nComments"
      },
      {
        "title": "Guardian agents: New approach could reduce AI hallucinations to below 1%",
        "url": "https://venturebeat.com/ai/beyond-detection-why-automatically-correcting-hallucinations-could-transform-enterprise-ai-adoption/",
        "source": "VentureBeat",
        "category": "technology",
        "published": "Tue, 13 May 2025 13:00:00 +0000",
        "published_datetime": "2025-05-13T14:00:00",
        "summary": "There are lots of ways to detect AI hallucination, new guardian agent model promises to correct them.Read More",
        "content": "There are lots of ways to detect AI hallucination, new guardian agent model promises to correct them.Read More"
      },
      {
        "title": "The Download: CRISPR in court, and the police’s ban-skirting AI",
        "url": "https://www.technologyreview.com/2025/05/13/1116357/the-download-crispr-in-court-and-the-polices-ban-skirting-ai/",
        "source": "MIT Technology Review",
        "category": "technology",
        "published": "Tue, 13 May 2025 12:10:00 +0000",
        "published_datetime": "2025-05-13T13:10:00",
        "summary": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nA US court just put ownership of CRISPR back in play\nThe CRISPR patents are back in play.\nYesterday, the US Court of Appeals for the Federal Circuit said scientists Jennifer Doudna and Emmanuelle Charpentier will get another chance to show they ought to own the key patents on what many consider the defining biotechnology invention of the 21st century.\nThe pair shared a 2020 Nobel Prize for developing the gene-editing system, which is already being used to treat various disorders.But when US patent rights were granted in 2014 to Feng Zhang of the Broad Institute of MIT and Harvard, the decision set off a bitter dispute in which hundreds of millions of dollars—as well as scientific bragging rights—are at stake. Read the full story.\n—Antonio Regalado\nTo read more about CRISPR, why not take a look at:+ Charpentier and Doudna announced they wanted to cancel their own CRISPR patents in Europe last year. Read the full story.+ How CRISPR will help the world cope with climate change. Read the full story.\n+ The US has approved CRISPR pigs for food. Pigs whose DNA makes them resistant to a virus could be the first big consumer product using gene editing. Read the full story.+ CRISPR will get easier and easier to administer. What does that mean for the future of our species?\n\nPolice tech can sidestep facial recognition bans now\n—James O’Donnell\nSix months ago I attended the largest gathering of chiefs of police in the US to see how they’re using AI. I found some big developments, like officers getting AI to write their reports. Now, I’ve published a new story that shows just how far AI for police has developed since then.It’s about a new method police are using to track people: an AI tool that uses attributes like body size, gender, hair color and style, clothing, and accessories instead of faces. It offers a way around laws curbing the use of facial recognition, which are on the rise.\nHere’s what this tells us about the development of police tech and what rules, if any, these departments are subject to in the age of AI. Read the full story.\nThis story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first, sign up here.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 Two Trump officials were denied access to the US Copyright Office Their visit came days after the administration fired the office’s head. (Wired $)+ Shira Perlmutter oversaw a report raising concerns about training AI with copyrighted materials. (WP $)\n2 Google knew it couldn’t monitor how Israel might use its cloud technologyBut it went ahead with Project Nimbus anyway. (The Intercept)\n3 Spain still doesn’t know what caused its massive power blackoutInvestigators are examining generators’ cyber defences for weaknesses. (FT $)+ Could solar power be to blame? (MIT Technology Review)\n4 Apple is considering hiking the price of iPhonesThe company doesn’t want to blame tariffs, though. (WSJ $)+ Apple boss Tim Cook had a call with Trump following the tariff rollback news. (CNBC)+ It’s reportedly developing an AI tool to extend phones’ battery life. (Bloomberg $)\n5 Venture capitalists aren’t 100% sure what an AI agent isThat isn’t stopping companies from sinking millions into them. (TechCrunch)+ Google is working on its own agent ahead of its I/O conference. (The Information $)+ What AI assistants can—and can’t—do. (Vox)+ Check out our AI agent explainer. (MIT Technology Review)\n6 Scammers are stealing the identities of death row inmatesAnd prisoners are unlikely to see correspondence alerting them to the fraud. (NBC News)\n7 Weight-loss drugs aren’t always enoughYou need long-term changes in health, not just weight. (The Atlantic $)+ How is Trump planning to lower drug costs, exactly? (NY Mag $)+ Drugs like Ozempic now make up 5% of prescriptions in the US. (MIT Technology Review)\n8 China’s e-commerce giants are racing to deliver goods within an hourAs competition has intensified, companies are fighting to be the quickest. (Reuters)\n9 This spacecraft will police satellites’ orbits And hunt them down where necessary. (IEEE Spectrum)+ The world’s biggest space-based radar will measure Earth’s forests from orbit. (MIT Technology Review)\n10 Is your beard trimmer broken? Simply 3D-print a new part.Philips is experimenting with letting its customers create their own replacements. (The Verge)\n\nQuote of the day\n“We usually set it up so that our team doesn’t get to creep in.”\n—Angie Saltman, founder and president of tech company Saltmedia, explains how her company helps store Indigenous data securely away from the Trump administration, the Verge reports.\n\nOne more thing\n\nMeet the radio-obsessed civilian shaping Ukraine’s drone defenseDrones have come to define the brutal conflict in Ukraine that has now dragged on for more than three years. And most rely on radio communications—a technology that Serhii “Flash” Beskrestnov has obsessed over since childhood.While Flash is now a civilian, the former officer has still taken it upon himself to inform his country’s defense in all matters related to radio. Once a month, he studies the skies for Russian radio transmissions and tries to learn about the problems facing troops in the fields and in the trenches.In this race for survival—as each side constantly tries to best the other, only to start all over again when the other inevitably catches up—Ukrainian soldiers need to develop creative solutions, and fast. As Ukraine’s wartime radio guru, Flash may just be one of their best hopes for doing that. Read the full story.\n—Charlie Metcalfe\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)\n+ Tune in at any time to the Coral City Camera, an underwater camera streaming live from an urban coral reef in Miami + Inhuman Resources, which mixes gaming, reading, and listening, sounds nuts.+ This compilation of 331 film clips to recreate Eminem’s Lose Yourself is spectacular.+ Questions I never thought I’d ask: what if Bigfoot were British?",
        "content": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\nA US court just put ownership of CRISPR back in play\nThe CRISPR patents are back in play.\nYesterday, the US Court of Appeals for the Federal Circuit said scientists Jennifer Doudna and Emmanuelle Charpentier will get another chance to show they ought to own the key patents on what many consider the defining biotechnology invention of the 21st century.\nThe pair shared a 2020 Nobel Prize for developing the gene-editing system, which is already being used to treat various disorders.But when US patent rights were granted in 2014 to Feng Zhang of the Broad Institute of MIT and Harvard, the decision set off a bitter dispute in which hundreds of millions of dollars—as well as scientific bragging rights—are at stake. Read the full story.\n—Antonio Regalado\nTo read more about CRISPR, why not take a look at:+ Charpentier and Doudna announced they wanted to cancel their own CRISPR patents in Europe last year. Read the full story.+ How CRISPR will help the world cope with climate change. Read the full story.\n+ The US has approved CRISPR pigs for food. Pigs whose DNA makes them resistant to a virus could be the first big consumer product using gene editing. Read the full story.+ CRISPR will get easier and easier to administer. What does that mean for the future of our species?\n\nPolice tech can sidestep facial recognition bans now\n—James O’Donnell\nSix months ago I attended the largest gathering of chiefs of police in the US to see how they’re using AI. I found some big developments, like officers getting AI to write their reports. Now, I’ve published a new story that shows just how far AI for police has developed since then.It’s about a new method police are using to track people: an AI tool that uses attributes like body size, gender, hair color and style, clothing, and accessories instead of faces. It offers a way around laws curbing the use of facial recognition, which are on the rise.\nHere’s what this tells us about the development of police tech and what rules, if any, these departments are subject to in the age of AI. Read the full story.\nThis story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first, sign up here.\n\nThe must-reads\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n1 Two Trump officials were denied access to the US Copyright Office Their visit came days after the administration fired the office’s head. (Wired $)+ Shira Perlmutter oversaw a report raising concerns about training AI with copyrighted materials. (WP $)\n2 Google knew it couldn’t monitor how Israel might use its cloud technologyBut it went ahead with Project Nimbus anyway. (The Intercept)\n3 Spain still doesn’t know what caused its massive power blackoutInvestigators are examining generators’ cyber defences for weaknesses. (FT $)+ Could solar power be to blame? (MIT Technology Review)\n4 Apple is considering hiking the price of iPhonesThe company doesn’t want to blame tariffs, though. (WSJ $)+ Apple boss Tim Cook had a call with Trump following the tariff rollback news. (CNBC)+ It’s reportedly developing an AI tool to extend phones’ battery life. (Bloomberg $)\n5 Venture capitalists aren’t 100% sure what an AI agent isThat isn’t stopping companies from sinking millions into them. (TechCrunch)+ Google is working on its own agent ahead of its I/O conference. (The Information $)+ What AI assistants can—and can’t—do. (Vox)+ Check out our AI agent explainer. (MIT Technology Review)\n6 Scammers are stealing the identities of death row inmatesAnd prisoners are unlikely to see correspondence alerting them to the fraud. (NBC News)\n7 Weight-loss drugs aren’t always enoughYou need long-term changes in health, not just weight. (The Atlantic $)+ How is Trump planning to lower drug costs, exactly? (NY Mag $)+ Drugs like Ozempic now make up 5% of prescriptions in the US. (MIT Technology Review)\n8 China’s e-commerce giants are racing to deliver goods within an hourAs competition has intensified, companies are fighting to be the quickest. (Reuters)\n9 This spacecraft will police satellites’ orbits And hunt them down where necessary. (IEEE Spectrum)+ The world’s biggest space-based radar will measure Earth’s forests from orbit. (MIT Technology Review)\n10 Is your beard trimmer broken? Simply 3D-print a new part.Philips is experimenting with letting its customers create their own replacements. (The Verge)\n\nQuote of the day\n“We usually set it up so that our team doesn’t get to creep in.”\n—Angie Saltman, founder and president of tech company Saltmedia, explains how her company helps store Indigenous data securely away from the Trump administration, the Verge reports.\n\nOne more thing\n\nMeet the radio-obsessed civilian shaping Ukraine’s drone defenseDrones have come to define the brutal conflict in Ukraine that has now dragged on for more than three years. And most rely on radio communications—a technology that Serhii “Flash” Beskrestnov has obsessed over since childhood.While Flash is now a civilian, the former officer has still taken it upon himself to inform his country’s defense in all matters related to radio. Once a month, he studies the skies for Russian radio transmissions and tries to learn about the problems facing troops in the fields and in the trenches.In this race for survival—as each side constantly tries to best the other, only to start all over again when the other inevitably catches up—Ukrainian soldiers need to develop creative solutions, and fast. As Ukraine’s wartime radio guru, Flash may just be one of their best hopes for doing that. Read the full story.\n—Charlie Metcalfe\n\nWe can still have nice things\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.)\n+ Tune in at any time to the Coral City Camera, an underwater camera streaming live from an urban coral reef in Miami + Inhuman Resources, which mixes gaming, reading, and listening, sounds nuts.+ This compilation of 331 film clips to recreate Eminem’s Lose Yourself is spectacular.+ Questions I never thought I’d ask: what if Bigfoot were British?"
      },
      {
        "title": "Police tech can sidestep facial recognition bans now",
        "url": "https://www.technologyreview.com/2025/05/13/1116321/police-tech-can-sidestep-facial-recognition-bans-now/",
        "source": "MIT Technology Review",
        "category": "technology",
        "published": "Tue, 13 May 2025 09:00:00 +0000",
        "published_datetime": "2025-05-13T10:00:00",
        "summary": "Six months ago I attended the largest gathering of chiefs of police in the US to see how they’re using AI. I found some big developments, like officers getting AI to write their police reports. Today, I published a new story that shows just how far AI for police has developed since then. \nIt’s about a new method police departments and federal agencies have found to track people: an AI tool that uses attributes like body size, gender, hair color and style, clothing, and accessories instead of faces. It offers a way around laws curbing the use of facial recognition, which are on the rise. \nAdvocates from the ACLU, after learning of the tool through MIT Technology Review, said it was the first instance they’d seen of such a tracking system used at scale in the US, and they say it has a high potential for abuse by federal agencies. They say the prospect that AI will enable more powerful surveillance is especially alarming at a time when the Trump administration is pushing for more monitoring of protesters, immigrants, and students. \nI hope you read the full story for the details, and to watch a demo video of how the system works. But first, let’s talk for a moment about what this tells us about the development of police tech and what rules, if any, these departments are subject to in the age of AI.\nAs I pointed out in my story six months ago, police departments in the US have extraordinary independence. There are more than 18,000 departments in the country, and they generally have lots of discretion over what technology they spend their budgets on. In recent years, that technology has increasingly become AI-centric. \nCompanies like Flock and Axon sell suites of sensors—cameras, license plate readers, gunshot detectors, drones—and then offer AI tools to make sense of that ocean of data (at last year’s conference I saw schmoozing between countless AI-for-police startups and the chiefs they sell to on the expo floor). Departments say these technologies save time, ease officer shortages, and help cut down on response times. \nThose sound like fine goals, but this pace of adoption raises an obvious question: Who makes the rules here? When does the use of AI cross over from efficiency into surveillance, and what type of transparency is owed to the public?\nIn some cases, AI-powered police tech is already driving a wedge between departments and the communities they serve. When the police in Chula Vista, California, were the first in the country to get special waivers from the Federal Aviation Administration to fly their drones farther than normal, they said the drones would be deployed to solve crimes and get people help sooner in emergencies. They’ve had some successes. \nBut the department has also been sued by a local media outlet alleging it has reneged on its promise to make drone footage public, and residents have said the drones buzzing overhead feel like an invasion of privacy. An investigation found that these drones were deployed more often in poor neighborhoods, and for minor issues like loud music. \nJay Stanley, a senior policy analyst at the ACLU, says there’s no overarching federal law that governs how local police departments adopt technologies like the tracking software I wrote about. Departments usually have the leeway to try it first, and see how their communities react after the fact. (Veritone, which makes the tool I wrote about, said they couldn’t name or connect me with departments using it so the details of how it’s being deployed by police are not yet clear). \nSometimes communities take a firm stand; local laws against police use of facial recognition have been passed around the country. But departments—or the police tech companies they buy from—can find workarounds. Stanley says the new tracking software I wrote about poses lots of the same issues as facial recognition while escaping scrutiny because it doesn’t technically use biometric data.\n“The community should be very skeptical of this kind of tech and, at a minimum, ask a lot of questions,” he says. He laid out a road map of what police departments should do before they adopt AI technologies: have hearings with the public, get community permission, and make promises about how the systems will and will not be used. He added that the companies making this tech should also allow it to be tested by independent parties. \n“This is all coming down the pike,” he says—and so quickly that policymakers and the public have little time to keep up. He adds, “Are these powers we want the police—the authorities that serve us—to have, and if so, under what conditions?”\nThis story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first, sign up here.",
        "content": "Six months ago I attended the largest gathering of chiefs of police in the US to see how they’re using AI. I found some big developments, like officers getting AI to write their police reports. Today, I published a new story that shows just how far AI for police has developed since then. \nIt’s about a new method police departments and federal agencies have found to track people: an AI tool that uses attributes like body size, gender, hair color and style, clothing, and accessories instead of faces. It offers a way around laws curbing the use of facial recognition, which are on the rise. \nAdvocates from the ACLU, after learning of the tool through MIT Technology Review, said it was the first instance they’d seen of such a tracking system used at scale in the US, and they say it has a high potential for abuse by federal agencies. They say the prospect that AI will enable more powerful surveillance is especially alarming at a time when the Trump administration is pushing for more monitoring of protesters, immigrants, and students. \nI hope you read the full story for the details, and to watch a demo video of how the system works. But first, let’s talk for a moment about what this tells us about the development of police tech and what rules, if any, these departments are subject to in the age of AI.\nAs I pointed out in my story six months ago, police departments in the US have extraordinary independence. There are more than 18,000 departments in the country, and they generally have lots of discretion over what technology they spend their budgets on. In recent years, that technology has increasingly become AI-centric. \nCompanies like Flock and Axon sell suites of sensors—cameras, license plate readers, gunshot detectors, drones—and then offer AI tools to make sense of that ocean of data (at last year’s conference I saw schmoozing between countless AI-for-police startups and the chiefs they sell to on the expo floor). Departments say these technologies save time, ease officer shortages, and help cut down on response times. \nThose sound like fine goals, but this pace of adoption raises an obvious question: Who makes the rules here? When does the use of AI cross over from efficiency into surveillance, and what type of transparency is owed to the public?\nIn some cases, AI-powered police tech is already driving a wedge between departments and the communities they serve. When the police in Chula Vista, California, were the first in the country to get special waivers from the Federal Aviation Administration to fly their drones farther than normal, they said the drones would be deployed to solve crimes and get people help sooner in emergencies. They’ve had some successes. \nBut the department has also been sued by a local media outlet alleging it has reneged on its promise to make drone footage public, and residents have said the drones buzzing overhead feel like an invasion of privacy. An investigation found that these drones were deployed more often in poor neighborhoods, and for minor issues like loud music. \nJay Stanley, a senior policy analyst at the ACLU, says there’s no overarching federal law that governs how local police departments adopt technologies like the tracking software I wrote about. Departments usually have the leeway to try it first, and see how their communities react after the fact. (Veritone, which makes the tool I wrote about, said they couldn’t name or connect me with departments using it so the details of how it’s being deployed by police are not yet clear). \nSometimes communities take a firm stand; local laws against police use of facial recognition have been passed around the country. But departments—or the police tech companies they buy from—can find workarounds. Stanley says the new tracking software I wrote about poses lots of the same issues as facial recognition while escaping scrutiny because it doesn’t technically use biometric data.\n“The community should be very skeptical of this kind of tech and, at a minimum, ask a lot of questions,” he says. He laid out a road map of what police departments should do before they adopt AI technologies: have hearings with the public, get community permission, and make promises about how the systems will and will not be used. He added that the companies making this tech should also allow it to be tested by independent parties. \n“This is all coming down the pike,” he says—and so quickly that policymakers and the public have little time to keep up. He adds, “Are these powers we want the police—the authorities that serve us—to have, and if so, under what conditions?”\nThis story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first, sign up here."
      },
      {
        "title": "Sakana introduces new AI architecture, ‘Continuous Thought Machines’ to make models reason with less guidance — like human brains",
        "url": "https://venturebeat.com/ai/sakana-introduces-new-ai-architecture-continuous-thought-machines-to-make-models-reason-with-less-guidance-like-human-brains/",
        "source": "VentureBeat",
        "category": "technology",
        "published": "Mon, 12 May 2025 23:08:55 +0000",
        "published_datetime": "2025-05-13T00:08:55",
        "summary": "While the CTM shows strong promise, it is still primarily a research architecture and is not yet production-ready out of the box.Read More",
        "content": "While the CTM shows strong promise, it is still primarily a research architecture and is not yet production-ready out of the box.Read More"
      }
    ],
    "article_count": 11,
    "dominant_terms": [
      "ai",
      "tiktok",
      "new",
      "police",
      "guardian",
      "apple",
      "like",
      "video",
      "states",
      "story",
      "companies",
      "tech",
      "technology",
      "creative",
      "tool",
      "use",
      "says",
      "models",
      "make",
      "read"
    ],
    "sentiment": {
      "compound": 0.42665454545454545,
      "positive": 0.09754545454545455,
      "negative": 0.039,
      "neutral": 0.8635454545454546,
      "overall": "positive"
    },
    "relevance_score": 0.8129183546214751,
    "suggested_title": "Apple TV&#8217;s wireless audio sync now works with Dolby Atmos",
    "keywords": [
      "ai",
      "tiktok",
      "new",
      "police",
      "guardian",
      "apple",
      "like",
      "video",
      "states",
      "story",
      "TV",
      "Dolby",
      "Atmos",
      "Paul",
      "McCartney"
    ],
    "summary": "Now, I’ve published a new story that shows just how far AI for police has developed since then.It’s about a new method police are using to track people: an AI tool that uses attributes like body size, gender, hair color and style, clothing, and accessories instead of faces. Companies like Flock and Axon sell suites of sensors—cameras, license plate readers, gunshot detectors, drones—and then offer AI tools to make sense of that ocean of data (at last year’s conference I saw schmoozing between countless AI-for-police startups and the chiefs they sell to on the expo floor)."
  },
  {
    "id": 7,
    "articles": [
      {
        "title": "A VPN Company Canceled All Lifetime Subscriptions, Claiming It Didn’t Know About Them",
        "url": "https://www.wired.com/story/vpnsecure-canceled-all-lifetime-subscriptions-claiming-it-didnt-know-about-them/",
        "source": "Wired",
        "category": "technology",
        "published": "Tue, 13 May 2025 22:00:00 +0000",
        "published_datetime": "2025-05-13T23:00:00",
        "summary": "VPNSecure’s lifetime plan didn’t survive after new ownership took over. Now customers are hopping mad.",
        "content": "VPNSecure’s lifetime plan didn’t survive after new ownership took over. Now customers are hopping mad."
      },
      {
        "title": "The wireless GameCube controller for Switch 2 is available to preorder now",
        "url": "https://www.theverge.com/tech/666302/gamecube-switch-2-nintendo-preorder-buy",
        "source": "The Verge",
        "category": "technology",
        "published": "2025-05-13T17:16:44-04:00",
        "published_datetime": "2025-05-13T22:16:44",
        "summary": "\n\n\n\nThe wireless GameCube controller that’s for use exclusively with the Nintendo Switch 2 can now be pre-ordered by those who have a Switch Online account. The controller costs $64.99, and is currently limited to one per account. That limitation has allowed it to remain in stock for a few hours already today. For those who’ve bought one, you’ll get it on Switch 2’s launch date, which is June 5th.\nDemand is high, so it’s likely that you’ll need to hang out in a waiting room for 30 minutes or so before you’re let in to buy one. So, don’t navigate away.\nWhile GameCube controller support on the original Switch is nothing new (made possible thanks to the GameCube controller plug-to-USB adapter, or with newer third-party USB versions based on the original controller’s design), game support for the new wireless version is quite a bit more limited. It won’t be compatible with Switch backwards compatible titles that work on the Switch 2, including Super Smash Bros. Ultimate, or at least support hasn’t been confirmed yet. Instead, its use is limited to the GameCube games that are coming to Switch Online’s Expansion Pack tier, which at launch will include The Legend of Zelda: The Wind Waker, Soulcalibur 2, and more. \nThis GameCube controller has USB-C charging, and comes with the C button that’s used to summon GameChat features. Just a reminder: GameChat will be free to use for all Nintendo Switch 2 owners through March 31st, 2026.",
        "content": "\n\n\n\nThe wireless GameCube controller that’s for use exclusively with the Nintendo Switch 2 can now be pre-ordered by those who have a Switch Online account. The controller costs $64.99, and is currently limited to one per account. That limitation has allowed it to remain in stock for a few hours already today. For those who’ve bought one, you’ll get it on Switch 2’s launch date, which is June 5th.\nDemand is high, so it’s likely that you’ll need to hang out in a waiting room for 30 minutes or so before you’re let in to buy one. So, don’t navigate away.\nWhile GameCube controller support on the original Switch is nothing new (made possible thanks to the GameCube controller plug-to-USB adapter, or with newer third-party USB versions based on the original controller’s design), game support for the new wireless version is quite a bit more limited. It won’t be compatible with Switch backwards compatible titles that work on the Switch 2, including Super Smash Bros. Ultimate, or at least support hasn’t been confirmed yet. Instead, its use is limited to the GameCube games that are coming to Switch Online’s Expansion Pack tier, which at launch will include The Legend of Zelda: The Wind Waker, Soulcalibur 2, and more. \nThis GameCube controller has USB-C charging, and comes with the C button that’s used to summon GameChat features. Just a reminder: GameChat will be free to use for all Nintendo Switch 2 owners through March 31st, 2026."
      },
      {
        "title": "NFT phenom CryptoPunks was just sold to a nonprofit",
        "url": "https://techcrunch.com/2025/05/13/nft-phenom-cryptopunks-was-just-sold-to-a-nonprofit/",
        "source": "TechCrunch",
        "category": "technology",
        "published": "Tue, 13 May 2025 21:00:00 +0000",
        "published_datetime": "2025-05-13T22:00:00",
        "summary": "Yuga Labs, known as the creator of Bored Ape Yacht Club and other notable NFTs, sold its iconic CryptoPunks to the nonprofit NODE Foundation, which focuses on preserving digital art. The deal details are undisclosed, and a representative declined to comment. Back in April, NODE announced it received a $25 million grant to “build the […]",
        "content": "Yuga Labs, known as the creator of Bored Ape Yacht Club and other notable NFTs, sold its iconic CryptoPunks to the nonprofit NODE Foundation, which focuses on preserving digital art. The deal details are undisclosed, and a representative declined to comment. Back in April, NODE announced it received a $25 million grant to “build the […]"
      },
      {
        "title": "Marvel’s WWII action game has been delayed",
        "url": "https://www.theverge.com/games/666270/marvel-1943-rise-of-hydra-delayed-2026",
        "source": "The Verge",
        "category": "technology",
        "published": "2025-05-13T16:01:04-04:00",
        "published_datetime": "2025-05-13T21:01:04",
        "summary": "\n\n\n\nMarvel 1943: Rise of Hydra, the new Marvel action-adventure game, has been delayed. The game was originally slated to release this year but Skydance New Media, the studio developing the game, has announced it will instead come out some time in early 2026. \n“Taking this additional time will allow us to add more polish,” Skydance wrote of the delay on their X account. \nMarvel 1943 was first teaseed in 2021 as the first project under Skydance New Media, a new gaming initiative spearheaded by parent company studio Skydance Media known for films like Mission: Impossible – Dead Reckoning. Skydance appointed former Naughty Dog creative director and Uncharted writer Amy Hennig to lead the studio. It’s billed as an action-adventure game taking place in World War II featuring multiple playable characters including Captain America, Black Panther (T’Challa’s grandfather Azzuri), Gabriel Jones (a member of Captain America’s Howling Commandos team,) and Nanali, a Wakandan spy. We have one brief trailer from the game, released during last year’s state of Unreal address but no other details. Skydance New Media is also working on a Star Wars game.\n",
        "content": "\n\n\n\nMarvel 1943: Rise of Hydra, the new Marvel action-adventure game, has been delayed. The game was originally slated to release this year but Skydance New Media, the studio developing the game, has announced it will instead come out some time in early 2026. \n“Taking this additional time will allow us to add more polish,” Skydance wrote of the delay on their X account. \nMarvel 1943 was first teaseed in 2021 as the first project under Skydance New Media, a new gaming initiative spearheaded by parent company studio Skydance Media known for films like Mission: Impossible – Dead Reckoning. Skydance appointed former Naughty Dog creative director and Uncharted writer Amy Hennig to lead the studio. It’s billed as an action-adventure game taking place in World War II featuring multiple playable characters including Captain America, Black Panther (T’Challa’s grandfather Azzuri), Gabriel Jones (a member of Captain America’s Howling Commandos team,) and Nanali, a Wakandan spy. We have one brief trailer from the game, released during last year’s state of Unreal address but no other details. Skydance New Media is also working on a Star Wars game.\n"
      },
      {
        "title": "YouTube will stream an opening week NFL game for free",
        "url": "https://www.theverge.com/news/666236/youtube-nfl-week-1-free-game-stream-brazil-chargers",
        "source": "The Verge",
        "category": "technology",
        "published": "2025-05-13T15:30:07-04:00",
        "published_datetime": "2025-05-13T20:30:07",
        "summary": "\n\n\n\nYouTube is exclusively streaming an NFL week 1 game for free worldwide to kick off the 2025 season. The game will take place in Sao Paulo, Brazil, on Friday, September 5th, and will feature the Los Angeles Chargers taking on a yet-to-be-named opponent.\nAs with other streaming NFL games, it will also be available to viewers in the teams’ home markets via over-the-air broadcast, on NFL Plus for mobile devices inside the US, and the NFL Game Pass package from DAZN outside the US. \nYouTube TV has streamed the NFL Sunday Ticket package since 2023, but this is its first time broadcasting a game. It’s joining the likes of Netflix, with Christmas Day broadcasts last year that tallied nearly 65 million US viewers, and Peacock.\nYouTube’s chief business officer, Mary Ellen Coe, says this will be the company’s first time operating as a live NFL broadcaster, and it will feature creators and “an interactive viewing experience. Coe adds that people have watched “over 350 million hours” of NFL content on YouTube.\nIn addition to the week 1 game, YouTube also announced a multi-year deal with the NFL to continue streaming the Super Bowl Flag Football game.",
        "content": "\n\n\n\nYouTube is exclusively streaming an NFL week 1 game for free worldwide to kick off the 2025 season. The game will take place in Sao Paulo, Brazil, on Friday, September 5th, and will feature the Los Angeles Chargers taking on a yet-to-be-named opponent.\nAs with other streaming NFL games, it will also be available to viewers in the teams’ home markets via over-the-air broadcast, on NFL Plus for mobile devices inside the US, and the NFL Game Pass package from DAZN outside the US. \nYouTube TV has streamed the NFL Sunday Ticket package since 2023, but this is its first time broadcasting a game. It’s joining the likes of Netflix, with Christmas Day broadcasts last year that tallied nearly 65 million US viewers, and Peacock.\nYouTube’s chief business officer, Mary Ellen Coe, says this will be the company’s first time operating as a live NFL broadcaster, and it will feature creators and “an interactive viewing experience. Coe adds that people have watched “over 350 million hours” of NFL content on YouTube.\nIn addition to the week 1 game, YouTube also announced a multi-year deal with the NFL to continue streaming the Super Bowl Flag Football game."
      },
      {
        "title": "Doom: The Dark Ages is surprisingly playable on the Steam Deck",
        "url": "https://arstechnica.com/gaming/2025/05/doom-the-dark-ages-is-surprisingly-playable-on-the-steam-deck/",
        "source": "Ars Technica",
        "category": "technology",
        "published": "Tue, 13 May 2025 19:16:20 +0000",
        "published_datetime": "2025-05-13T20:16:20",
        "summary": "While working on our review of Doom: The Dark Ages last week, I was unable to test the game on the Steam Deck due to a bug that prevented it from launching on SteamOS. I didn't consider this much of a loss at the time, since I figured the Deck's 3-year-old portable hardware was rated way below the minimum PC specs for the game, which call for ray tracing-capable graphics cards at a minimum.\nOver the weekend, though, Valve released a preview build of a new version of SteamOS that allows Doom: The Dark Ages to actually launch on the Steam Deck. And after a bit of testing, I found the game is surprisingly playable on Valve's portable hardware, provided you're prepared to turn down the graphics settings.\nWith all the graphical quality sliders set to \"Low\" (and FSR upscaling set to \"Performance\"), I was able to run Doom: The Dark Ages at the system's native 1280×800 resolution and a reasonably steady 30 to 40 fps.Read full article\nComments",
        "content": "While working on our review of Doom: The Dark Ages last week, I was unable to test the game on the Steam Deck due to a bug that prevented it from launching on SteamOS. I didn't consider this much of a loss at the time, since I figured the Deck's 3-year-old portable hardware was rated way below the minimum PC specs for the game, which call for ray tracing-capable graphics cards at a minimum.\nOver the weekend, though, Valve released a preview build of a new version of SteamOS that allows Doom: The Dark Ages to actually launch on the Steam Deck. And after a bit of testing, I found the game is surprisingly playable on Valve's portable hardware, provided you're prepared to turn down the graphics settings.\nWith all the graphical quality sliders set to \"Low\" (and FSR upscaling set to \"Performance\"), I was able to run Doom: The Dark Ages at the system's native 1280×800 resolution and a reasonably steady 30 to 40 fps.Read full article\nComments"
      },
      {
        "title": "Shuhei Yoshida looks back on his long career at PlayStation while at Gamescom Latam 2025",
        "url": "https://venturebeat.com/game-development/shuhei-yoshida-looks-back-on-his-long-career-at-playstation-while-at-gamescom-latam-2025/",
        "source": "VentureBeat",
        "category": "technology",
        "published": "Tue, 13 May 2025 14:30:00 +0000",
        "published_datetime": "2025-05-13T15:30:00",
        "summary": "Shu Yoshida has graduated from Sony, but he is not retired. Rather, he is running a new indie games consulting company dubbed YOSP Inc. Yoshida’s appetite to do more in gaming shows just how much he loves indie game developers. He won a Lifetime Achievement Awards at Gamescom Latam 2025, where I did a fireside chat with him in front of a big…Read More",
        "content": "Shu Yoshida has graduated from Sony, but he is not retired. Rather, he is running a new indie games consulting company dubbed YOSP Inc. Yoshida’s appetite to do more in gaming shows just how much he loves indie game developers. He won a Lifetime Achievement Awards at Gamescom Latam 2025, where I did a fireside chat with him in front of a big…Read More"
      },
      {
        "title": "Ana de Armas is caught in Wick’s crosshairs in final Ballerina trailer",
        "url": "https://arstechnica.com/culture/2025/05/ana-de-armas-is-caught-in-wicks-crosshairs-in-final-ballerina-trailer/",
        "source": "Ars Technica",
        "category": "technology",
        "published": "Tue, 13 May 2025 14:08:51 +0000",
        "published_datetime": "2025-05-13T15:08:51",
        "summary": "\n\n\n      One last trailer for From the World of John Wick: Ballerina.\n\n          \n\n\nWe're about three weeks out from the theatrical release of From the World of John Wick: Ballerina, starring Ana de Armas. So naturally Lionsgate has released one final trailer to whet audience appetites for what promises to be a fiery, action-packed addition to the hugely successful franchise.\n(Some spoilers for 2019's John Wick Chapter 3: Parabellum.)\nChronologically, Ballerina takes place during the events of John Wick Chapter 3: Parabellum. As previously reported, Parabellum found Wick declared excommunicado from the High Table for killing crime lord Santino D'Antonio on the grounds of the Continental. On the run with a bounty on his head, he makes his way to the headquarters of the Ruska Roma crime syndicate, led by the Director (Anjelica Huston). The Director also trains young girls to be ballerina-assassins, and one young ballerina (played by Unity Phelan) is shown rehearsing in the scene. That dancer, Eve Macarro, is the main character in Ballerina, now played by de Armas.Read full article\nComments",
        "content": "\n\n\n      One last trailer for From the World of John Wick: Ballerina.\n\n          \n\n\nWe're about three weeks out from the theatrical release of From the World of John Wick: Ballerina, starring Ana de Armas. So naturally Lionsgate has released one final trailer to whet audience appetites for what promises to be a fiery, action-packed addition to the hugely successful franchise.\n(Some spoilers for 2019's John Wick Chapter 3: Parabellum.)\nChronologically, Ballerina takes place during the events of John Wick Chapter 3: Parabellum. As previously reported, Parabellum found Wick declared excommunicado from the High Table for killing crime lord Santino D'Antonio on the grounds of the Continental. On the run with a bounty on his head, he makes his way to the headquarters of the Ruska Roma crime syndicate, led by the Director (Anjelica Huston). The Director also trains young girls to be ballerina-assassins, and one young ballerina (played by Unity Phelan) is shown rehearsing in the scene. That dancer, Eve Macarro, is the main character in Ballerina, now played by de Armas.Read full article\nComments"
      },
      {
        "title": "Supercell’s Squad Busters transforms core gameplay with major update",
        "url": "https://venturebeat.com/games/supercells-squad-busters-transforms-core-gameplay-with-major-update/",
        "source": "VentureBeat",
        "category": "technology",
        "published": "Tue, 13 May 2025 11:00:00 +0000",
        "published_datetime": "2025-05-13T12:00:00",
        "summary": "Supercell announced its developers have launched a major update for Squad Busters that will change the game's core gameplay.Read More",
        "content": "Supercell announced its developers have launched a major update for Squad Busters that will change the game's core gameplay.Read More"
      },
      {
        "title": "VPN firm says it didn’t know customers had lifetime subscriptions, cancels them",
        "url": "https://arstechnica.com/gadgets/2025/05/vpn-firm-says-it-didnt-know-customers-had-lifetime-subscriptions-cancels-them/",
        "source": "Ars Technica",
        "category": "technology",
        "published": "Mon, 12 May 2025 21:38:02 +0000",
        "published_datetime": "2025-05-12T22:38:02",
        "summary": "The new owners of VPN provider VPNSecure have drawn ire after canceling lifetime subscriptions. The owners told customers that they didn’t know about the lifetime subscriptions when they bought VPNSecure, and they cannot honor the purchases.\nIn March, complaints started appearing online about lifetime subscriptions to VPNSecure no longer working.\nThe first public response Ars Technica found came on April 28, when lifetime subscription holders reported receiving an email from the VPN provider saying:Read full article\nComments",
        "content": "The new owners of VPN provider VPNSecure have drawn ire after canceling lifetime subscriptions. The owners told customers that they didn’t know about the lifetime subscriptions when they bought VPNSecure, and they cannot honor the purchases.\nIn March, complaints started appearing online about lifetime subscriptions to VPNSecure no longer working.\nThe first public response Ars Technica found came on April 28, when lifetime subscription holders reported receiving an email from the VPN provider saying:Read full article\nComments"
      }
    ],
    "article_count": 10,
    "dominant_terms": [
      "game",
      "lifetime",
      "didn",
      "subscriptions",
      "new",
      "vpn",
      "vpnsecure",
      "core",
      "youtube",
      "john",
      "developers",
      "trailer",
      "major",
      "dark",
      "announced",
      "update",
      "customers",
      "action",
      "games",
      "nonprofit"
    ],
    "sentiment": {
      "compound": -0.06071999999999998,
      "positive": 0.057300000000000004,
      "negative": 0.0536,
      "neutral": 0.8891,
      "overall": "negative"
    },
    "relevance_score": 0.7252360078935185,
    "suggested_title": "A VPN Company Canceled All Lifetime Subscriptions, Claiming It Didn’t Know About Them",
    "keywords": [
      "game",
      "lifetime",
      "didn",
      "subscriptions",
      "new",
      "vpn",
      "vpnsecure",
      "core",
      "youtube",
      "john",
      "Company",
      "Canceled",
      "Claiming",
      "Know",
      "GameCube"
    ],
    "summary": "Supercell announced its developers have launched a major update for Squad Busters that will change the game's core gameplay.Read More The owners told customers that they didn’t know about the lifetime subscriptions when they bought VPNSecure, and they cannot honor the purchases. VPNSecure’s lifetime plan didn’t survive after new ownership took over. VPN firm says it didn’t know customers had lifetime subscriptions, cancels them The new owners of VPN provider VPNSecure have drawn ire after canceling lifetime subscriptions."
  },
  {
    "id": 3,
    "articles": [
      {
        "title": "Notion bets big on integrated LLMs, adds GPT-4.1 and Claude 3.7 to platform",
        "url": "https://venturebeat.com/ai/notion-bets-big-on-integrated-llms-adds-gpt-4-1-and-claude-3-7-to-platform/",
        "source": "VentureBeat",
        "category": "technology",
        "published": "Tue, 13 May 2025 22:18:40 +0000",
        "published_datetime": "2025-05-13T23:18:40",
        "summary": "Notion used OpenAI's GPT-4.1 and Anthropic's Claude 3.7 for its new AI features for enterprises, moving away from reasoning models.Read More",
        "content": "Notion used OpenAI's GPT-4.1 and Anthropic's Claude 3.7 for its new AI features for enterprises, moving away from reasoning models.Read More"
      },
      {
        "title": "Anthropic, Google score win by nabbing OpenAI-backed Harvey as a user",
        "url": "https://techcrunch.com/2025/05/13/anthropic-google-score-win-by-nabbing-openai-backed-harvey-as-a-user/",
        "source": "TechCrunch",
        "category": "technology",
        "published": "Tue, 13 May 2025 20:30:42 +0000",
        "published_datetime": "2025-05-13T21:30:42",
        "summary": "Popular legal AI tool Harvey will now be using leading foundation models from Anthropic and Google, moving beyond strictly using OpenAI’s, Harvey announced in a blog post on Tuesday. This is noteworthy because Harvey is one of the OpenAI Startup Fund’s most successful early-backed portfolio companies. The OpenAI Startup Fund is an OpenAI-associated fund to […]",
        "content": "Popular legal AI tool Harvey will now be using leading foundation models from Anthropic and Google, moving beyond strictly using OpenAI’s, Harvey announced in a blog post on Tuesday. This is noteworthy because Harvey is one of the OpenAI Startup Fund’s most successful early-backed portfolio companies. The OpenAI Startup Fund is an OpenAI-associated fund to […]"
      },
      {
        "title": "AI power rankings upended: OpenAI, Google rise as Anthropic falls, Poe report finds",
        "url": "https://venturebeat.com/ai/ai-power-rankings-upended-openai-google-rise-as-anthropic-falls-poe-report-finds/",
        "source": "VentureBeat",
        "category": "technology",
        "published": "Tue, 13 May 2025 19:13:46 +0000",
        "published_datetime": "2025-05-13T20:13:46",
        "summary": "New Poe data reveals major shifts in AI market share as OpenAI and Google gain ground while specialized reasoning models surge to 10% of usage in 2025.Read More",
        "content": "New Poe data reveals major shifts in AI market share as OpenAI and Google gain ground while specialized reasoning models surge to 10% of usage in 2025.Read More"
      },
      {
        "title": "SimilarWeb’s new AI usage report reveals 5 surprising findings, including explosive growth in coding tools",
        "url": "https://venturebeat.com/ai/similarwebs-new-ai-usage-report-reveals-5-surprising-findings-including-explosive-growth-in-coding-tools/",
        "source": "VentureBeat",
        "category": "technology",
        "published": "Tue, 13 May 2025 17:22:27 +0000",
        "published_datetime": "2025-05-13T18:22:27",
        "summary": "The signs point to early-stage AI disruption beginning to erode the utility of some legacy platforms. It also offers a hint to enterprises...Read More",
        "content": "The signs point to early-stage AI disruption beginning to erode the utility of some legacy platforms. It also offers a hint to enterprises...Read More"
      },
      {
        "title": "The interoperability breakthrough: How MCP is becoming enterprise AI’s universal language",
        "url": "https://venturebeat.com/ai/the-interoperability-breakthrough-how-mcp-is-becoming-enterprise-ais-universal-language/",
        "source": "VentureBeat",
        "category": "technology",
        "published": "Tue, 13 May 2025 13:00:00 +0000",
        "published_datetime": "2025-05-13T14:00:00",
        "summary": "Just a few months after it's release, MCP adoption is growing. VentureBeat spoke to some enterprises asking why MCP is winning the standards race.Read More",
        "content": "Just a few months after it's release, MCP adoption is growing. VentureBeat spoke to some enterprises asking why MCP is winning the standards race.Read More"
      },
      {
        "title": "How to Use Apple Maps on the Web",
        "url": "https://www.wired.com/story/how-to-use-apple-maps-on-the-web/",
        "source": "Wired",
        "category": "technology",
        "published": "Tue, 13 May 2025 12:00:00 +0000",
        "published_datetime": "2025-05-13T13:00:00",
        "summary": "Apple’s mapping platform is no longer exclusively for Apple devices. A pared-down version runs in your browser; here’s how to use it.",
        "content": "Apple’s mapping platform is no longer exclusively for Apple devices. A pared-down version runs in your browser; here’s how to use it."
      },
      {
        "title": "Your Favorite Porn Stars Are Sick of Being Censored. But They’re Not Going Away",
        "url": "https://www.wired.com/story/pornhub-awards/",
        "source": "Wired",
        "category": "technology",
        "published": "Tue, 13 May 2025 11:00:00 +0000",
        "published_datetime": "2025-05-13T12:00:00",
        "summary": "We spent the Pornhub Awards with some of the site’s biggest stars to talk censorship, making money, and the popularity of trans porn—all while the site is blocked in more than a third of US states.",
        "content": "We spent the Pornhub Awards with some of the site’s biggest stars to talk censorship, making money, and the popularity of trans porn—all while the site is blocked in more than a third of US states."
      },
      {
        "title": "OpenAI just fixed ChatGPT’s most annoying business problem: meet the PDF export that changes everything",
        "url": "https://venturebeat.com/ai/openai-just-fixed-chatgpts-most-annoying-business-problem-meet-the-pdf-export-that-changes-everything/",
        "source": "VentureBeat",
        "category": "technology",
        "published": "Mon, 12 May 2025 20:43:51 +0000",
        "published_datetime": "2025-05-12T21:43:51",
        "summary": "OpenAI has added a powerful PDF export feature to its Deep Research tool, signaling a major push into enterprise AI and transforming how businesses generate and share insights.Read More",
        "content": "OpenAI has added a powerful PDF export feature to its Deep Research tool, signaling a major push into enterprise AI and transforming how businesses generate and share insights.Read More"
      },
      {
        "title": "New fully open source vision encoder OpenVision arrives to improve on OpenAI’s Clip, Google’s SigLIP",
        "url": "https://venturebeat.com/ai/new-fully-open-source-vision-encoder-openvision-arrives-to-improve-on-openais-clip-googles-siglip/",
        "source": "VentureBeat",
        "category": "technology",
        "published": "Mon, 12 May 2025 18:19:20 +0000",
        "published_datetime": "2025-05-12T19:19:20",
        "summary": "A vision encoder is a necessary component for allowing many leading LLMs to be able to work with images uploaded by users.Read More",
        "content": "A vision encoder is a necessary component for allowing many leading LLMs to be able to work with images uploaded by users.Read More"
      }
    ],
    "article_count": 9,
    "dominant_terms": [
      "openai",
      "ai",
      "enterprises",
      "anthropic",
      "read",
      "apple",
      "google",
      "llms",
      "reasoning",
      "away",
      "usage",
      "models",
      "vision",
      "enterprise",
      "platform",
      "reveals",
      "new",
      "share",
      "major",
      "report"
    ],
    "sentiment": {
      "compound": 0.38282222222222223,
      "positive": 0.11088888888888888,
      "negative": 0.03988888888888889,
      "neutral": 0.8492222222222222,
      "overall": "positive"
    },
    "relevance_score": 0.6842311440386445,
    "suggested_title": "Notion bets big on integrated LLMs, adds GPT-4.1 and Claude 3.7 to platform",
    "keywords": [
      "openai",
      "ai",
      "enterprises",
      "anthropic",
      "read",
      "apple",
      "google",
      "llms",
      "reasoning",
      "away",
      "Notion",
      "GPT-4.1",
      "Claude",
      "OpenAI-backed",
      "Harvey"
    ],
    "summary": "New Poe data reveals major shifts in AI market share as OpenAI and Google gain ground while specialized reasoning models surge to 10% of usage in 2025.Read More Notion used OpenAI's GPT-4.1 and Anthropic's Claude 3.7 for its new AI features for enterprises, moving away from reasoning models.Read More OpenAI has added a powerful PDF export feature to its Deep Research tool, signaling a major push into enterprise AI and transforming how businesses generate and share insights.Read More AI power rankings upended: OpenAI, Google rise as Anthropic falls, Poe report finds"
  },
  {
    "id": 9,
    "articles": [
      {
        "title": "Elon Musk’s apparent power play at the Copyright Office completely backfired",
        "url": "https://www.theverge.com/politics/666179/maga-elon-musk-sacks-copyright-office-perlmutter",
        "source": "The Verge",
        "category": "technology",
        "published": "2025-05-13T18:17:12-04:00",
        "published_datetime": "2025-05-13T23:17:12",
        "summary": "\n\n\n\nWhat initially appeared to be a power play by Elon Musk and the Department of Government Efficiency (DOGE) to take over the US Copyright Office by having Donald Trump remove the officials in charge has now backfired in spectacular fashion, as Trump's acting replacements are known to be unfriendly - and even downright hostile - to the tech industry. \nWhen Trump fired Librarian of Congress Carla Hayden last week and Register of Copyrights Shira Perlmutter over the weekend, it was seen as another move driven by the tech wing of the Republican Party - especially in light of the Copyright Office releasing a pre-publication report saying some kinds of generative AI training would not be considered fair use. And when two men showed up at the Copyright Office inside the Library of Congress carrying letters purporting to appoint them to acting leadership positions, the DOGE takeover appeared to be complete.\nBut those two men, Paul Perkins and Brian Nieves, were not DOGE at all, but instead approved by the MAGA wing of the Trump coalition that aims to put tech companies in check. \nPerkins, now the supposed acting Register of Copyrights, is an eight-year veteran of the DOJ who served in t …\nRead the full story at The Verge.",
        "content": "\n\n\n\nWhat initially appeared to be a power play by Elon Musk and the Department of Government Efficiency (DOGE) to take over the US Copyright Office by having Donald Trump remove the officials in charge has now backfired in spectacular fashion, as Trump's acting replacements are known to be unfriendly - and even downright hostile - to the tech industry. \nWhen Trump fired Librarian of Congress Carla Hayden last week and Register of Copyrights Shira Perlmutter over the weekend, it was seen as another move driven by the tech wing of the Republican Party - especially in light of the Copyright Office releasing a pre-publication report saying some kinds of generative AI training would not be considered fair use. And when two men showed up at the Copyright Office inside the Library of Congress carrying letters purporting to appoint them to acting leadership positions, the DOGE takeover appeared to be complete.\nBut those two men, Paul Perkins and Brian Nieves, were not DOGE at all, but instead approved by the MAGA wing of the Trump coalition that aims to put tech companies in check. \nPerkins, now the supposed acting Register of Copyrights, is an eight-year veteran of the DOJ who served in t …\nRead the full story at The Verge."
      },
      {
        "title": "If Congress actually cancels the SLS rocket, what happens next?",
        "url": "https://arstechnica.com/space/2025/05/if-congress-actually-cancels-the-sls-rocket-what-happens-next/",
        "source": "Ars Technica",
        "category": "technology",
        "published": "Tue, 13 May 2025 19:49:46 +0000",
        "published_datetime": "2025-05-13T20:49:46",
        "summary": "The White House Office of Management and Budget dropped its \"skinny\" budget proposal for the federal government earlier this month, and the headline news for the US space program was the cancellation of three major programs: the Space Launch System rocket, Orion spacecraft, and Lunar Gateway.\nOpinions across the space community vary widely about the utility of these programs—one friend in the industry predicted a future without them to be so dire that Artemis III would be the last US human spaceflight of our lifetimes. But there can be no question that if such changes are made they would mark the most radical remaking of NASA in two decades.\nThis report, based on interviews with multiple sources inside and out of the Trump administration, seeks to explain what the White House is trying to do with Moon and Mars exploration, what this means for NASA and US spaceflight, and whether it could succeed.Read full article\nComments",
        "content": "The White House Office of Management and Budget dropped its \"skinny\" budget proposal for the federal government earlier this month, and the headline news for the US space program was the cancellation of three major programs: the Space Launch System rocket, Orion spacecraft, and Lunar Gateway.\nOpinions across the space community vary widely about the utility of these programs—one friend in the industry predicted a future without them to be so dire that Artemis III would be the last US human spaceflight of our lifetimes. But there can be no question that if such changes are made they would mark the most radical remaking of NASA in two decades.\nThis report, based on interviews with multiple sources inside and out of the Trump administration, seeks to explain what the White House is trying to do with Moon and Mars exploration, what this means for NASA and US spaceflight, and whether it could succeed.Read full article\nComments"
      },
      {
        "title": "PDF to Text, a challenging problem",
        "url": "https://www.marginalia.nu/log/a_119_pdf/",
        "source": "Hacker News",
        "category": "technology",
        "published": "Tue, 13 May 2025 15:01:09 +0000",
        "published_datetime": "2025-05-13T16:01:09",
        "summary": "Comments",
        "content": "Comments"
      },
      {
        "title": "Copyright Office head fired after reporting AI training isn’t always fair use",
        "url": "https://arstechnica.com/tech-policy/2025/05/copyright-office-head-fired-after-reporting-ai-training-isnt-always-fair-use/",
        "source": "Ars Technica",
        "category": "technology",
        "published": "Mon, 12 May 2025 19:37:19 +0000",
        "published_datetime": "2025-05-12T20:37:19",
        "summary": "A day after the US Copyright Office dropped a bombshell pre-publication report challenging artificial intelligence firms' argument that all AI training should be considered fair use, the Trump administration fired the head of the Copyright Office, Shira Perlmutter—sparking speculation that the controversial report hastened her removal.\nTensions have apparently only escalated since. Now, as industry advocates decry the report as overstepping the office's authority, social media posts on Monday described an apparent standoff at the Copyright Office between Capitol Police and men rumored to be with Elon Musk's Department of Government Efficiency (DOGE).\nA source familiar with the matter told Wired that the men were actually \"Brian Nieves, who claimed he was the new deputy librarian, and Paul Perkins, who said he was the new acting director of the Copyright Office, as well as acting Registrar,\" but it remains \"unclear whether the men accurately identified themselves.\" A spokesperson for the Capitol Police told Wired that no one was escorted off the premises or denied entry to the office.Read full article\nComments",
        "content": "A day after the US Copyright Office dropped a bombshell pre-publication report challenging artificial intelligence firms' argument that all AI training should be considered fair use, the Trump administration fired the head of the Copyright Office, Shira Perlmutter—sparking speculation that the controversial report hastened her removal.\nTensions have apparently only escalated since. Now, as industry advocates decry the report as overstepping the office's authority, social media posts on Monday described an apparent standoff at the Copyright Office between Capitol Police and men rumored to be with Elon Musk's Department of Government Efficiency (DOGE).\nA source familiar with the matter told Wired that the men were actually \"Brian Nieves, who claimed he was the new deputy librarian, and Paul Perkins, who said he was the new acting director of the Copyright Office, as well as acting Registrar,\" but it remains \"unclear whether the men accurately identified themselves.\" A spokesperson for the Capitol Police told Wired that no one was escorted off the premises or denied entry to the office.Read full article\nComments"
      },
      {
        "title": "Trump Appointees Blocked From Entering US Copyright Office",
        "url": "https://www.wired.com/story/us-copyright-office-trump-takeover/",
        "source": "Wired",
        "category": "technology",
        "published": "Mon, 12 May 2025 17:52:26 +0000",
        "published_datetime": "2025-05-12T18:52:26",
        "summary": "The two men appeared at the US Copyright Office days after the Trump administration fired its leader, who had just published a report about the use of copyrighted materials for AI training.",
        "content": "The two men appeared at the US Copyright Office days after the Trump administration fired its leader, who had just published a report about the use of copyrighted materials for AI training."
      }
    ],
    "article_count": 5,
    "dominant_terms": [
      "office",
      "copyright",
      "trump",
      "challenging",
      "men",
      "report",
      "pdf",
      "problem",
      "acting",
      "fired",
      "training",
      "space",
      "appeared",
      "administration",
      "comments",
      "doge",
      "congress",
      "use",
      "white",
      "perkins"
    ],
    "sentiment": {
      "compound": -0.32161999999999996,
      "positive": 0.066,
      "negative": 0.1254,
      "neutral": 0.8088000000000001,
      "overall": "negative"
    },
    "relevance_score": 0.6401055868761574,
    "suggested_title": "Elon Musk’s apparent power play at the Copyright Office completely backfired",
    "keywords": [
      "office",
      "copyright",
      "trump",
      "challenging",
      "men",
      "report",
      "pdf",
      "problem",
      "acting",
      "fired",
      "Elon",
      "Musk",
      "Congress",
      "SLS",
      "Text"
    ],
    "summary": "The two men appeared at the US Copyright Office days after the Trump administration fired its leader, who had just published a report about the use of copyrighted materials for AI training. A day after the US Copyright Office dropped a bombshell pre-publication report challenging artificial intelligence firms' argument that all AI training should be considered fair use, the Trump administration fired the head of the Copyright Office, Shira Perlmutter—sparking speculation that the controversial report hastened her removal."
  },
  {
    "id": 6,
    "articles": [
      {
        "title": "$25B-valued Chime files for an IPO, reveals $33M deal with Dallas Mavericks",
        "url": "https://techcrunch.com/2025/05/13/25b-valued-chime-files-for-an-ipo-reveals-33m-deal-with-dallas-mavericks/",
        "source": "TechCrunch",
        "category": "technology",
        "published": "Tue, 13 May 2025 22:21:36 +0000",
        "published_datetime": "2025-05-13T23:21:36",
        "summary": "At long last, digital consumer bank Chime has moved forward with its IPO by filing its S-1 paperwork Tuesday. Chime had reportedly filed confidential S-1 paperwork back in December. S-1 filings typically reveal all kinds of information, covering financial, legal, and other risk factors. But Chime’s S-1 documents still have a lot of blank spaces. […]",
        "content": "At long last, digital consumer bank Chime has moved forward with its IPO by filing its S-1 paperwork Tuesday. Chime had reportedly filed confidential S-1 paperwork back in December. S-1 filings typically reveal all kinds of information, covering financial, legal, and other risk factors. But Chime’s S-1 documents still have a lot of blank spaces. […]"
      },
      {
        "title": "FCC threatens EchoStar licenses for spectrum that SpaceX wants to use",
        "url": "https://arstechnica.com/tech-policy/2025/05/fcc-threatens-echostar-licenses-for-spectrum-that-spacex-wants-to-use/",
        "source": "Ars Technica",
        "category": "technology",
        "published": "Tue, 13 May 2025 18:15:46 +0000",
        "published_datetime": "2025-05-13T19:15:46",
        "summary": "Federal Communications Commission Chairman Brendan Carr has threatened to revoke EchoStar licenses for radio frequency bands coveted by rival firms including SpaceX, which alleges that EchoStar is underutilizing the spectrum.\n\"I have directed agency staff to begin a review of EchoStar's compliance with its federal obligations to provide 5G service throughout the United States per the terms of its federal spectrum licenses,\" Carr wrote in a May 9 letter to EchoStar Chairman Charles Ergen. EchoStar and its affiliates \"hold a large number of FCC spectrum licenses that cover a significant amount of spectrum,\" the letter said.\nErgen defended his company's wireless deployment but informed investors that EchoStar \"cannot predict with any degree of certainty the outcome\" of the FCC proceedings. The letter from Carr and Ergen's statement is included in a Securities and Exchange Commission filing submitted by EchoStar today. EchoStar's stock price was down about 8 percent in trading today.Read full article\nComments",
        "content": "Federal Communications Commission Chairman Brendan Carr has threatened to revoke EchoStar licenses for radio frequency bands coveted by rival firms including SpaceX, which alleges that EchoStar is underutilizing the spectrum.\n\"I have directed agency staff to begin a review of EchoStar's compliance with its federal obligations to provide 5G service throughout the United States per the terms of its federal spectrum licenses,\" Carr wrote in a May 9 letter to EchoStar Chairman Charles Ergen. EchoStar and its affiliates \"hold a large number of FCC spectrum licenses that cover a significant amount of spectrum,\" the letter said.\nErgen defended his company's wireless deployment but informed investors that EchoStar \"cannot predict with any degree of certainty the outcome\" of the FCC proceedings. The letter from Carr and Ergen's statement is included in a Securities and Exchange Commission filing submitted by EchoStar today. EchoStar's stock price was down about 8 percent in trading today.Read full article\nComments"
      },
      {
        "title": "Elon Musk’s The Boring Company might be in line for an Amtrak contract",
        "url": "https://techcrunch.com/2025/05/13/elon-musks-the-boring-company-might-be-in-line-for-an-amtrak-contract/",
        "source": "TechCrunch",
        "category": "technology",
        "published": "Tue, 13 May 2025 17:12:20 +0000",
        "published_datetime": "2025-05-13T18:12:20",
        "summary": "Federal railroad regulators are in talks with Elon Musk’s tunneling firm, The Boring Company (TBC), over a multibillion-dollar Amtrak project, according to The New York Times.  Citing sources familiar with the matter, the NYT reports that Federal Railroad Administration officials have spoken with TBC to learn whether the Musk-owned company could save the agency money […]",
        "content": "Federal railroad regulators are in talks with Elon Musk’s tunneling firm, The Boring Company (TBC), over a multibillion-dollar Amtrak project, according to The New York Times.  Citing sources familiar with the matter, the NYT reports that Federal Railroad Administration officials have spoken with TBC to learn whether the Musk-owned company could save the agency money […]"
      },
      {
        "title": "FCC commissioner writes op-ed titled, “It’s time for Trump to DOGE the FCC“",
        "url": "https://arstechnica.com/tech-policy/2025/05/fcc-republican-wants-to-doge-the-fcc-give-money-to-elon-musks-starlink/",
        "source": "Ars Technica",
        "category": "technology",
        "published": "Mon, 12 May 2025 20:28:03 +0000",
        "published_datetime": "2025-05-12T21:28:03",
        "summary": "A Republican member of the Federal Communications Commission is proposing a DOGE-style overhaul of the agency's operations, including large cuts to the Universal Service Fund that subsidizes broadband deployment and access.\nFCC Commissioner Nathan Simington said the fund should reduce spending on fiber networks and give money to Starlink—helping Elon Musk, the man in charge of President Trump's DOGE initiative. Simington also argued that the FCC is using too many staff hours on reviewing license applications and should instead use automated systems to approve most license requests.\nIn a Daily Caller op-ed titled, \"It's Time For Trump To DOGE The FCC,\" Simington and his chief of staff, Gavin Wax, wrote that \"President Trump's vision for restoring constitutional government is finally taking shape, and nowhere is that more urgently needed than at the Federal Communications Commission.\"Read full article\nComments",
        "content": "A Republican member of the Federal Communications Commission is proposing a DOGE-style overhaul of the agency's operations, including large cuts to the Universal Service Fund that subsidizes broadband deployment and access.\nFCC Commissioner Nathan Simington said the fund should reduce spending on fiber networks and give money to Starlink—helping Elon Musk, the man in charge of President Trump's DOGE initiative. Simington also argued that the FCC is using too many staff hours on reviewing license applications and should instead use automated systems to approve most license requests.\nIn a Daily Caller op-ed titled, \"It's Time For Trump To DOGE The FCC,\" Simington and his chief of staff, Gavin Wax, wrote that \"President Trump's vision for restoring constitutional government is finally taking shape, and nowhere is that more urgently needed than at the Federal Communications Commission.\"Read full article\nComments"
      }
    ],
    "article_count": 4,
    "dominant_terms": [
      "fcc",
      "federal",
      "musk",
      "spectrum",
      "commission",
      "elon",
      "company",
      "agency",
      "filing",
      "doge",
      "letter",
      "trump",
      "staff",
      "reveal",
      "reportedly",
      "documents",
      "kinds",
      "communications",
      "files",
      "consumer"
    ],
    "sentiment": {
      "compound": 0.080875,
      "positive": 0.040749999999999995,
      "negative": 0.035,
      "neutral": 0.92425,
      "overall": "positive"
    },
    "relevance_score": 0.5041393799675926,
    "suggested_title": "$25B-valued Chime files for an IPO, reveals $33M deal with Dallas Mavericks",
    "keywords": [
      "fcc",
      "federal",
      "musk",
      "spectrum",
      "commission",
      "elon",
      "company",
      "agency",
      "filing",
      "doge",
      "Chime",
      "IPO",
      "Dallas",
      "Mavericks",
      "EchoStar"
    ],
    "summary": "In a Daily Caller op-ed titled, \"It's Time For Trump To DOGE The FCC,\" Simington and his chief of staff, Gavin Wax, wrote that \"President Trump's vision for restoring constitutional government is finally taking shape, and nowhere is that more urgently needed than at the Federal Communications Commission. FCC Commissioner Nathan Simington said the fund should reduce spending on fiber networks and give money to Starlink—helping Elon Musk, the man in charge of President Trump's DOGE initiative. A Republican member of the Federal Communications Commission is proposing a DOGE-style overhaul of the agency's operations, including large cuts to the Universal Service Fund that subsidizes broadband deployment and access."
  }
]